[
  {
    "title": "Trump pleads not guilty to 34 felony counts",
    "description": "",
    "link": "https://edition.cnn.com/webview/politics/live-news/trump-indictment-stormy-daniels-news-04-03-23/index.html",
    "published": "",
    "source": "http://rss.cnn.com/rss/edition.rss",
    "content_type": "rss",
    "full_content": "What we covered hereFormer PresidentDonald Trumparrived in New York City Monday, a day before he is expected to turn himself in to law enforcement andface more than 30 criminal chargesin a Manhattan court following last week’s historic grand jury indictment.News outlets will not be allowedto broadcast the Tuesday arraignment, a judge ruled Monday night.Trump’s legal team said the former president will voluntarily surrender and will look tochallenge “every potential issue”once the indictment is unsealed.Trump, who has vowed to continue his 2024 bid, is the first current or former president in US history who has faced criminal charges. The district attorney’s officehas been investigatingTrump’s alleged role in a hush money payment scheme involving adult film star Stormy Daniels that dates to the 2016 presidential election. AllCatch Up34 PostsOur live coverage ofTrump’s historic indictment has moved.Link Copied!Trump arraignment has \"unparalleled public interest,\" but it won't be broadcast, judge saysFrom CNN's Tierney SneedActing New York Supreme Court Judge Juan Merchan wrote his Monday night order that the media’s request to broadcast the arraignment of former President Donald Trump was understandable, but that the news organizations’ interests in providing the broadest possible access to the proceedings must be weighed against “competing interests.”In rejecting the request to broadcast the arraignment live on television, Merchan still wrote about the historical significance of the proceeding in stark terms.“That this indictment involves a matter of monumental significance cannot possibly be disputed. Never in the history of the United States has a sitting or past President been indicted on criminal charges. Mr. Trump’s arraignment has generated unparalleled public interest and media attention,” he wrote. “The populace rightly hungers for the most accurate and current information available. To suggest otherwise would be disingenuous.”Link Copied!Judge will only briefly allow photos in the courtroom before Trump arraignment beginsFrom CNN's Tierney SneedNews outlets will not be allowed to broadcast formerPresident Donald Trump’s arraignmenton Tuesday in a New York state court, a judge said Monday night, but he will allow some photographers to take pictures in the courtroom before the proceedings formally begin.Acting New York Supreme Court Judge Juan Merchanrejected the requestby several media organizations, including CNN, for permission to broadcast the historic proceedings. Trump’s arraignment — like most arraignments in the Manhattan courthouse — is a public proceeding, but news cameras are not usually allowed to broadcast from inside the courtroom.However, the judge is allowing five pool photographers to take still photos at the beginning of the proceedings “until such time as they are directed to vacate the jury box by court personnel.”Earlier on Monday, Trump’s lawyers urged the judge to reject the media’s request for live cameras in the courtroom. The Manhattan District Attorney’s office told the judge they didn’t have a position.The media outlets that tried to get cameras into the courtroom argued that “the gravity of this proceeding … and, consequently, the need for the broadest possible public access, cannot be overstated.”Trump is now in Manhattan ahead of the arraignment.A grand jury indicted the former presidentlast week.The arraignment is also expected to bring the unsealing of the criminal charges against Trump, which have not yet been seen by his lawyers or the public.The indictment stems from Manhattan District Attorney Alvin Bragg’sinvestigationinto hush-money payments, made during the 2016 presidential campaign, to women who claimed they had extramarital affairs with Trump, which he denies.Trump denies all wrongdoing and his lawyers said last week that they’ll fight toget the charges dropped.Link Copied!Tuesday is the first test for Trump to navigate a legal and political strategyFrom CNN's Jeff ZelenyDonald Trump is not planning to speak publicly in New York on Tuesday, aides say, if he follows advice from members of his legal team who have urged the former President to refrain from the vitriol he’s been directing toward theprosecutorandjudgepresiding over the case.But that restraint does not extend to Florida, aides said, where he is planning to deliver a full-throated defense of his New York case as well asother investigations he is facingduring a prime time address from Mar-a-Lago on Tuesday night.It’s the first test to see whether Trump can navigate two vasty different approaches to hislegal caseand hispolitical campaign, which are now inextricably linked.“He’s taking this very seriously and following legal advice,” an adviser to Trump said Monday night. “He will make his case to Americans Tuesday night at Mar-a-Lago.”Link Copied!Trump is \"ready to go in and do what he needs to do tomorrow,\" attorney saysFrom CNN's Mary Kay MalloneeAlina Habba, lawyer for former President Donald Trump"
  },
  {
    "title": "Haberman reveals why Trump attacked judge and his family in speech",
    "description": "CNN political contributor Maggie Haberman explains the reasoning behind Donald Trump's attacks on the judge and his family during a speech at his Mar-a-Lago resort after he was arraigned on felony charges.",
    "link": "https://www.cnn.com/videos/politics/2023/04/05/maggie-haberman-donald-trump-speech-indictment-reaction-sot-cnntm-vpx.cnn",
    "published": "Wed, 05 Apr 2023 13:30:09 GMT",
    "source": "http://rss.cnn.com/rss/edition.rss",
    "content_type": "rss",
    "full_content": "Haberman reveals why Trump attacked judge and his family in speech | CNN PoliticsCNN values your feedback1. How relevant is this ad to you?2. Did you encounter any technical issues?Video player was slow to load contentVideo content never loadedAd froze or did not finish loadingVideo content did not start after adAudio on ad was too loudOther issuesAd never loadedAd prevented/slowed the page from loadingContent moved around while ad loadedAd was repetitive to ads I've seen previouslyOther issuesCancelSubmitThank You!Your effort and contribution in providing this feedback is much\n                                        appreciated.CloseClose iconPoliticsTrumpFacts FirstCNN Polls2025 ElectionsMoreTrumpFacts FirstCNN Polls2025 ElectionsWatchListenLive TVSubscribeSign inMy AccountSettingsNewslettersTopics you followSign outYour CNN accountSign in to your CNN accountSign inMy AccountSettingsNewslettersTopics you followSign outYour CNN accountSign in to your CNN accountLive TVListenWatchEditionUSInternationalArabicEspañolEditionUSInternationalArabicEspañolTrumpFacts FirstCNN Polls2025 ElectionsFollow CNN PoliticsWorldAfricaAmericasAsiaAustraliaChinaEuropeIndiaMiddle EastUnited KingdomUS PoliticsTrumpFacts FirstCNN Polls2025 ElectionsBusinessTechMediaCalculatorsVideosMarketsPre-marketsAfter-HoursFear & GreedInvestingMarkets NowNightcapHealthLife, But BetterFitnessFoodSleepMindfulnessRelationshipsEntertainmentMoviesTelevisionCelebrityTechInnovateForeseeable FutureMission: AheadWork TransformedInnovative CitiesStyleArtsDesignFashionArchitectureLuxuryBeautyVideoTravelDestinationsFood & DrinkStayNewsVideosSportsFootballTennisGolfMotorsportUS SportsOlympicsClimbingEsportsHockeyScienceSpaceLifeUnearthedClimateSolutionsWeatherWeatherVideoClimateUkraine-Russia WarIsrael-Hamas WarFeaturesAs EqualsCall to EarthFreedom ProjectImpact Your WorldInside AfricaCNN HeroesWatchLive TVCNN FastShows A-ZCNN10CNN MaxCNN TV SchedulesListenCNN 5 ThingsChasing Life with Dr. Sanjay GuptaThe Assignment with Audie CornishOne ThingTug of WarCNN Political BriefingThe Axe FilesAll There Is with Anderson CooperAll CNN Audio podcastsGamesDaily CrosswordJumble CrosswordPhoto ShuffleSudoblockSudoku5 Things QuizAbout CNNPhotosInvestigationsCNN ProfilesCNN LeadershipCNN NewslettersWork for CNNHaberman reveals why Trump attacked judge and his family in speechUpdated\n          9:30 AM EDT, Wed April 5, 2023Video Ad FeedbackHaberman reveals why Trump attacked judge and his family in speechLink Copied!CNN political contributor Maggie Haberman explains the reasoning behind Donald Trump's attacks on the judge and his family during a speech at his Mar-a-Lago resort after he was arraigned on felony charges.02:11- Source:CNNLatest Videos16 videosVideo Ad FeedbackHaberman reveals why Trump attacked judge and his family in speech02:11Now playing- Source:CNNVideo Ad Feedback'I thought, do or die': How a Ukrainian soldier cycled to safety after Russian assault01:55Now playing- Source:CNNVideo Ad Feedback'A human skeleton, buried alive': Brother of emaciated Israeli hostage speaks to CNN03:09Now playing- Source:CNNVideo Ad FeedbackSean ‘Diddy’ Combs’ ex asks judge to release him on bail03:09Now playing- Source:CNNVideo Ad Feedback'Racist, gerrymandered map': Texas Democrat blasts GOP-drawn congressional map03:34Now playing- Source:CNNVideo Ad Feedback'An extraordinary move': CNN reporter explains why Texas Democrats left the state01:11Now playing- Source:CNNVideo Ad FeedbackSen. Booker was asked about Democrats’ credibility. Hear his response01:37Now playing- Source:CNNVideo Ad FeedbackWhy back-to-school shopping is starting early this year02:04Now playing- Source:CNNVideo Ad FeedbackThis is how a fire cloud formed in the Grand Canyon 'megafire'01:02Now playing- Source:CNNVideo Ad Feedback'Very risky business': John Bolton reacts to Trump's nuclear subs order03:18Now playing- Source:CNNVideo Ad FeedbackSydney Sweeney's American Eagle ad campaign sparks controversy02:27Now playing- Source:CNNVideo Ad FeedbackPaul Whelan describes challenges of returning home after being imprisoned abroad04:21Now playing- Source:CNNVideo Ad FeedbackWhat Ghislaine Maxwell’s move to a lower-security federal prison camp could signal01:55Now playing- Source:CNNVideo Ad FeedbackHawaii breathes a massive sigh of relief after tsunami scare shakes island02:59Now playing- Source:CNNVideo Ad FeedbackVideo shows police arrest man accused of killing couple on a hike with kids01:11Now playing- Source:CNNVideo Ad FeedbackPassenger describes 'significant turbulence' that forced Delta flight to make emergency landing01:17Now playing- Source:CNNSee More VideosAd FeedbackSubscribeSign inMy AccountSettingsNewslettersTopics you followSign outYour CNN accountSign in to your CNN accountLive TVListenWatchWorldAfricaAmericasAsiaAustraliaChinaEuropeIndiaMiddle EastUnited KingdomUS PoliticsTrumpFacts FirstCNN Polls2025 ElectionsBusinessTechMediaCalculatorsVideosMarketsPre-marketsAfter-HoursFear & GreedInvesti"
  },
  {
    "title": "What to know about the Trump indictment on the eve of his court appearance",
    "description": "",
    "link": "https://www.cnn.com/collections/intl-trump-040223/",
    "published": "Wed, 05 Apr 2023 22:50:06 GMT",
    "source": "http://rss.cnn.com/rss/edition.rss",
    "content_type": "rss",
    "full_content": ""
  },
  {
    "title": "He is a human skeleton, Gaza hostage's brother tells BBC",
    "description": "Ilay David says the Hamas video showing his brother Evyatar emaciated and weak is a \"new form of cruelty\" that has left his parents shattered.",
    "link": "https://www.bbc.com/news/articles/cewyk4ezeedo?at_medium=RSS&at_campaign=rss",
    "published": "Mon, 04 Aug 2025 17:05:21 GMT",
    "source": "http://feeds.bbci.co.uk/news/rss.xml",
    "content_type": "rss",
    "full_content": "He is a human skeleton, Gaza hostage's brother tells BBC6 hours agoShareSaveJon DonnisonBBC NewsReporting fromJerusalemPaulin KolaBBC NewsReporting fromLondonShareSave'It's a new kind of cruelty', says Gaza hostage's brotherThe brother of an Israeli hostage held in the Gaza Strip has told the BBC that a Hamas video showing him emaciated and weak is a \"new form of cruelty\" that has left his parents shattered.Hamas released the footage of Evyatar David, 24, on Saturday, drawing strong condemnation from Israel and Western leaders.\"He's a human skeleton. He was being starved to the point where he can be dead at any moment, and he suffers a great deal. He barely can't speak, he barely can move,\" David's brother Ilay said in an interview on Monday.In the video, Evyatar says: \"I haven't eaten for days... I barely got drinking water.\" He is seen digging what he says will be his own grave.OtherA still showing Israeli hostage Evyatar David being held in a Gaza tunnel from the video released by HamasHostages' families have urged Prime Minister Benjamin Netanyahu to prioritise their release as reports suggest he might be planning to expand the military campaign.The footage of Evyatar was released after Palestinian Islamic Jihad published video of another hostage, Rom Braslavski, thin and crying.Both men were abducted from the Nova music festival during the Hamas-led attack on southern Israel on 7 October 2023.They are among 50 hostages still being held in Gaza, 20 of whom are believed to be alive.Ilay David said his father had barely recognised his son Evyatar's voice on the video and had not been able to sleep. He said his mother cried all day.\"Seeing those images of my brother as a human skeleton, we understood it's, it's, it's a new kind of cruelty,\" Mr David said. \"It's the lowest you can get.\"He called on world leaders to unite to save him and other hostages \"from the cruel, twisted hands of Hamas\".\"So we have to be so focused on delivering the message, which is, Evyatar is dying, we need to give him medicine, to give him food, proper food, and you need to get this treatment now, or else will die.\"Hamas's armed wing has denied it intentionally starves prisoners, saying hostages eat what their fighters and people in Gaza eat.Ilay DavidEvyatar David (L) with his brother Ilay shown here in happier timesHundreds of Israeli ex-officials appeal to Trump to help end Gaza warWorld leaders condemn videos of emaciated Israeli hostages in Gaza as Red Cross calls for accessFamine 'currently playing out' in Gaza, UN-backed experts warnAfter the hostages' videos were released, Netanyahu spoke with their families, telling them that efforts to return all the hostages \"will continue constantly and relentlessly\".But an Israeli official - widely quoted by local media - said Netanyahu was working to free the hostages through \"the military defeat of Hamas\".The possibility of a new escalation in Gaza may further anger Israel's allies who have been pushing for an immediate ceasefire as reports of Palestinians dying from starvation or malnutrition cause shock around the world.The main group supporting hostages' families condemned the idea of a new military offensive saying: \"Netanyahu is leading Israel and the hostages to doom.\"That view was pointedly made in a letter by some 600 retired Israeli security officials sent to US President Donald Trump urging him to pressure Israel to immediately end the war in Gaza.\"Your credibility with the vast majority of Israelis augments your ability to steer Prime Minister [Benjamin] Netanyahu and his government in the right direction: End the war, return the hostages, stop the suffering,\" they wrote.The group included former Mossad chief Tamir Pardo, Ami Ayalon, former chief of Shin Bet - Israel's domestic secret service agency - former Prime Minister Ehud Barak, and former Defence Minister Moshe Yaalon among others.\"It is our professional judgement that Hamas no longer poses a strategic threat to Israel,\" they said.\"At first this war was a just war, a defensive war, but when we achieved all military objectives, this war ceased to be a just war,\" said Ayalon.The former top leaders head the Commanders for Israel's Security (CIS) group, which has urged the government in the past to focus on securing the return of the hostages.\"Stop the Gaza War! On behalf of CIS, Israel's largest group of former IDF generals and Mossad, Shin Bet, Police, and Diplomatic Corps equivalents, we urge you to end the Gaza war. You did it in Lebanon. Time to do it in Gaza as well,\" they wrote to the US president.OtherA still of a video released by Palestinian Islamic Jihad showing hostage Rom BraslavskiIsrael launched a devastating war in Gaza following Hamas's 7 October attack in which about 1,200 people were killed and 251 taken into Gaza as hostages.More than 60,000 people have been killed as a result of Israel's military campaign in Gaza since 7 October, the Hamas-run health ministry says.On Monday, the ministry reported th"
  },
  {
    "title": "UK-French small boats pilot plan comes into force",
    "description": "The 'one-in, one-out' deal will see some of those arriving in the UK returned to France.",
    "link": "https://www.bbc.com/news/articles/cewykzegy4qo?at_medium=RSS&at_campaign=rss",
    "published": "Mon, 04 Aug 2025 21:34:23 GMT",
    "source": "http://feeds.bbci.co.uk/news/rss.xml",
    "content_type": "rss",
    "full_content": "UK-French small boats pilot plan comes into force2 hours agoShareSaveShareSaveEPAThe UK-French \"one-in, one-out\" pilot scheme, aimed at reducing the number of small boats crossing the Channel, has come into force with detentions of illegal migrants due to start within days.The deal will see some of those arriving in the UK in small boats detained and returned to France.In exchange the UK will accept from France an equal number of asylum seekers provided they have not already tried to make the crossing and can pass security and eligibility checks.Prime Minister Sir Keir Starmer said the plan was a \"product of months of grown-up diplomacy\" which would \"deliver real results\".But the Conservatives said it would \"make no difference whatsoever\".Sir Keir and French President Emmanuel Macron announced the agreement in July, but it was still subject to legal scrutiny by the European Commission and EU member states.The UK government has now said that the \"EU Commission, Germany and other member states have given the green light on this innovative approach\" meaning the scheme can go ahead.Under the plan, an adult migrant who tries to get to the UK by crossing the Channel could be returned to France if their claim for asylum is deemed to be inadmissible. Returns could begin to take place within weeks.UK and international law prevents the government from sending asylum seekers back to their country of origin before their claim has been considered and turned down. However, they can be sent to safe countries prepared to consider their claim.How many people cross the Channel in small boats?'One in, one out' sounds simple - but the migrant deal could be complicatedExtra 300 officers to tackle small boat people smugglingThe government has not confirmed how many migrants would be returned and accepted under the plan, but said it would look to \"ramp up both the pace and scale of returns over the course of the pilot scheme\".There have been reports that 50 people per week could be returned, compared to the weekly average of more than 800 people currently making the crossing.Sir Keir has previously said the pilot is not \"a silver bullet\" but believes it will deter people from making the dangerous journey following a big increase in the numbers so far this year.As of 30 July, more than 25,000 people had crossed the Channel in small boats in 2025 - around 49% higher than at the same point in 2024.The government is under pressure to reduce the numbers, having previously promised to \"smash the gangs\" organising the journeys.Home Secretary Yvette Cooper hailed the agreement as \"ground breaking\" and an \"important step towards undermining the business model of the organised crime gangs\".\"It is also right to make clear that – while the UK will always be ready to play its part alongside other countries in helping those fleeing persecution and conflict – this must be done in a controlled and managed legal way, not through dangerous, illegal, and uncontrolled routes,\" she said.On Monday, the government announced £100m to fund 300 National Crime Agency Officers to stop the people smugglers arranging the crossings.It has also said it wants to tackle illegal working, to reduce pull factors encouraging people to come to the UK.Conservative shadow home secretary Chris Philp said the government's deal with the French would be less effective than the Rwanda plan, proposed by the previous Conservative government.\"The Rwanda removals deterrent, under which 100% of illegal arrivals would be removed, was ready to go last summer but Labour cancelled it just days before it was due to start with no proper replacement plan,\" he said.\"As a result, this year so far has been the worst ever for illegal immigrants crossing the Channel.\"When the UK and France first announced the plan in July, the charity Asylum Matters criticised the measure, arguing: \"The only way to stop people from making dangerous journeys is to give them real safe routes to seek sanctuary.\"Migration"
  },
  {
    "title": "Storm Floris batters UK with winds over 80mph",
    "description": "An amber warning covers most of Scotland and there is a yellow warning in parts of England, Wales and Northern Ireland.",
    "link": "https://www.bbc.com/news/articles/c4gq3n049jno?at_medium=RSS&at_campaign=rss",
    "published": "Mon, 04 Aug 2025 22:49:37 GMT",
    "source": "http://feeds.bbci.co.uk/news/rss.xml",
    "content_type": "rss",
    "full_content": "Storm Floris batters UK with winds over 80mph14 minutes agoShareSaveRachel Muller-HeyndykBBC NewsElizabeth RizziniLead weather presenterShareSaveDamage and disruption as Storm Floris crashes into UKTravel disruption is expected to continue on Tuesday after Storm Floris battered parts of the country with 80mph winds.Scotland bore the brunt of the bad weather with some 43,500 homes without power on Monday night. Planes, trains and ferries were cancelled amid warnings of a \"threat to life\".Network Rail Scotland said it was working to remove debris and trees from routes following the \"unprecedented\" storm.Anamber warningwas place to 23:00 BST for most of Scotland, as well as a yellow warning that also covers northern England, north Wales and Northern Ireland.Storm Floris is the sixth named storm of the 2024/25 season and the first since January.Wick in the Highlands saw winds of 82mph, the strongest gusts recorded since Storm Floris struck on Monday.Some mountain locations saw wind gusts over 100mph, but meteorologists focus on sites where very strong gusts are less usual and likely to have more impact.There were reports of trees and campervans toppling over in the hardest hit areas.Events including the Royal Edinburgh Military Tattoo and shows at Fringe by the Sea in North Berwick were also cancelled.The yellow warning will remain in place for the Northern Isles off the north coast of Scotland until 08:00 on Tuesday, and 23:59 on Monday for all other areas.On Tuesday the weather will be less windy but still blustery with showers across northern and central areas.Follow updates: Storm Floris bringing 'unseasonably strong' winds to parts of the UKAmber weather warnings in place for most of Scotland as Storm Floris sweeps inHow do storms like Floris get their names?Why does it always rain in the school summer holidays?Passengers in Scotland have been warned disruption to the rail network is likely to continue into Tuesday.Ross Moran, Network Rail Scotland's route director, said: \"Our teams have been working tirelessly to keep services moving where possible and to clear fallen trees and debris from the tracks.\"Our teams will work through the night, but this work will continue into Tuesday morning.\"It comes after Lnerwarned passengers not to travel north of Newcastle on Monday. Customers with tickets can use them until Wednesday.Scottish ferry operator CalMac issued a series of cancellation warnings and warned of disruption across its network.Most of Scotland's major road bridges closed to high-sided vehicles and motorists were urged to slow down in poor weather and avoid exposed Highland and coastal routes.Several shows at the Edinburgh Fringe Festival were cancelled as a \"precautionary\" measure, and flights were cancelled in Northern Ireland due to the storm.Meanwhile, postal services were affected by Floris meaning that some students in Scotland will have to wait until Tuesday to receive their SQA exam results.Strong winds hit the coastal town of Largs in North AyrshireAngela Constance, the Scottish secretary for home affairs, encouraged people to check on elderly or vulnerable neighbours during the storm, and warned those travelling on Monday to view it as \"a winter journey\" and take warm clothes.Jim Dale, a meteorologist and founder of independent forecaster British Weather Services, warned those in areas affected by the warnings: \"If you are venturing out, keep away from the forest, keep away from the woods, keep off the coastal plain.\"Named storms in August are not that rare, with five taking place since 2020.Last year, Storm Lilian struck the UK on 23 August just before the bank holiday weekend, closing stages at the Leeds Festival and cancelling Heathrow flights.Storms Antoni and Betty brought disruption in 2023, while stormsEllenandFrancisin 2020 were described as \"two of the most notable August storms in the last 50 years\" by the Met Office.These two storms brought wind gusts of 79mph and 81mph respectively with transport disruption, coastal flooding and power cuts.The storm follows the UK's fifth warmest July on record, according to provisional figures from the Met Office.All four UK nations recorded one of their 10 warmest Julys, and July was the sixth consecutive month of above-average mean temperatures for the UK, the Met Office said.The first day of the month brought the highest temperature of the year so far, with 35.8C in Faversham, Kent."
  },
  {
    "title": "Texas Democrats block GOP redistricting plan by fleeing the state",
    "description": "The Texas House failed to reach the quorum needed to vote on a new congressional map that could have given Republicans five new seats, after House Democrats forced a legislative standstill.",
    "link": "https://www.npr.org/2025/08/04/g-s1-80957/texas-redistricting-quorum-walkout",
    "published": "Mon, 04 Aug 2025 17:31:22 -0400",
    "source": "https://feeds.npr.org/1001/rss.xml",
    "content_type": "rss",
    "full_content": "NationalTexas Democrats block GOP redistricting plan by fleeing the stateAugust 4, 20255:31 PM ETByLiz Baker,Andrew Schneider,Ally JarmanningTexas state Rep. Jolanda \"Jo\" Jones, a Democrat, flips through maps during a public hearing on congressional redistricting in Austin, Texas, Friday, Aug. 1, 2025. After the bill passed the committee, state Democrats fled to Illinois and New York to break the quorum and stall a vote on the new maps, which heavily favor Republicans.Eric Gay/APhide captiontoggle captionEric Gay/APThe Texas House of Representatives is at a standstill after Democrats fled the state over the weekend to prevent a vote on a bill to redraw Texas's congressional maps. The billheavily favorsRepublicans with five new GOP-leaning districts, something President Trump hasopenly advocated for.Republicans control the Texas House by a wide margin, but without Democrats present, their 88 members alone fall short of the 100-member quorum required to conduct business.\"To be absolutely clear, leaving the state doesn't stop this House from doing its work, it just delays it,\" Texas House Speaker Dustin Burrows told the members in the chamber after failing to reach a quorum.Sponsor MessageHe then asked for the chamber doors to be locked and quickly passed a motion for the Sergeant-at-Arms to issue civil arrest warrants for unexcused, absent House members.Many of the missinglawmakers fledto Democratic strongholds New York and Illinois rather than show up in the Texas Capitol in Austin for a vote they were certain to lose.\"This is like two football teams coming out of the locker room at halftime and the team that's ahead says they want to change the rules for the second half because they want to win the game,\" State Rep. James Talarico (D-Austin)told NPRfrom Illinois, where he is waiting out the quorum-break.PoliticsTexas Democrats walked out to block the GOP. How well has the tactic worked before?\"I mean, we all recognize that as cheating, plain and simple. And if the Republicans are going to cheat, Texas Democrats are not going to play.\"Texas Gov. Greg Abbott saidin a statementthat the quorum-breaking Democrats should \"behave like adults, rather than going AWOL,\" and should be expelled from office.On Monday, after the failed House session, he said he hadorderedthe Texas Department of Public Safety to \"locate, arrest, and return to the House chamber any member who has abandoned their duty to Texans.\"Sponsor MessageRepublican state Attorney General Ken Paxton, who is running for a U.S. Senate seat,said in a press releasethat the current legal framework \"allows for rogue lawmakers to be found, arrested, and brought back to the Capitol.\"Two Texas lawmakers attending the National Conference of State Legislatures in Boston spent Monday speaking to reporters and warning their colleagues in other states of what may be coming for them, too.\"It's Texas now, but it's going to continue through the rest of the states, and it's going to kill our democracy,\" Rep. Ana Hernandez told reporters.She and fellow Democrat Rep. Armando Walle were both planning to come to Boston before the bill was called in Texas. They plan to stay out of Texas until the special session ends Aug. 19.State Reps. Armando Walle, left, and Ana Hernandez, both Democrats from Houston, speak during a news conference at the National Conference of State Legislatures Summit, in Boston. They plan to stay out of state until the special session wraps up on August 19th.Michael Dwyer/APhide captiontoggle captionMichael Dwyer/APIn New York, where several of the Texas Democrats decamped to avoid arrest, Gov. Kathy Hochul held a press conference in support of the lawmakers, indicating that her majority-blue state would explore redrawing its own electoral map. Given the state's constitution, that may not be likely until 2027 or beyond.\"If Republicans are willing to rewrite these rules to give themselves an advantage, then they're leaving us no choice; we must do the same,\"Hochul stated.Redistricting usually occurs after a census, andmid-decade redrawslike this one in Texas are rare, but other states, including California and Missouri, are pushing for redistricting in their own attempts to lock in partisan advantages. Ohio, which went heavily for Trump, is redistricting this year due to a 2018 state law.This attempt by Texas Republicans was inserted into a special legislative session called by Gov. Abbott to address thedeadly Hill Country floodsthat killed at least 136 people last month, which Texas Democrats decry as a bait-and-switch.\"Gov. Abbott has used this tragedy, taken these families who are grieving, taken these communities who are struggling to recover, and used them as hostages in a political game,\" said state House Democratic Caucus Chair Gene Wu.Sponsor Message\"This vote is a profound act of contempt for the people of Texas. It is the final confirmation that to hold power, Republicans will gladly silence the voices of Black and Latino Texans who have fough"
  },
  {
    "title": "Wildfire smoke is like smoking 'half a pack a day.' Here's how to protect yourself",
    "description": "As Canadian wildfires spread smoke across the U.S. the air pollution is dangerous to health. But there are ways to protect yourself. Here's what to know<strong>.</strong>",
    "link": "https://www.npr.org/2025/08/04/nx-s1-5492448/health-michigan-canada-smoke-minnesota-air-quality-wildfire",
    "published": "Mon, 04 Aug 2025 17:08:25 -0400",
    "source": "https://feeds.npr.org/1001/rss.xml",
    "content_type": "rss",
    "full_content": "ClimateWildfire smoke is like smoking 'half a pack a day.' Here's how to protect yourselfAugust 4, 20255:08 PM ETByAlejandra Borunda,Julia SimonPeople play rugby in the hazy weather on July 27, 2025 in New York City. There are currently smoke advisories across the Midwest and Northeast as a result of wildfires in Canada.Liao Pan/China News Service/VCG via Getty Imageshide captiontoggle captionLiao Pan/China News Service/VCG via Getty ImagesThis story is updated to reflect the current wildfire smoke conditions in the U.S. The original story was publishedJan. 8, 2025.Smoke from Canadian wildfires continued to prompt air quality alerts Monday in the Northeast U.S. as well as the Upper Midwest.Michigan saw astatewide air quality advisoryon Monday, and while Minnesota is seeing some relief, the wildfire smoke ispersisting in Wisconsin, andspreading across New York,Vermont, andMaine.Canada is experiencing its second worst wildfire season on record, according to government data. There have been nearly 4,000 fires recorded already this calendar year.Sponsor MessageExposure to wildfire smoke is a growing health problem across the country, as human-caused climate change increases the risk and intensity of wildfires and the smoke that can drift thousands of miles downwind from them.Here's what you need to know about the health risks — and how to protect yourself.The health risks of breathing wildfire smokeMay-Lin Wilgus, a pulmonologist and professor at UCLA, compares breathing wildfire smoke to smoking cigarettes – a lot of cigarettes.Scientists track air quality with theair quality index, or AQI, which incorporates different pollution sources like ozone and fine particulates. Many scientists don't think there's a \"safe\" AQI level becausethe measurement doesn't capture many harmful pollutants, but under 50 is often considered acceptable. Higher numbers indicate more health-damaging pollution in the air.OnMonday the AQI in Detroit was at least 159. On a smoky day, when AQI levels reach 100 to 200, \"the exposure to the fine particulate matter, the air pollution, is similar to smoking aquarter to half a pack a day,\" Wilgus says.That exposure takes a toll on a healthy person. But it is particularly harmful for those with pre-existing health issues, Wilgus adds. Emergency room visits for respiratory issues like asthma and COPDincrease dramaticallyduring wildfire smoke events, as much asdoubling in somecases. During the Canadian wildfires in 2023, when smoke wafted across much of the U.S., emergency room visits for asthmaincreased by nearly 20%.Sponsor MessageSmoke exposure can alsoworsen other medical conditions. Emergency departments see morecardiovascularrelated visits after smoky days. And a growing body of research suggests smoke exposure is linked to long-term impacts such as a higher risk ofdeveloping dementia.Overall, air quality has improved in the U.S. over the past 20 years, says Tarik Benmarhnia, a climate and health scientist at the Scripps Institution of Oceanography at the University of California, San Diego. But wildfire smoke iserasing many of those gains.\"Just maybe like ten years ago wildfire was an exceptional issue. It was something that happens once in a lifetime for most people,\" he says.But climate change has increased the chance of wildfires across many parts of the country, and the intensity of many of the burns themselves and the smoke they produce.\"This is unfortunately not the first one and not the last one the people in Los Angeles are going to be experiencing,\" Benmarhnia says.Wondering what AQI is safe and what activities are safe at different AQIs? Life Kitexplains.The dangers of breathing wildfire smokeWildfires burn at extremely high temperatures, which makes their ash more toxic than other pollution, such as car exhaust. But in many cases, including during these ongoing fires,it's not just trees and organic matter that burn. Homes, cars and other materials go up in flames, too, adding potentially harmful particles to the pollution load.\"It's just a toxic soup,\" says Lisa Miller, a wildfire smoke expert at the University of California, Davis. \"Think of all the synthetic fibers that are present in your living room – in your couch, in your carpet, in your clothes. All those things can be particularly toxic\" if they go up in smoke, she says.Higher risks for some peopleWildfire smoke is hazardous for everyone, but it's especially dangerous for some people, including children and older adults, pregnant people and anyone with preexisting health problems.Sponsor MessageFirst responders and firefighters are exposed to the worst of the smoke. A 2019 study found that heavy, repeated smoke exposure among wildland firefighters is linked withhigher risks of lung cancer and cardiovascular disease.Children can beespecially vulnerable, doctors say, because they breathe in more air – and therefore more smoke – relative to their body size.Pregnant people should also take care, says Miller. There's growing "
  },
  {
    "title": "The Global Impact of the Latest U.S. Tariffs",
    "description": "<p class=\"readrate\">The Trump Administration’s worldwide tariff wars continue.  A top priority for Trump has been resetting U.S. trade relations and earlier this year his administration had vowed “90 deals in 90 days”. But as the August 1st deadline came and went, what emerged wasn’t a flurry of deals but a wave of new tariffs.  We hear from reporters around the world about how countries are reacting to the news and what the impact could be.",
    "link": "https://www.npr.org/2025/08/04/nx-s1-5492483/the-global-impact-of-the-latest-u-s-tariffs",
    "published": "Mon, 04 Aug 2025 16:49:02 -0400",
    "source": "https://feeds.npr.org/1001/rss.xml",
    "content_type": "rss",
    "full_content": "State of the World from NPRNPRState of the World from NPRLISTEN & FOLLOWNPR AppApple PodcastsSpotifyAmazon MusiciHeart RadioYouTube MusicRSS linkThe Global Impact of the Latest U.S. TariffsAugust 4, 20254:49 PM ETByJackie Northam,Kate Bartlett,Jane Arraf,Michael Sullivan,Greg DixonThe Global Impact of the Latest U.S. TariffsListen·7:237:23Toggle more optionsDownloadEmbedEmbed<iframe src=\"https://www.npr.org/player/embed/nx-s1-5492483/nx-s1-9397225\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">Shipping containers sit stacked at the Evergreen terminal at the port of Los Angeles, Friday, Aug. 1, 2025.Damian Dovarganes/ APhide captiontoggle captionDamian Dovarganes/ APThe Trump Administration’s worldwide tariff wars continue.  A top priority for Trump has been resetting U.S. trade relations and earlier this year his administration had vowed “90 deals in 90 days”. But as the August 1st deadline came and went, what emerged wasn’t a flurry of deals but a wave of new tariffs.  We hear from reporters around the world about how countries are reacting to the news and what the impact could be.Sponsor MessageFacebookFlipboardEmail The Global Impact of the Latest U.S. TariffsListen·7:237:23Toggle more optionsDownloadEmbedEmbed<iframe src=\"https://www.npr.org/player/embed/nx-s1-5492483/nx-s1-9397225\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">"
  },
  {
    "title": "Brazil's top court orders house arrest for Bolsonaro",
    "description": "Brazil's Supreme Court ordered house arrest for former President Jair Bolsonaro, who is standing trial for allegedly plotting a coup.",
    "link": "https://www.dw.com/en/brazil-s-top-court-orders-house-arrest-for-bolsonaro/a-73528626?maca=en-rss-en-all-1573-rdf",
    "published": "",
    "source": "https://rss.dw.com/rdf/rss-en-all",
    "content_type": "rss",
    "full_content": "CrimeBrazilBrazil's top court orders house arrest for BolsonaroKate Hairsinewith Reuters, AP08/05/2025August 5, 2025Brazil's Supreme Court ordered house arrest for former President Jair Bolsonaro, who is standing trial for allegedly plotting a coup.https://p.dw.com/p/4yW9aFormer President Jair Bolsonaro has already been fitted with an ankle monitorImage: Eraldo Peres/AP Photo/picture allianceAdvertisementBrazil's Supreme Court on Monday ordered the house arrest ofJair Bolsonaro.The former president is standing trial for allegedly leading a coup attempt after losing the 2022 electiontoLuiz Inacio Lula da Silva.Why has the court ordered house arrest?Justice Alexandre de Moraes, who is overseeing the case against Bolsonaro in court, issued the order.He said in his decision that Bolsonaro had violated the precautionary measures imposed on him in July thatbarred the far right leader from using social media.As well as ordering house arrest, Moraes also bannedthe 70-year-oldfrom receiving visits, with exceptions for lawyers and people authorized by the court.He also ordered the seizure of mobile phones from Bolsonaro's home in Rio de Janeiro.Brazil: Mass rally backs amnesty for far-right BolsonaroTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 videoMore to come....Edited by:Srinivas MazumdaruKate HairsineReporter and senior editorSend us your feedbackYour feedback"
  },
  {
    "title": "India brushes off Trump tariff threat over Russian oil",
    "description": "India has pushed back against US President Donald Trump's threat to impose higher tariffs on Indian goods. New Delhi condemned Western criticism of its buying oil from Moscow, vowing to protect its national interests.",
    "link": "https://www.dw.com/en/india-brushes-off-trump-tariff-threat-over-russian-oil/a-73528185?maca=en-rss-en-all-1573-rdf",
    "published": "",
    "source": "https://rss.dw.com/rdf/rss-en-all",
    "content_type": "rss",
    "full_content": "PoliticsIndiaIndia brushes off Trump tariff threat over Russian oilRichard Connorwith AFP, Reuters08/04/2025August 4, 2025India has pushed back against US President Donald Trump's threat to impose higher tariffs on Indian goods. New Delhi condemned Western criticism of its buying oil from Moscow, vowing to protect its national interests.https://p.dw.com/p/4yW2TThe country has historically bought most of its crude from the Middle East, but this has changedImage: BIJU BORO/AFPAdvertisementIndia on Monday denounced as unfair the mounting pressure from the United States and European Union over itscontinued purchases of Russian oil.Foreign Ministry spokesman Randhir Jaiswal said the country would safeguard its economic interests amid threats of steep tariffs from President Donald Trump.What did New Delhi say about trade with Russia?\"The targeting of India is unjustified and unreasonable,\" said Jaiswal, asserting the country's sovereign right to secure energy supplies in line with its needs.\"Like any major economy, India will take all necessary measures to safeguard its national interests and economic security,\" he added.Jaiswal also argued thatIndia's importsbegan only after Western countries diverted traditional supplies to Europe following the outbreak of the Ukraine war. He also accused both the EU and the US of hypocrisy.\"It is revealing that the very nations criticizing India are themselves indulging in trade with Russia,\"  Jaiswal said.\"Unlike our case, such trade is not even a vital national compulsion.\"Why sanctions won't stop RussiaTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 videoJaiswal pointed to ongoing Europe-Russia trade involvingfertilizers, chemicals, iron and steel, machinery, and transport equipment.He also noted that the US continues to import Russian uranium hexafluoride for its nuclear industry, palladium for electric vehicles, and other industrial goods.What did Trump say about India and tariffs?US President Donald Trump has threatened to sharply increase tariffs on Indian goods, accusing New Delhi of profiting from discounted Russian oil while failing to support efforts to end the war in Ukraine.While Trump did not specify the exact rate, an existing 10% tariff on Indian products isexpected to rise to 25% starting Thursday.The move, he said, was in response to India \"buying massive amounts of Russian oil\" and reselling it for profit, which he claimed fuels Moscow’s war on Ukraine. \"They don't care how many people in Ukraine are being killed by the Russian War Machine,\" Trump wrote on Truth Social.The move adds strain to a key trade relationship. The US is India’s largest trading partner, with Indian exports to the US totaling $87.4 billion in 2024. India recorded a nearly $46 billion trade surplus with the US the same year.Azerbaijan edges away from Russia's orbit as rifts emergeTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 videoEdited by: Wesley RahnRichard ConnorReporting on stories from around the world, with a particular focus on Europe — especially Germany.Send us your feedbackYour feedbackAdvertisement"
  },
  {
    "title": "Middle East: Hostage families criticize reported Israeli war plans",
    "description": "After ceasefire talks between Israel and Hamas collapsed, PM Netanyahu is reportedly considering \"decisive\" military action in the enclave. Hostage families warn this could endanger their loved ones. DW has more.",
    "link": "https://www.dw.com/en/middle-east-hostage-families-criticize-reported-israeli-war-plans/live-73516951?maca=en-rss-en-all-1573-rdf",
    "published": "",
    "source": "https://rss.dw.com/rdf/rss-en-all",
    "content_type": "rss",
    "full_content": "ConflictsMiddle EastMiddle East: Hostage families criticize Israeli war plansFelix TamsutAP, AFP, dpa, ReutersPublished 08/04/2025Published August 4, 2025last updated 08/04/2025last updated August 4, 2025After ceasefire talks between Israel and Hamas collapsed, PM Netanyahu is reportedly considering \"decisive\" military action in the enclave. Hostage families warn this could endanger their loved ones. DW has more.https://p.dw.com/p/4yT7HFamilies of hostages held in Gaza ave been holding regular protests in Tel AvivImage: Jack Guez/AFPAdvertisementSkip next section What you need to knowWhat you need to knowPrime Minister Benjamin Netanyahu is advocating for the release of hostages through a \"decisive military victory,\" Israeli media reported.It is a strategy that could see Israeli forces operating in areas believed to be controlled by Hamas, where hostages are suspected to be held.In response, the Hostages and Missing Families Forum, which represents the vast majority of hostage families, condemned the approach, stating that Netanyahu is \"leading Israel and the hostages toward devastation.\"This blog is now closed. Here is more coverage ofdevelopments in the Middle East.Skip next section Petition calls for foreign press access to Gaza08/04/2025August 4, 2025Petition calls for foreign press access to GazaMore than 200 international journalists are calling on Israel to allow  \"immediate and unsupervised foreign press access to the Gaza Strip.\"Launched by the Freedom to Report initiative, the petition criticizes Israeli-imposed restrictions on foreign reporting from the territory that \"silence independent observation.\"It has been signed by many prominent journalists including Christiane Amanpour, Anderson Cooper, Clarissa Ward, and Mehdi Hassan.\"When governments can unilaterally shut down access to war zones ... They undermine the very foundation of democracy: press freedom as a check on power,\" the petition reads.Some journalists have been allowed to enter Gaza with the Israeli military, butmost reporting from the enclave is being done by Palestinian journalistsliving there.Last month, the Associated Press, AFP, BBC News and Reuters published a joint statement that their journalists in Gaza were facing \"dire circumstances\" and were \"increasingly unable to feed themselves and their families.\"Since the war began after the Oct. 7, 2023, Hamas terror attack on Israel, 186 journalists have been killed in Gaza and 90 have been imprisoned, according to the Committee to Protect Journalists.On Friday, dozens of members of the International News Safety Institute, a nonprofit group, issued a statement calling on Israel to allow journalists in Gaza who are facing starvation to leave the enclave, and for international reporters to be allowed entry.https://p.dw.com/p/4yW6kSkip next section Israeli cabinet to decide next steps in Gaza war08/04/2025August 4, 2025Israeli cabinet to decide next steps in Gaza warIsraeli Prime MinisterBenjamin Netanyahuwill convene a cabinet meeting later this week on how to proceed withthe war in Gaza.Netanyahu said the cabinet will meet to \"instruct the (army) on how to achieve the three war objectives we have set,\" with the three objectives being the defeat of Hamas, the release of the hostages held in the enclave and \"the promise that Gaza will no longer pose a threat to Israel.\"Yesterday, hostage family members criticized Netanyahu for his intention to further expand the war inGaza, potentially putting hostages at risk, saying the Israeli leader would lead Israel and the hostages \"into destruction.\"https://p.dw.com/p/4yV7kSkip next section WATCH: Netanyahu appeals to Red Cross to visit and aid hostages in Gaza08/04/2025August 4, 2025WATCH: Netanyahu appeals to Red Cross to visit and aid hostages in GazaGerhard ElfersIf Hamas grants access, Red Cross doctors could enter the area where Israeli hostages are held to provide medical care.The development follows the release of harrowing videos showing emaciated captives.However, Hamas says medical access depends on the opening of humanitarian corridors across the entire Gaza Strip.DW speaks with Sarah Davies from the ICRC about the proposed operation.Netanyahu appeals to Red Cross to aid hostages in GazaTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 videohttps://p.dw.com/p/4yV8HSkip next section Israel calls for more global attention toward plight of hostages08/04/2025August 4, 2025Israel calls for more global attention toward plight of hostagesIsraeli Foreign Minister Gideon Saar on Monday said thehostages held in Gazashould be top of the global agenda.Saar was speaking to the press ahead of a trip to New York to take part in a special UN Security Council session about the hostages' situation.\"The world must put an end to the phenomenon of kidnapping civilians,\" he said.\"It must be front and center on the world stage,\" he added.Fifty Israeli hostages are still held by Palestinian militant gro"
  },
  {
    "title": "Elon Musk says he’s bringing back Vine — sort of.",
    "description": "Elon Musk says he’s bringing back Vine — sort of. The X ownerannouncedover the weekend that the company discovered the video archive for the popular short-form video app, thought to have been deleted, and is working to restore user access.Vine — something of a precursor to today’s TikTok, but with o...",
    "link": "https://techcrunch.com/2025/08/04/elon-musk-says-hes-bringing-back-vines-archive/",
    "published": "2025-08-04T18:05:14.725587",
    "source": "https://techcrunch.com",
    "content_type": "web",
    "full_content": "Elon Musk says he’s bringing back Vine — sort of. The X ownerannouncedover the weekend that the company discovered the video archive for the popular short-form video app, thought to have been deleted, and is working to restore user access.Vine — something of a precursor to today’s TikTok, but with only six-second-long looping videos — wasacquired by Twitter back in October 2012for $30 million to expand the social media platform’s video ambitions. Unfortunately for Vine creators and fans, the company fumbled the app’s potential and decided toshut down Vine in 2016by limiting all new uploads. The following year, it was fully discontinued, though auser archiveremained for a time.Despite no longer having an App Store presence, Vine still has a place in the internet’s collective cultural consciousness. Through online compilations of the best Vines uploaded to YouTube, and through the careers of numerous creators who got their start on Vine, the company lives on to some extent, and its content continues to be discovered by new generations.Musk himself seemed interested in bringing back Vine afteracquiring Twitter in October 2022. Ina poll postedon the social media app, he asked Twitter’s users, “Bring back Vine?” to which nearly 70% responded “yes.”Axios reported at the timethat Twitter had devoted some engineers to working on the Vine reboot, but nothing ever came of it.Grok Imagine is AI Vine!Btw, we recently found the Vine video archive (thought it had been deleted) and are working on restoring user access, so you can post them if you want.— Elon Musk (@elonmusk)August 2, 2025It’s unclear whether Musk has any ambitions for Vine beyond getting its archive back online, however. In the same post about restoring Vine, he also touted that Grok’s new video-creation feature, Grok Imagine, also available to X Premium+ subscribers, is “AI Vine.” That suggests that his interests in video creation no longer lie with human creativity, but in human-directed AI prompting.Whether or not Musk will actually deliver on the promise remains to be seen, as the X post could have just been another way to draw attention to Grok AI, rather than being representative of a real effort inside the company to make old Vines available for reposting.Techcrunch eventTech and VC heavyweights join the Disrupt 2025 agendaNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.Tech and VC heavyweights join the Disrupt 2025 agendaNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.San Francisco|October 27-29, 2025REGISTER NOW"
  },
  {
    "title": "Amazon is denying that it’s shutting down Wondery, the podcast studio itacquired in late 2020, after",
    "description": "Amazon is denying that it’s shutting down Wondery, the podcast studio itacquired in late 2020, afterBloomberg reportedon Monday that the company was closing the studio and cutting 110 jobs.Amazon told TechCrunch that Wondery will continue to develop creator-led podcasts under the Wondery brand withi...",
    "link": "https://techcrunch.com/2025/08/04/amazon-denies-report-its-shutting-down-wondery-podcast-studio/",
    "published": "2025-08-04T18:05:15.632849",
    "source": "https://techcrunch.com",
    "content_type": "web",
    "full_content": "Amazon is denying that it’s shutting down Wondery, the podcast studio itacquired in late 2020, afterBloomberg reportedon Monday that the company was closing the studio and cutting 110 jobs.Amazon told TechCrunch that Wondery will continue to develop creator-led podcasts under the Wondery brand within a new team. What’s changing is that the company is separating the teams that oversee Wondery’s narrative podcast efforts from those developing its creator-led shows.Wondery is combining its narrative podcast studio, which includes podcasts like Dr. Death and American Scandal, with Audible.“The podcast landscape has evolved significantly in the past few years, particularly with the rise of video-forward, creator-led content,” Amazon said in an emailed statement.“These changes reflect that evolution and will streamline how Wondery integrates further into Amazon. By making these changes, we can better support creators in monetizing their content across multiple channels, help them expand their brand IP, and simplify the process for advertisers while making content more accessible to audiences wherever they prefer to consume it. This evolution builds on Wondery’s early success with video-forward shows and positions us to better serve creators, customers, and advertisers.”Despite securing big names in the business, the company is now shifting its strategy in an effort to better compete with rivals like Spotify and YouTube as the podcasting industry embraces video formats.Update: The article was updated to reflect that Amazon denied reports of Wondery shutting down.Techcrunch eventTech and VC heavyweights join the Disrupt 2025 agendaNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.Tech and VC heavyweights join the Disrupt 2025 agendaNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.San Francisco|October 27-29, 2025REGISTER NOW"
  }
]