[
  {
    "title": "Trump pleads not guilty to 34 felony counts",
    "description": "",
    "link": "https://edition.cnn.com/webview/politics/live-news/trump-indictment-stormy-daniels-news-04-03-23/index.html",
    "published": "",
    "source": "http://rss.cnn.com/rss/edition.rss",
    "content_type": "rss",
    "full_content": "What we covered hereFormer PresidentDonald Trumparrived in New York City Monday, a day before he is expected to turn himself in to law enforcement andface more than 30 criminal chargesin a Manhattan court following last week’s historic grand jury indictment.News outlets will not be allowedto broadcast the Tuesday arraignment, a judge ruled Monday night.Trump’s legal team said the former president will voluntarily surrender and will look tochallenge “every potential issue”once the indictment is unsealed.Trump, who has vowed to continue his 2024 bid, is the first current or former president in US history who has faced criminal charges. The district attorney’s officehas been investigatingTrump’s alleged role in a hush money payment scheme involving adult film star Stormy Daniels that dates to the 2016 presidential election. AllCatch Up34 PostsOur live coverage ofTrump’s historic indictment has moved.Link Copied!Trump arraignment has \"unparalleled public interest,\" but it won't be broadcast, judge saysFrom CNN's Tierney SneedActing New York Supreme Court Judge Juan Merchan wrote his Monday night order that the media’s request to broadcast the arraignment of former President Donald Trump was understandable, but that the news organizations’ interests in providing the broadest possible access to the proceedings must be weighed against “competing interests.”In rejecting the request to broadcast the arraignment live on television, Merchan still wrote about the historical significance of the proceeding in stark terms.“That this indictment involves a matter of monumental significance cannot possibly be disputed. Never in the history of the United States has a sitting or past President been indicted on criminal charges. Mr. Trump’s arraignment has generated unparalleled public interest and media attention,” he wrote. “The populace rightly hungers for the most accurate and current information available. To suggest otherwise would be disingenuous.”Link Copied!Judge will only briefly allow photos in the courtroom before Trump arraignment beginsFrom CNN's Tierney SneedNews outlets will not be allowed to broadcast formerPresident Donald Trump’s arraignmenton Tuesday in a New York state court, a judge said Monday night, but he will allow some photographers to take pictures in the courtroom before the proceedings formally begin.Acting New York Supreme Court Judge Juan Merchanrejected the requestby several media organizations, including CNN, for permission to broadcast the historic proceedings. Trump’s arraignment — like most arraignments in the Manhattan courthouse — is a public proceeding, but news cameras are not usually allowed to broadcast from inside the courtroom.However, the judge is allowing five pool photographers to take still photos at the beginning of the proceedings “until such time as they are directed to vacate the jury box by court personnel.”Earlier on Monday, Trump’s lawyers urged the judge to reject the media’s request for live cameras in the courtroom. The Manhattan District Attorney’s office told the judge they didn’t have a position.The media outlets that tried to get cameras into the courtroom argued that “the gravity of this proceeding … and, consequently, the need for the broadest possible public access, cannot be overstated.”Trump is now in Manhattan ahead of the arraignment.A grand jury indicted the former presidentlast week.The arraignment is also expected to bring the unsealing of the criminal charges against Trump, which have not yet been seen by his lawyers or the public.The indictment stems from Manhattan District Attorney Alvin Bragg’sinvestigationinto hush-money payments, made during the 2016 presidential campaign, to women who claimed they had extramarital affairs with Trump, which he denies.Trump denies all wrongdoing and his lawyers said last week that they’ll fight toget the charges dropped.Link Copied!Tuesday is the first test for Trump to navigate a legal and political strategyFrom CNN's Jeff ZelenyDonald Trump is not planning to speak publicly in New York on Tuesday, aides say, if he follows advice from members of his legal team who have urged the former President to refrain from the vitriol he’s been directing toward theprosecutorandjudgepresiding over the case.But that restraint does not extend to Florida, aides said, where he is planning to deliver a full-throated defense of his New York case as well asother investigations he is facingduring a prime time address from Mar-a-Lago on Tuesday night.It’s the first test to see whether Trump can navigate two vasty different approaches to hislegal caseand hispolitical campaign, which are now inextricably linked.“He’s taking this very seriously and following legal advice,” an adviser to Trump said Monday night. “He will make his case to Americans Tuesday night at Mar-a-Lago.”Link Copied!Trump is \"ready to go in and do what he needs to do tomorrow,\" attorney saysFrom CNN's Mary Kay MalloneeAlina Habba, lawyer for former President Donald Trump"
  },
  {
    "title": "Haberman reveals why Trump attacked judge and his family in speech",
    "description": "CNN political contributor Maggie Haberman explains the reasoning behind Donald Trump's attacks on the judge and his family during a speech at his Mar-a-Lago resort after he was arraigned on felony charges.",
    "link": "https://www.cnn.com/videos/politics/2023/04/05/maggie-haberman-donald-trump-speech-indictment-reaction-sot-cnntm-vpx.cnn",
    "published": "Wed, 05 Apr 2023 13:30:09 GMT",
    "source": "http://rss.cnn.com/rss/edition.rss",
    "content_type": "rss",
    "full_content": "Haberman reveals why Trump attacked judge and his family in speech | CNN PoliticsCNN values your feedback1. How relevant is this ad to you?2. Did you encounter any technical issues?Video player was slow to load contentVideo content never loadedAd froze or did not finish loadingVideo content did not start after adAudio on ad was too loudOther issuesAd never loadedAd prevented/slowed the page from loadingContent moved around while ad loadedAd was repetitive to ads I've seen previouslyOther issuesCancelSubmitThank You!Your effort and contribution in providing this feedback is much\n                                        appreciated.CloseClose iconPoliticsTrumpFacts FirstCNN Polls2025 ElectionsMoreTrumpFacts FirstCNN Polls2025 ElectionsWatchListenLive TVSubscribeSign inMy AccountSettingsNewslettersTopics you followSign outYour CNN accountSign in to your CNN accountSign inMy AccountSettingsNewslettersTopics you followSign outYour CNN accountSign in to your CNN accountLive TVListenWatchEditionUSInternationalArabicEspañolEditionUSInternationalArabicEspañolTrumpFacts FirstCNN Polls2025 ElectionsFollow CNN PoliticsWorldAfricaAmericasAsiaAustraliaChinaEuropeIndiaMiddle EastUnited KingdomUS PoliticsTrumpFacts FirstCNN Polls2025 ElectionsBusinessTechMediaCalculatorsVideosMarketsPre-marketsAfter-HoursFear & GreedInvestingMarkets NowNightcapHealthLife, But BetterFitnessFoodSleepMindfulnessRelationshipsEntertainmentMoviesTelevisionCelebrityTechInnovateForeseeable FutureMission: AheadWork TransformedInnovative CitiesStyleArtsDesignFashionArchitectureLuxuryBeautyVideoTravelDestinationsFood & DrinkStayNewsVideosSportsFootballTennisGolfMotorsportUS SportsOlympicsClimbingEsportsHockeyScienceSpaceLifeUnearthedClimateSolutionsWeatherWeatherVideoClimateUkraine-Russia WarIsrael-Hamas WarFeaturesAs EqualsCall to EarthFreedom ProjectImpact Your WorldInside AfricaCNN HeroesWatchLive TVCNN FastShows A-ZCNN10CNN MaxCNN TV SchedulesListenCNN 5 ThingsChasing Life with Dr. Sanjay GuptaThe Assignment with Audie CornishOne ThingTug of WarCNN Political BriefingThe Axe FilesAll There Is with Anderson CooperAll CNN Audio podcastsGamesDaily CrosswordJumble CrosswordPhoto ShuffleSudoblockSudoku5 Things QuizAbout CNNPhotosInvestigationsCNN ProfilesCNN LeadershipCNN NewslettersWork for CNNHaberman reveals why Trump attacked judge and his family in speechUpdated\n          9:30 AM EDT, Wed April 5, 2023Video Ad FeedbackHaberman reveals why Trump attacked judge and his family in speechLink Copied!CNN political contributor Maggie Haberman explains the reasoning behind Donald Trump's attacks on the judge and his family during a speech at his Mar-a-Lago resort after he was arraigned on felony charges.02:11- Source:CNNLatest Videos16 videosVideo Ad FeedbackHaberman reveals why Trump attacked judge and his family in speech02:11Now playing- Source:CNNVideo Ad Feedback'I thought, do or die': How a Ukrainian soldier cycled to safety after Russian assault01:55Now playing- Source:CNNVideo Ad Feedback'A human skeleton, buried alive': Brother of emaciated Israeli hostage speaks to CNN03:09Now playing- Source:CNNVideo Ad FeedbackSean ‘Diddy’ Combs’ ex asks judge to release him on bail03:09Now playing- Source:CNNVideo Ad Feedback'Racist, gerrymandered map': Texas Democrat blasts GOP-drawn congressional map03:34Now playing- Source:CNNVideo Ad Feedback'An extraordinary move': CNN reporter explains why Texas Democrats left the state01:11Now playing- Source:CNNVideo Ad FeedbackSen. Booker was asked about Democrats’ credibility. Hear his response01:37Now playing- Source:CNNVideo Ad FeedbackWhy back-to-school shopping is starting early this year02:04Now playing- Source:CNNVideo Ad FeedbackThis is how a fire cloud formed in the Grand Canyon 'megafire'01:02Now playing- Source:CNNVideo Ad Feedback'Very risky business': John Bolton reacts to Trump's nuclear subs order03:18Now playing- Source:CNNVideo Ad FeedbackSydney Sweeney's American Eagle ad campaign sparks controversy02:27Now playing- Source:CNNVideo Ad FeedbackPaul Whelan describes challenges of returning home after being imprisoned abroad04:21Now playing- Source:CNNVideo Ad FeedbackWhat Ghislaine Maxwell’s move to a lower-security federal prison camp could signal01:55Now playing- Source:CNNVideo Ad FeedbackHawaii breathes a massive sigh of relief after tsunami scare shakes island02:59Now playing- Source:CNNVideo Ad FeedbackVideo shows police arrest man accused of killing couple on a hike with kids01:11Now playing- Source:CNNVideo Ad FeedbackPassenger describes 'significant turbulence' that forced Delta flight to make emergency landing01:17Now playing- Source:CNNSee More VideosAd FeedbackSubscribeSign inMy AccountSettingsNewslettersTopics you followSign outYour CNN accountSign in to your CNN accountLive TVListenWatchWorldAfricaAmericasAsiaAustraliaChinaEuropeIndiaMiddle EastUnited KingdomUS PoliticsTrumpFacts FirstCNN Polls2025 ElectionsBusinessTechMediaCalculatorsVideosMarketsPre-marketsAfter-HoursFear & GreedInvesti"
  },
  {
    "title": "What to know about the Trump indictment on the eve of his court appearance",
    "description": "",
    "link": "https://www.cnn.com/collections/intl-trump-040223/",
    "published": "Wed, 05 Apr 2023 22:50:06 GMT",
    "source": "http://rss.cnn.com/rss/edition.rss",
    "content_type": "rss",
    "full_content": ""
  },
  {
    "title": "READ: Trump indictment related to hush money payment",
    "description": "",
    "link": "https://cnn.it/411KYN7",
    "published": "",
    "source": "http://rss.cnn.com/rss/edition.rss",
    "content_type": "rss",
    "full_content": "Video Ad FeedbackCNN reporter describes Trump's mood inside courtroom01:06- Source:CNNPolitics of the Day16 videosVideo Ad FeedbackCNN reporter describes Trump's mood inside courtroom01:06Now playing- Source:CNNVideo Ad Feedback'An extraordinary move': CNN reporter explains why Texas Democrats left the state01:11Now playing- Source:CNNVideo Ad FeedbackSen. Booker was asked about Democrats’ credibility. Hear his response01:37Now playing- Source:CNNVideo Ad FeedbackWhy back-to-school shopping is starting early this year02:04Now playing- Source:CNNVideo Ad Feedback'Very risky business': John Bolton reacts to Trump's nuclear subs order03:18Now playing- Source:CNNVideo Ad FeedbackAnalysis: Why former VP Harris won't run for California governor in 202603:31Now playing- Source:CNNVideo Ad FeedbackCuomo says mayoral opponent Mamdani doesn’t understand ‘importance of NYPD’04:26Now playing- Source:CNNVideo Ad FeedbackGOP House leader calls situation in Gaza a 'humanitarian crisis'03:09Now playing- Source:CNNVideo Ad FeedbackMAGA media rallies around Trump as he downplays Epstein connection03:51Now playing- Source:CNNVideo Ad FeedbackNew York City mayoral race: Andrew Cuomo says young voters have 'real issues' worth hearing02:38Now playing- Source:CNNVideo Ad FeedbackAnalysis: What Trump hopes to signal with EU trade deal01:25Now playing- Source:CNNVideo Ad FeedbackWatch Trump announce framework for a trade deal with EU01:57Now playing- Source:CNNVideo Ad Feedback\"It's a type of torture:\" Hear what it's like inside Alligator Alcatraz04:54Now playing- Source:CNNVideo Ad FeedbackPresident Trump responds to report about Epstein birthday letter bearing his name00:43Now playing- Source:CNNVideo Ad FeedbackActing Columbia president speaks out after $220 million settlement with Trump admin.08:18Now playing- Source:CNNVideo Ad FeedbackHear why Murkowski questions whether Gabbard releasing report on Obama is an effort to distract from Epstein fallout01:16Now playing- Source:CNNSee More VideosCNN—Former President Donald Trump has been charged with 34 felony counts in anindictment unsealed Tuesday.Read theindictmentandstatement of factshere."
  },
  {
    "title": "Russian authorities detain suspect over St. Petersburg cafe blast",
    "description": "",
    "link": "https://edition.cnn.com/webview/europe/live-news/russia-ukraine-war-news-04-03-23/index.html",
    "published": "",
    "source": "http://rss.cnn.com/rss/edition.rss",
    "content_type": "rss",
    "full_content": "What we covered hereA female suspecthas been detainedin connection with an explosion that killed aprominent Russian military bloggerat a cafe in St. Petersburg on Sunday.Finland willofficially become a memberof the NATO military alliance at a ceremony in Brussels Tuesday. Finland submitted a joint application for membership alongside Sweden shortly after Russia’s invasion of Ukraine.Poland has delivered“several” MiG-29 fighter aircraftto Ukraine. Ukrainian President Volodymyr Zelensky is expected to visit Poland on Wednesday.The Wall Street Journal reporterdetained in Moscowon “espionage” charges hasfiled an appealagainst his arrest, according to Russian state news. The UShas calledfor the journalist’s “immediate release.”On the ground, eastern Ukraine continues to face relentless Russian assaults, with shellingkilling at least six peoplein the city of Kostiantynivka. AllCatch UpRussian BloggerRussian blogger50 PostsOur live coverage for the day has ended. Follow the latest Ukraine newshereor read through the updates below.Link Copied!Hearing for cafe explosion suspect will take place Tuesday, Russian state media saysFrom CNN's Tim ListerThe preventive detention hearing forDaria Trepova, who was detained in connection withthe explosionat a cafe in St. Petersburg, Russia, will take place on Tuesday at Basmanny District Court in Moscow, according to Russian state news agency Vesti.Russian authorities detained Trepova, 26, claiming she was involved in the blast that killed well-known military blogger Vladlen Tatarsky at a café in St. Petersburg on Sunday.Link Copied!US ambassador to UN describes Russia running the UNSC as an \"April Fool's joke\"From CNN's Richard Roth in New YorkLinda Thomas-Greenfield at the Rayburn House Office Building in Washington, DC on March 1.(Kevin Dietsch/Getty Images)The US Ambassador to the United Nations Linda Thomas-Greenfield on Monday describedRussia assuming the United Nations Security Council (UNSC) presidencythis month as “an April Fool’s joke.”“But the truth of the matter is, it’s a rotating seat. We expect that they will behave professionally. But we also expect that they will use their seat to spread disinformation and to promote their own agenda as it relates to Ukraine, and we will stand ready to call them out at every single moment that they attempt to do that,” Greenfield added.Greenfield said she is not surprised if the Russians asked the foreign minister to come to UNSC headquarters in New York but also said council does work beyond Ukraine.“We haven’t decided yet on what our attendance levels will be, but we intend to carry out the business of the Security Council during this month. The Security Council does more than Ukraine. We work on many issues, and we again expect that Russia will carry their presidency in a professional way, but when they don’t, we will stand ready to call them out,” Greenfield said.Link Copied!Finland to be inducted into NATO and Russia pushes back on UN Security presidency concerns. Here's the latestFrom CNN staffVasily Nebenzya, Russian ambassador to the United Nations, dismissed concerns that Russia could fairly be the president of the Security Council for April during the ongoing war in Ukraine.He said there were no complaints in February 2022 when Russia was last president of the council, while Russia invaded and pointed out that the US was president of the council in 2003 — the year Iraq was invaded.The ambassador said as long as world order is maintained, there will not be any change in UN procedures that might lead to a change in Russia’s status.Russia took over presidency on Saturday of the UN’s top security body, which rotates every month.Here are the latest headlines:Newly published video shows moment of explosion that killed Russian journalist:The videoshows the moments running up toan explosionthat killed Russian military journalist Vladen Tartovsky in a St Petersburg café on Sunday. The 25-second video shows Tartovsky putting a statuette given to him at the event into a box after passing the microphone to another man. He places the statuette back into the box and then covers it with what appears to be paper wrapping. As he presses down the paper, there is an explosion.More than 500 children have been killed in Ukraine since the war began, UNICEF says:At least501 children have been killedin Ukraine since February 2022, when Russia launched its full-scale invasion, said Catherine Russell, executive director of the United Nations Children’s Fund (UNICEF). “Another tragic milestone for Ukraine’s children and families,” Russelltweetedon Monday. Russell warned the real figure is “likely far higher” than the numbers verified by the UN agency.Finland’s official accession to NATO is historic, alliance chief says:NATOSecretary General Jens Stoltenberg said it will be historic when the military allianceraises the Finnish flagfor the first time at its headquarters on Tuesday after it was announced that Finland was joining the alliance. “Th"
  },
  {
    "title": "Video shows moment of deadly explosion at cafe in Russia",
    "description": "A well-known Russian military blogger, Vladlen Tatarsky, was killed in an explosion at a cafe in St. Petersburg, authorities said. CNN's Matthew Chance reports.",
    "link": "https://www.cnn.com/videos/world/2023/04/02/russian-military-blogger-vladlen-tatarsky-killed-cafe-explosion-chance-vpx.cnn",
    "published": "Tue, 04 Apr 2023 01:08:44 GMT",
    "source": "http://rss.cnn.com/rss/edition.rss",
    "content_type": "rss",
    "full_content": "Video shows moment of deadly explosion at cafe in Russia | CNNCNN values your feedback1. How relevant is this ad to you?2. Did you encounter any technical issues?Video player was slow to load contentVideo content never loadedAd froze or did not finish loadingVideo content did not start after adAudio on ad was too loudOther issuesAd never loadedAd prevented/slowed the page from loadingContent moved around while ad loadedAd was repetitive to ads I've seen previouslyOther issuesCancelSubmitThank You!Your effort and contribution in providing this feedback is much\n                                        appreciated.CloseClose iconWorldAfricaAmericasAsiaAustraliaChinaEuropeIndiaMiddle EastUnited KingdomMoreAfricaAmericasAsiaAustraliaChinaEuropeIndiaMiddle EastUnited KingdomWatchListenLive TVSubscribeSign inMy AccountSettingsNewslettersTopics you followSign outYour CNN accountSign in to your CNN accountSign inMy AccountSettingsNewslettersTopics you followSign outYour CNN accountSign in to your CNN accountLive TVListenWatchEditionUSInternationalArabicEspañolEditionUSInternationalArabicEspañolAfricaAmericasAsiaAustraliaChinaEuropeIndiaMiddle EastUnited KingdomFollow CNNWorldAfricaAmericasAsiaAustraliaChinaEuropeIndiaMiddle EastUnited KingdomUS PoliticsTrumpFacts FirstCNN Polls2025 ElectionsBusinessTechMediaCalculatorsVideosMarketsPre-marketsAfter-HoursFear & GreedInvestingMarkets NowNightcapHealthLife, But BetterFitnessFoodSleepMindfulnessRelationshipsEntertainmentMoviesTelevisionCelebrityTechInnovateForeseeable FutureMission: AheadWork TransformedInnovative CitiesStyleArtsDesignFashionArchitectureLuxuryBeautyVideoTravelDestinationsFood & DrinkStayNewsVideosSportsFootballTennisGolfMotorsportUS SportsOlympicsClimbingEsportsHockeyScienceSpaceLifeUnearthedClimateSolutionsWeatherWeatherVideoClimateUkraine-Russia WarIsrael-Hamas WarFeaturesAs EqualsCall to EarthFreedom ProjectImpact Your WorldInside AfricaCNN HeroesWatchLive TVCNN FastShows A-ZCNN10CNN MaxCNN TV SchedulesListenCNN 5 ThingsChasing Life with Dr. Sanjay GuptaThe Assignment with Audie CornishOne ThingTug of WarCNN Political BriefingThe Axe FilesAll There Is with Anderson CooperAll CNN Audio podcastsGamesDaily CrosswordJumble CrosswordPhoto ShuffleSudoblockSudoku5 Things QuizAbout CNNPhotosInvestigationsCNN ProfilesCNN LeadershipCNN NewslettersWork for CNNVideo shows moment of deadly explosion at cafe in RussiaUpdated\n          9:08 PM EDT, Mon April 3, 2023Video Ad FeedbackVideo shows moment of deadly explosion at cafe in RussiaSituation RoomLink Copied!A well-known Russian military blogger, Vladlen Tatarsky,was killed in an explosion at a cafein St. Petersburg, authorities said. CNN's Matthew Chance reports.03:05- Source:CNNCNN in Russia11 videosVideo Ad FeedbackVideo shows moment of deadly explosion at cafe in Russia03:05Now playing- Source:CNNVideo Ad FeedbackHear what Russians are telling Frederik Pleitgen about Trump and Zelensky02:53Now playing- Source:CNNVideo Ad FeedbackSee Russia state TV’s coverage of Trump’s call with Putin03:32Now playing- Source:CNNVideo Ad FeedbackHow Assad's fall may affect Russian influence in Syria03:00Now playing- Source:CNNVideo Ad FeedbackNavalny's body arrived at church to clapping and chanting from mourners00:33Now playing- Source:CNNVideo Ad FeedbackSee massive crowd in Russia honoring Navalny00:47Now playing- Source:CNNVideo Ad FeedbackNavalny's mother claims Russian agents are 'blackmailing' her01:19Now playing- Source:CNNVideo Ad FeedbackSee the moment Kim Jong Un arrived in Russia02:32Now playing- Source:CNNVideo Ad FeedbackHear why someone left a sledgehammer at a Prigozhin memorial03:05Now playing- Source:CNNVideo Ad FeedbackCNN goes to Red Square to gauge Russians' opinion on Putin after the rebellion02:48Now playing- Source:CNNVideo Ad FeedbackRussian priest says he's helped 'thousands' of Ukrainian refugees get to Europe04:51Now playing- Source:CNNSee More VideosAd FeedbackSubscribeSign inMy AccountSettingsNewslettersTopics you followSign outYour CNN accountSign in to your CNN accountLive TVListenWatchWorldAfricaAmericasAsiaAustraliaChinaEuropeIndiaMiddle EastUnited KingdomUS PoliticsTrumpFacts FirstCNN Polls2025 ElectionsBusinessTechMediaCalculatorsVideosMarketsPre-marketsAfter-HoursFear & GreedInvestingMarkets NowNightcapHealthLife, But BetterFitnessFoodSleepMindfulnessRelationshipsEntertainmentMoviesTelevisionCelebrityTechInnovateForeseeable FutureMission: AheadWork TransformedInnovative CitiesStyleArtsDesignFashionArchitectureLuxuryBeautyVideoTravelDestinationsFood & DrinkStayNewsVideosSportsFootballTennisGolfMotorsportUS SportsOlympicsClimbingEsportsHockeyScienceSpaceLifeUnearthedClimateSolutionsWeatherWeatherVideoClimateUkraine-Russia WarIsrael-Hamas WarFeaturesAs EqualsCall to EarthFreedom ProjectImpact Your WorldInside AfricaCNN HeroesWatchLive TVCNN FastShows A-ZCNN10CNN MaxCNN TV SchedulesListenCNN 5 ThingsChasing Life with Dr. Sanjay GuptaThe Assignment with Audie CornishOne ThingTug of WarCNN Polit"
  },
  {
    "title": "Wall Street Journal reporter Evan Gershkovich appeals against arrest, Russian state media says",
    "description": "",
    "link": "https://www.cnn.com/collections/intl-ukraine-030423/",
    "published": "Mon, 03 Apr 2023 13:58:58 GMT",
    "source": "http://rss.cnn.com/rss/edition.rss",
    "content_type": "rss",
    "full_content": ""
  },
  {
    "title": "Suspected Chinese spy balloon was able to transmit information back to Beijing",
    "description": "The suspected Chinese spy balloon that transited the US earlier this year was able to capture imagery and collect some signals intelligence from US military sites, a source familiar with the matter tells CNN.",
    "link": "https://www.cnn.com/2023/04/03/politics/chinese-spy-balloon/index.html",
    "published": "Mon, 03 Apr 2023 13:38:22 GMT",
    "source": "http://rss.cnn.com/rss/edition.rss",
    "content_type": "rss",
    "full_content": "US sailors recover a suspected Chinese high-altitude surveillance balloon that was downed by the United States over US territorial waters off the coast of Myrtle Beach, South Carolina, on February 5, 2023.U.S. Fleet Forces/U.S. Navy/ReutersWashingtonCNN—TheChinese spy balloonthat transited the US earlier this year was able to capture imagery and collect some signals intelligence from US military sites, a source familiar with the matter tells CNN.The balloon was able to transmit information back to Beijing in real time, the source said, and the US government still does not know for sure whether the Chinese government could wipe the balloon’s data as it received it. That raises questions about whether there is intelligence the balloon was able to gather that the US still doesn’t know about.Still, the intelligence community has not been overly concerned about the information the balloon was able to gather, the person said, because it is not much more sophisticated than what Chinese satellites are able to glean as they orbit over similar locations.A US intelligence official told CNN on Monday that “although analysis of the wreckage of the High Altitude Balloon remains ongoing, thus far, its flight over the United States does not appear to have provided critical new insights to the People’s Republic of China.”The US also knew what the balloon’s path would be and was able to protect sensitive sites and censor some signals before the balloon was able to pick them up,officials have said.As CNN has reported, the US intelligence community last yeardeveloped a method of trackingwhat it says is a fleet of these Chinese balloons operating across the globe, controlled by the Chinese military.The FBI is still examining the balloon, but so far officials have been able to glean additional information about how the device worked, including the algorithms used for the balloon’s software and how it is powered and designed.CNN has reached out to the National Security Council at the White House and the Pentagon for comment. NBC wasfirst to reporton the new intelligence.Video Ad FeedbackJustin Trudeau on what the world needs to do to handle China's threats01:33- Source:CNNJustin Trudeau on what the world needs to do to handle China's threats01:33The balloon first crossed into US airspace over Alaska in late January before passing through Canada and down into Montana, where it hovered for a few days, leading the US to believe it was trying to surveil sensitive military sites, like Malmstrom Air Force Base in Montana. It waseventually shot downby the US off the East Coast on February 4, and the incident further escalated tensions between Washington and Beijing, including the postponement of a diplomatic visit by US Secretary of State Antony Blinken to China.A senior State Department official said in February that, as the balloon floated across the US, it “was capable of conducting signals intelligence collection operations.”Gen. Glen VanHerck, the commander of US Northern Command and NORAD, said at the time that the US “did not assess” that the balloon “presented a significant collection hazard beyond what already exists in actionable technical means from the Chinese.”The surveillance program, which includes a number of similar balloons, is in part run out of the small Chinese province of Hainan, officials told CNN. The US does not know the precise size of the fleet of Chinese surveillance balloons, but sources tell CNN that the program has conducted at least two dozen missions over at least five continents in recent years.Roughly half a dozen of those flights have been within US airspace, although not necessarily over US territory, according to one official familiar with the intelligence.China has maintained that the balloon was actually just a weather balloon thrown off course, and the US has been assessing the possibility that it was not deliberately maneuvered into the continental US by the Chinese government, CNN hasreported.Still, China did maintain some ability to maneuver the balloon, officials believe. And once the balloon was over Montana, China appeared to take advantage of its position to loiter over sensitive sites and try to collect intelligence.This story has been updated with additional reporting.CNN’s Alex Marquardt contributed to this report."
  },
  {
    "title": "Beijing promised to 'fight back' over Taiwan leader's US visit. But this time it has more to lose",
    "description": "An anticipated meeting between Taiwan's President Tsai Ing-wen and US House Speaker Kevin McCarthy in California this week has sparked concerns of a repeat of the pressure campaign China launched last year when then-Speaker Nancy Pelosi visited Taipei.",
    "link": "https://www.cnn.com/2023/04/04/asia/tsai-ing-wen-taiwan-mccarthy-meeting-analysis-intl-hnk/index.html",
    "published": "Tue, 04 Apr 2023 07:49:53 GMT",
    "source": "http://rss.cnn.com/rss/edition.rss",
    "content_type": "rss",
    "full_content": "Taiwan's President Tsai Ing-wen waves as she arrives at a hotel in New York during a stopover on Thursday, March 30, 2023 a day before flying to Central America.John Minchillo/APHong KongCNN—Ananticipated meetingbetween Taiwan’s President Tsai Ing-wen and US House Speaker Kevin McCarthy in California this week has sparked concerns of a repeat of the pressure campaignChinalaunched last year when then-Speaker Nancy Pelosi visited Taipei.At that time, Beijingencircled the island democracywith unprecedented military drills – firing multiple missiles into its surrounding waters and sending dozens of warplanes speeding across a sensitive median line dividing the Taiwan Strait.It alsocut off contactwith the United States over a number of issues from military matters to combating climate change, in retaliation for what it viewed as a violation of its sovereignty.This time, Beijing has already threatened to “resolutely fight back” if a Tsai-McCarthy meeting goes ahead.Video Ad FeedbackSee why tensions are rising between US and China over Taiwan02:32- Source:CNNSee why tensions are rising between US and China over Taiwan02:32It also slammed Washington for allowing Tsai to stopover in the US while en route to and from official visits in Central America, warning it could lead to“serious” confrontationbetween the two powers.Adefiant Tsaistaked out her own ground, pledging as she took off on her 10-day trip not to let “external pressure” stop Taiwan from connecting with the world and like-minded democracies.But the optics of the meeting, taking place in California and not Taiwan, and its timing – at a particularly thorny moment in China’s foreign relations andahead of a presidential election in Taiwan that could reset the tone of its relationship with Beijing – may see Beijing tread more carefully this time, or at least not escalate further, analysts say.“This puts the burden on China not to overreact, because any overreaction is only going to push China further away from the world,” said Yun Sun, director of the China Program at the Stimson Center think tank in Washington.That doesn’t mean, however, that Beijing won’t be closely watching Tsai’s movements as it calibrates its response – and decides how much military might to flex over her meeting with an American lawmaker on American soil.The opacity of China’s system – and the potential for competing interests within its vast bureaucracy – also make it difficult to accurately predict its response.“Every time Taiwan does anything that China doesn’t like, the Chinese react with their own military coercion,” Sun said. But in the current situation, “they have to consider the consequences of overreaction,” she added.House Speaker Kevin McCarthy talks to reporters at the Capitol in Washington on March 24, 2023.J. Scott Applewhite/APRising pressureThe expected meeting, which McCarthy’s officeannouncedearlier this week would take place on Wednesday, also comes at a precarious moment in US-China relations.Washington and Beijing are struggling to stabilize their communicationamid flaring tensions over issues from a downedsuspected Chinese surveillance balloontosemiconductor supply chains– raising the stakes of potential damage to that relationship if Beijing lashes out as it did when Tsai met Pelosi.Taiwan is still feeling the fallout of that response last August, with Chinese military forces now regularly making incursions over what had previously been an informal but largely respected border of control between Beijing and Taipei in the Taiwan Strait. Taiwan’s official Central News Agency also reported Monday that Tsai would meet with McCarthy, citing Tsai’s presidential office.Video Ad FeedbackSee image of a Chinese balloon hovering over Taiwan03:05- Source:CNNSee image of a Chinese balloon hovering over Taiwan03:05But a meeting between Tsai and the leader of the Republican majority in the US House of Representatives, who ranks second in line to the Presidency, would mark another symbolic moment for Taiwan and the US, which only maintain unofficial ties.For Tsai, who is entering the final year of her two-term presidency, “it’s clearly a capstone event,” according to Wen-Ti Sung, a political scientist at the Australian National University’s Taiwan Studies Program. “She has this image as the Taiwanese president who has taken US-Taiwan relations to new heights, and who … has been able to give Taiwan almost unprecedented international visibility,” he said.That increased visibility – and enhanced cooperation with the US – has followed China’s mounting pressure on the island, which sits fewer than 110 miles (177 kilometers) from the mainland coast.China’s Communist Party claims the self-governing island democracy as its own despite never having controlled it, and has vowed to take the island, by force if necessary.The flags of Taiwan and Honduras flutter in the wind outside the Taiwan Embassy in Tegucigalpa, Honduras March 15, 2023. REUTERS/Fredy RodriguezFredy Rodriguez/Reuters/FILE"
  },
  {
    "title": "'Scary, cold, hungry and lonely': Volunteer soldier shares experience on front line",
    "description": "A young volunteer soldier, Akula, who signed up for the war at the beginning of the Russian invasion is now dealing with the trauma of war. He spoke to CNN's David McKenzie about his time on the front lines and how it has affected his mental health.",
    "link": "https://www.cnn.com/videos/world/2023/04/03/soldiers-russia-ukraine-war-david-mckenzie-pkg-ovn-intl-ldn-vpx.cnn",
    "published": "Mon, 03 Apr 2023 12:13:24 GMT",
    "source": "http://rss.cnn.com/rss/edition.rss",
    "content_type": "rss",
    "full_content": "‘Scary, cold, hungry and lonely’: Volunteer soldier shares experience on front line | CNNCNN values your feedback1. How relevant is this ad to you?2. Did you encounter any technical issues?Video player was slow to load contentVideo content never loadedAd froze or did not finish loadingVideo content did not start after adAudio on ad was too loudOther issuesAd never loadedAd prevented/slowed the page from loadingContent moved around while ad loadedAd was repetitive to ads I've seen previouslyOther issuesCancelSubmitThank You!Your effort and contribution in providing this feedback is much\n                                        appreciated.CloseClose iconWorldAfricaAmericasAsiaAustraliaChinaEuropeIndiaMiddle EastUnited KingdomMoreAfricaAmericasAsiaAustraliaChinaEuropeIndiaMiddle EastUnited KingdomWatchListenLive TVSubscribeSign inMy AccountSettingsNewslettersTopics you followSign outYour CNN accountSign in to your CNN accountSign inMy AccountSettingsNewslettersTopics you followSign outYour CNN accountSign in to your CNN accountLive TVListenWatchEditionUSInternationalArabicEspañolEditionUSInternationalArabicEspañolAfricaAmericasAsiaAustraliaChinaEuropeIndiaMiddle EastUnited KingdomFollow CNNWorldAfricaAmericasAsiaAustraliaChinaEuropeIndiaMiddle EastUnited KingdomUS PoliticsTrumpFacts FirstCNN Polls2025 ElectionsBusinessTechMediaCalculatorsVideosMarketsPre-marketsAfter-HoursFear & GreedInvestingMarkets NowNightcapHealthLife, But BetterFitnessFoodSleepMindfulnessRelationshipsEntertainmentMoviesTelevisionCelebrityTechInnovateForeseeable FutureMission: AheadWork TransformedInnovative CitiesStyleArtsDesignFashionArchitectureLuxuryBeautyVideoTravelDestinationsFood & DrinkStayNewsVideosSportsFootballTennisGolfMotorsportUS SportsOlympicsClimbingEsportsHockeyScienceSpaceLifeUnearthedClimateSolutionsWeatherWeatherVideoClimateUkraine-Russia WarIsrael-Hamas WarFeaturesAs EqualsCall to EarthFreedom ProjectImpact Your WorldInside AfricaCNN HeroesWatchLive TVCNN FastShows A-ZCNN10CNN MaxCNN TV SchedulesListenCNN 5 ThingsChasing Life with Dr. Sanjay GuptaThe Assignment with Audie CornishOne ThingTug of WarCNN Political BriefingThe Axe FilesAll There Is with Anderson CooperAll CNN Audio podcastsGamesDaily CrosswordJumble CrosswordPhoto ShuffleSudoblockSudoku5 Things QuizAbout CNNPhotosInvestigationsCNN ProfilesCNN LeadershipCNN NewslettersWork for CNN‘Scary, cold, hungry and lonely’: Volunteer soldier shares experience on front linePublished\n          8:13 AM EDT, Mon April 3, 2023Video Ad Feedback'Scary, cold, hungry and lonely': Volunteer soldier shares experience on front lineLink Copied!A young volunteer soldier, Akula, who signed up for the war at the beginning of theRussian invasionis now dealing with the trauma of war. He spoke to CNN's David McKenzie about his time on the front lines and how it has affected his mental health.03:28- Source:CNNRussia-Ukraine conflict16 videosVideo Ad Feedback'Scary, cold, hungry and lonely': Volunteer soldier shares experience on front line03:28Now playing- Source:CNNVideo Ad Feedback'Putin is a political animal who can sense fear,' says Ukraine FM07:46Now playing- Source:CNNVideo Ad FeedbackRussian media praises MTG for trying to derail Ukraine aid bill02:46Now playing- Source:CNNVideo Ad FeedbackWatch: Mitch McConnell blasts Tucker Carlson over Ukraine bill00:36Now playing- Source:CNNVideo Ad FeedbackSee timelapse of Ukraine's fragile front line as it waits for US aid02:30Now playing- Source:CNNVideo Ad FeedbackZelensky tells CNN the US needs to send aid to avoid Putin from starting WWIII02:17Now playing- Source:CNNVideo Ad FeedbackEx-defense secretary: How Putin may base his actions on a Trump presidency00:47Now playing- Source:CNNVideo Ad FeedbackRetired colonel says this is one of the 'big problems' amid Russia's recent gains01:29Now playing- Source:CNNVideo Ad FeedbackVideo appears to show Ukrainian drone strike on Russian oil refinery03:16Now playing- Source:CNNVideo Ad FeedbackUkraine destroying Musk's Starlink systems being used by Russia03:56Now playing- Source:CNNVideo Ad FeedbackHear what Putin said about US court cases involving Trump after reelection win in Russia03:11Now playing- Source:CNNVideo Ad FeedbackPutin's critics have been silenced but the election still matters. Here's why01:21Now playing- Source:CNNVideo Ad FeedbackCNN joins Ukrainian medivac team under cover of darkness04:21Now playing- Source:CNNVideo Ad FeedbackPutin's propaganda machine trolls and scapegoats the US03:48Now playing- Source:CNNVideo Ad FeedbackUkraine struggles to hold the line facing heavy fire from Russian advance04:24Now playing- Source:CNNVideo Ad Feedback'He has no idea what's coming': Biden sends message to Putin (2022)02:36Now playing- Source:CNNSee More VideosAd FeedbackSubscribeSign inMy AccountSettingsNewslettersTopics you followSign outYour CNN accountSign in to your CNN accountLive TVListenWatchWorldAfricaAmericasAsiaAustraliaChinaEuropeIndiaMiddle EastUnited KingdomUS PoliticsTrump"
  },
  {
    "title": "He is a human skeleton, Gaza hostage's brother tells BBC",
    "description": "Ilay David says the Hamas video showing his brother Evyatar emaciated and weak is a \"new form of cruelty\" that has left his parents shattered.",
    "link": "https://www.bbc.com/news/articles/cewyk4ezeedo?at_medium=RSS&at_campaign=rss",
    "published": "Mon, 04 Aug 2025 17:05:21 GMT",
    "source": "http://feeds.bbci.co.uk/news/rss.xml",
    "content_type": "rss",
    "full_content": "He is a human skeleton, Gaza hostage's brother tells BBC1 hour agoShareSaveJon DonnisonBBC NewsReporting fromJerusalemPaulin KolaBBC NewsReporting fromLondonShareSave'It's a new kind of cruelty', says Gaza hostage's brotherThe brother of an Israeli hostage held in the Gaza Strip has told the BBC that a Hamas video showing him emaciated and weak is a \"new form of cruelty\" that has left his parents shattered.Hamas released the footage of Evyatar David, 24, on Saturday, drawing strong condemnation from Israel and Western leaders.\"He's a human skeleton. He was being starved to the point where he can be dead at any moment, and he suffers a great deal. He barely can't speak, he barely can move,\" David's brother Ilay said in an interview on Monday.In the video, Evyatar says: \"I haven't eaten for days... I barely got drinking water.\" He is seen digging what he says will be his own grave.OtherA still showing Israeli hostage Evyatar David being held in a Gaza tunnel from the video released by HamasHostages' families have urged Prime Minister Benjamin Netanyahu to prioritise their release as reports suggest he might be planning to expand the military campaign.The footage of Evyatar was released after Palestinian Islamic Jihad published video of another hostage, Rom Braslavski, thin and crying.Both men were abducted from the Nova music festival during the Hamas-led attack on southern Israel on 7 October 2023.They are among 50 hostages still being held in Gaza, 20 of whom are believed to be alive.Ilay David said his father had barely recognised his son Evyatar's voice on the video and had not been able to sleep. He said his mother cried all day.\"Seeing those images of my brother as a human skeleton, we understood it's, it's, it's a new kind of cruelty,\" Mr David said. \"It's the lowest you can get.\"He called on world leaders to unite to save him and other hostages \"from the cruel, twisted hands of Hamas\".\"So we have to be so focused on delivering the message, which is, Evyatar is dying, we need to give him medicine, to give him food, proper food, and you need to get this treatment now, or else will die.\"Hamas's armed wing has denied it intentionally starves prisoners, saying hostages eat what their fighters and people in Gaza eat.Ilay DavidEvyatar David (L) with his brother Ilay shown here in happier timesHundreds of Israeli ex-officials appeal to Trump to help end Gaza warWorld leaders condemn videos of emaciated Israeli hostages in Gaza as Red Cross calls for accessFamine 'currently playing out' in Gaza, UN-backed experts warnAfter the hostages' videos were released, Netanyahu spoke with their families, telling them that efforts to return all the hostages \"will continue constantly and relentlessly\".But an Israeli official - widely quoted by local media - said Netanyahu was working to free the hostages through \"the military defeat of Hamas\".The possibility of a new escalation in Gaza may further anger Israel's allies who have been pushing for an immediate ceasefire as reports of Palestinians dying from starvation or malnutrition cause shock around the world.The main group supporting hostages' families condemned the idea of a new military offensive saying: \"Netanyahu is leading Israel and the hostages to doom.\"That view was pointedly made in a letter by some 600 retired Israeli security officials sent to US President Donald Trump urging him to pressure Israel to immediately end the war in Gaza.\"Your credibility with the vast majority of Israelis augments your ability to steer Prime Minister [Benjamin] Netanyahu and his government in the right direction: End the war, return the hostages, stop the suffering,\" they wrote.The group included former Mossad chief Tamir Pardo, Ami Ayalon, former chief of Shin Bet - Israel's domestic secret service agency - former Prime Minister Ehud Barak, and former Defence Minister Moshe Yaalon among others.\"It is our professional judgement that Hamas no longer poses a strategic threat to Israel,\" they said.\"At first this war was a just war, a defensive war, but when we achieved all military objectives, this war ceased to be a just war,\" said Ayalon.The former top leaders head the Commanders for Israel's Security (CIS) group, which has urged the government in the past to focus on securing the return of the hostages.\"Stop the Gaza War! On behalf of CIS, Israel's largest group of former IDF generals and Mossad, Shin Bet, Police, and Diplomatic Corps equivalents, we urge you to end the Gaza war. You did it in Lebanon. Time to do it in Gaza as well,\" they wrote to the US president.OtherA still of a video released by Palestinian Islamic Jihad showing hostage Rom BraslavskiIsrael launched a devastating war in Gaza following Hamas's 7 October attack in which about 1,200 people were killed and 251 taken into Gaza as hostages.More than 60,000 people have been killed as a result of Israel's military campaign in Gaza since 7 October, the Hamas-run health ministry says.On Monday, the ministry reported tha"
  },
  {
    "title": "Eurostar passengers face delays and cancellations due to French rail issue",
    "description": "Several services between London and Paris have been impacted, as have some trains between Amsterdam and Brussels.",
    "link": "https://www.bbc.com/news/articles/cq58z7w00vqo?at_medium=RSS&at_campaign=rss",
    "published": "Mon, 04 Aug 2025 17:15:42 GMT",
    "source": "http://feeds.bbci.co.uk/news/rss.xml",
    "content_type": "rss",
    "full_content": "Eurostar passengers face delays and cancellations due to French rail issue1 hour agoShareSaveKathryn Armstrong, Mitchell Labiak & Simon BrowningBBC NewsShareSaveAFP via Getty ImagesDisruptions to Eurostar trains are expected to continue until the end of MondayPassengers on several Eurostar trains are facing delays and cancellations after a power supply issue on a rail line in northern France led to its closure.The Eurostar website shows at least nine services on Monday between London and Paris have been cancelled, while a further 15 services have been delayed.The problem started at about 08:30 local time (06:30 GMT) on Monday and disruptions are expected to continue until the end of the day, with trains being diverted to run on slower lines.Eurostar has advised passengers to postpone their journeys if possible.Some services between Brussels and Paris and between Amsterdam and Paris have also been cancelled, delayed or faced other disruptions due to the rail closure, which happened on the high-speed line between Moussy and Longueil in the Hauts-de-France region.French track network operator SNCF Réseausaid on its website that the \"severely disrupted\" serviceswere due to a power supply issue which required \"major repairs\".It predicted delays of between one and five hours on the Eurostar, as well as its other services TGV inOui and Ouigo.Trains between London-Amsterdam, Brussels-Amsterdam, Brussels-London and Brussels-Cologne have not been impacted.Eurostar said SNCF Réseau had told it that one track would be reopened at 18:30 CET (17:30 GMT) and that this would \"allow trains to run again on the high-speed line but with limited service\".\"Traffic should be able to resume on both tracks tomorrow morning when services start running again,\" it added.Extra staff have been sent to affected stations to help passengers.August is a peak period for cross-Channel travel due to school holidays, meaning services are often busier than normal.Monday's disruptions come nearly a month aftera Eurostar train travelling between Brussels and London had to be evacuated innorthern France due to a power failure.And in June,there were two days of major disruptionsafter separate fatal incidents on France's LGV Nord line, which was followed by cable theft.Eurostar trains hit by delays ahead of Easter weekendParis train services slowly resume after WW2 bomb defusedFranceTransportEurostar"
  },
  {
    "title": "Could you be owed car finance compensation? Here's how to check",
    "description": "A court ruling could lead to millions claiming compensation over being mis-sold car finance deals.",
    "link": "https://www.bbc.com/news/articles/cr4e2d09wdko?at_medium=RSS&at_campaign=rss",
    "published": "Mon, 04 Aug 2025 14:32:26 GMT",
    "source": "http://feeds.bbci.co.uk/news/rss.xml",
    "content_type": "rss",
    "full_content": "Could I get car finance compensation?4 hours agoShareSaveLucy HookerBusiness reporter, BBC NewsShareSaveGetty ImagesIf you used car finance to buy a vehicle any time in the last 18 years, you could be in line for compensation.It follows a recent court ruling on hidden commissions that lenders paid to dealers, which opens the door for potential payouts to millions, if they are found to have been mis-sold finance.If you are eligible, you are still in for a bit of a wait, and for now the advice is not to sign up with a claims company promising to help you get redress, because it won't speed things up and they will charge a fee.But there are a few other things to bear in mind, if you are trying to work out whether you are likely to get compensation.Am I eligible?Most car buyers use motor finance, borrowing money and paying ininstalments over time.Car dealers almost always receive a payment for their part in arranging the loan - a commission.A Supreme Court ruled that many of these commission payments were legal, but in certain circumstances the failure by dealers to properly disclose details of the charges could be unfair and therefore unlawful.The ruling narrowed the scope of redress set by lower courts, which would have allowed claims for compensation from many more car buyers.The key is whether customers were treated \"fairly\", although the regulator, the Financial Conduct Authority (FCA), is still working on exactly what that will mean.One specific group of buyers who are likely to be eligible are people who took out car loans that included discretionary commission arrangements (DCAs). They were banned in 2021 but prior to that lenders gave car dealers leeway to charge higher interest and earn a percentage of that as commission. Customers who had DCAs and were overcharged as a result are likely to have a claim.If you still have your contract you can check the terms and conditions.How much is too much?The Supreme Court ruled in a test case that one car buyer, Marcus Johnson, should be entitled to compensation, setting a reference point for future cases.Mr Johnson told the court he was presented with \"an enormous amount of paperwork\". He didn't read it all and signed, trusting the sales representative to talk him through the deal.But 55% of the interest he was paying on the car was commission, which the judge deemed unreasonable.Anyone paying commission at that level is likely to be eligible for compensation, but it remains to be seen how much lower rates would have to be, to count as fair, ruling a customer out of the right to compensation.Car finance judgement 'a hard pill to swallow'Car finance payouts have been limited, but lenders aren't off the hookThe judge also referred to Mr Johnson's lack of \"sophistication\" when it came to financial matters. He was a young driver, with little experience.Most of us feel a bit bamboozled by a car showroom, with the hard-sell tactics and unfamiliar jargon, points out Danni Hewson, head of financial analysis at AJ Bell.\"It feels incredibly pressured,\" she says. And most people don't fully understand the deal they are signing up to, which often include \"balloon payments\", backloading the payment at the end of the contract.\"For a lot of people it will feel unfair,\" she says. But just because you would like to claw back some of the money you've paid, doesn't mean you will get anything.What about the small print?Part of the debate around whether car buyers should be compensated revolves around whether customers had given \"informed consent\" for commission payments.The details of any financial arrangement including commission must be included in the terms and conditions. But many people do not read the T&Cs, especially if there is time pressure, and someone is dangling a set of brand new car keys in front of them.Mr Johnson admitted he hadn't.But the Supreme Court ruled that the key elements of the contract were not given enough prominence.So even if all the details - including commission arrangements - were there in your contract, if they weren't highlighted in a separate box or in bold, you might be eligible for compensation, says Alex Neill, co-founder of charity Consumer Voice.If I think I am eligible, what do I do?The FCA is setting up a compensation scheme. In October it will launch a six week consultation over how it should work, with the first payments expected to come in 2026.So you can just wait until the scheme is available.Alternatively,the FCA suggestswriting to your lenderto establish the facts of your own case.Lenders must acknowledge your complaint within eight weeks, and by submitting a complaint at this stage you may get an indication of how likely you are to receive any redress, says Ms Neill.If you cannot remember the name of the lender involved the car dealership should be able to help you, she says.Consumer groups and the FCA advise against signing up with a claims company. Many are advertising their services online, but they cannot proceed with a claim "
  },
  {
    "title": "How an hour at The Oval provided the most dramatic Test finale you could wish for",
    "description": "The fifth Test finale between England and India at The Oval was the most intense, dramatic and emotional sport you could see, says chief cricket reporter Stephan Shemilt.",
    "link": "https://www.bbc.com/sport/cricket/articles/crm4j8424epo?at_medium=RSS&at_campaign=rss",
    "published": "Mon, 04 Aug 2025 14:55:19 GMT",
    "source": "http://feeds.bbci.co.uk/news/rss.xml",
    "content_type": "rss",
    "full_content": "'England and India provide most intense, dramatic and emotional finale'To play this video you need to enable JavaScript in your browser.This video can not be playedMedia caption,India win dramatic final Test by six runs to clinch series drawStephan ShemiltChief Cricket Reporter at The Kia OvalPublished3 hours ago743 CommentsInside the JM Finn Stand at The Oval, opposite the pavilion, is a staircase that leads up to the Test Match Special commentary box. It is used by media and spectators alike.In the hours after thesensational fifth Test between England and Indiaended, with the ground emptying, on that staircase was found a left shoe, then some underwear, then a right shoe.Because of their size, they presumably belonged to a man. Quite how the owners misplaced them, or when they realised their loss, is unclear. However, it raises the prospect that someone left this famous old ground both shoeless and pantless.It would have been entirely in keeping with the mayhem that had already played out on Monday morning.There had been 57 minutes of the most intense, dramatic and emotional sport you could ever wish to see.Twenty-five days of gripping Test cricket came down to a one-armed man painfully scampering 22 yards of south London turf. One wonders how the productivity of the UK was affected at the beginning of the working week, or how many offices in Mumbai, Kolkata and Bengaluru closed early.There had been an element of farce to the previous evening. Players went to the dressing rooms because of rain and bad light when the game was on a knife-edge, then stayed there as the gloom turned to evening sunshine.Any frustration over the events of Sunday turned into anticipation of what might be possible on Monday. Thirty-five runs or four wickets. The Oval was sold out, but would anyone bother to turn up?Turn up they did, filling this historic venue with constant noise and nervous energy. There were echoes of the2005 Ashes classic in Birmingham, when Edgbaston was full for what might have only been two deliveries of action. Just like then, there was a rich reward for turning up. India's six-run win here is the narrowest of its kind in this country since England beat Australia by two runs 20 years ago.England-India Test series best since 2005 Ashes - AgnewPublished5 hours agoWho pressed their Ashes case? Who disappointed? England's player ratingsPublished3 hours agoIndia win all-time classic despite Woakes heroicsPublished6 hours agoIndia began the day with a huddle that seemed to have every member of the touring party included. Security, chef, bus driver. England, naturally, played football.Fittingly, it was Surrey v England. When Jamie Overton took fours off each of the first two balls of the day, England had almost a quarter of the runs they required. It was the best it got.Jamie Smith has looked increasingly frazzled in his first five-Test series as a wicketkeeper. He wafted at two deliveries, then edged the third. The dhol drum of the Bharat Army beat out the rhythm of We Will Rock You, and rocked England were. When Overton was struck on the pad, umpire Kumar Dharmasena paid his own 2005 tribute with the slow finger of Rudi Koertzen.Josh Tongue had a scattergun game with the ball and found himself as the last line of defence before the stricken Chris Woakes.On Sunday evening, Woakes somehow folded his dislocated shoulder into a set of cricket whites, which sounds excruciatingly painful in itself. When Tongue had his stumps rearranged by Prasidh Krishna, security staff rushed on to the outfield, believing the match to be over. They had not been briefed that Woakes, the nicest man in cricket, is also the bravest.To play this video you need to enable JavaScript in your browser.This video can not be playedMedia caption,'Here he comes!' - Woakes comes out to bat with arm in slingEarlier this year, Woakes had a tattoo inked on his left tricep in memory of his late father Roger, who died last year. Now the same arm was strapped under his England sweater as he descended the pavilion stairs, putting his broken body on the line for the Three Lions on his chest.History will remember Woakes as a World Cup winner in both formats, an Ashes winner and one of the finest seamers in English conditions. This will trump them all. The Wizard will always be the man who tried to help England win a Test with only one functioning arm.How painful it must have been for Woakes to run three times between the wickets, his shoulder jolted by every step. Mercifully, he never faced a delivery. While Woakesplayed Jack Leach, Gus Atkinson could not ape Ben Stokes. Atkinson was bowled attempting to hit the six that would have levelled the scores and won the series.According to Stokes, Woakes' reaction in the dressing room was to \"shrug his shoulder\", which is probably the last thing he should have done.To play this video you need to enable JavaScript in your browser.This video can not be playedMedia caption,'England panicked' - Vaughan on fifth Test "
  },
  {
    "title": "British couple held in Iran are in country's worst prisons, says son",
    "description": "Joe Bennett says Lindsay and Craig Foreman have been held in solitary confinement.",
    "link": "https://www.bbc.com/news/articles/cp94ymg3x1go?at_medium=RSS&at_campaign=rss",
    "published": "Mon, 04 Aug 2025 16:17:18 GMT",
    "source": "http://feeds.bbci.co.uk/news/rss.xml",
    "content_type": "rss",
    "full_content": "Parents held in Iran's 'worst prisons', says son2 hours agoShareSaveShareSaveFamily handoutThe East Sussex couple were arrested in Iran at the start of the yearThe son of a British couple detained in Iran has learnt about their whereabouts after seven months of \"silence and uncertainty\".Joe Bennett said the UK government had confirmed Lindsay and Craig Foreman, from East Sussex, had been separated and were being held in \"Iran's worst prisons\".The couple, who were on a once-in-a-lifetime trip around the world, were detained by Iranian authorities in January and later charged with espionage – something the family denies.A Foreign, Commonwealth & Development Office (FCDO) spokesperson said they were continuing to raise their case directly with Iran's government.\"We are providing them with consular assistance and remain in close contact with their family members,\" they added.'Leverage'Mr Bennett said his mum has been transferred to Qarchak Prison, a female-only facility that Iran Human Rights says \"disregards the most basic principles of human dignity\".Violence, abuse, severe overcrowding, unsanitary drinking water, a lack of basic facilities or adequate healthcare services and degrading, gender-based treatment have been documented by the non-governmental organisation at the prison.Mr Bennett said his dad was being held in Fashafouyeh  Prison, where inmates reportedly suffer inhumane, overcrowded and unsanitary conditions, including severely limited water resources.Joe BennettMr and Ms Foreman have been held in solitary confinementMr Bennett, from Folkestone in Kent, added the family \"feared\" for his parents' mental and physical welfare, though they were trying to be strong for them.\"We haven't really got proof of life,\" he said.Mr Bennett said his understanding was they had been held in solitary confinement for 30 days.\"I could not imagine what that was like,\" he told BBC Radio Kent.He said that visits by British officials had found his dad was \"dishevelled and had lost a lot of weight\", while his mum was not walking very well due to prison conditions.Mr Bennett added he believed the couple were being held as political \"leverage\".Iran's governmentpreviously held Nazanin Zaghari-Ratcliffe, a British-Iranian national, for six years in what was widely seen as an attempt to pressure the UK to pay a long-standing, multi-million-pound debt.Mr Bennett called on the FCDO to \"do everything they can\" to secure their release.Follow BBC Kent onFacebook,X, andInstagram. Send your story ideas tosoutheasttoday@bbc.co.ukor WhatsApp us on 08081 002250.More on this storyCouple being held in Iran 'outrageous', MP saysWait to speak to hostage parents 'intolerable'Related internet linksForeign & Commonwealth OfficeIranNazanin Zaghari-Ratcliffe case"
  },
  {
    "title": "Liverpool remember Diogo Jota at first Anfield game since his death",
    "description": "Liverpool pay tribute to late forward Diogo Jota in their first match at Anfield since his death.",
    "link": "https://www.bbc.com/sport/football/articles/cly64e43ex5o?at_medium=RSS&at_campaign=rss",
    "published": "Mon, 04 Aug 2025 16:24:45 GMT",
    "source": "http://feeds.bbci.co.uk/news/rss.xml",
    "content_type": "rss",
    "full_content": "Liverpool remember Jota before first Anfield gameImage source,EPAImage caption,Liverpool legend Phil Thomson and Athletic president Jon Uriarte laid wreaths on the pitch before the first Anfield game since Jota's deathEmlyn BegleyBBC Sport journalistPublished2 hours agoLiverpool paid tribute to Diogo Jota in their first match at Anfield since the late forward's death.The 28-year-oldPortugal international died in a car crashin Spain along with his brother Andre Silva, 25, in July.The Reds played Athletic Bilbao in a double header of pre-season friendlies on Monday, with games at 17:00 and 20:00 BST.Liverpool legend Phil Thomson and Athletic president Jon Uriarte brought wreaths out on to the pitch and laid them on the edge of the six-yard box before the opening game.The billboards around Anfield read 'Rest in Peace Diogo Jota and Andre Silva - You'll Never Walk Alone', while fans sang about Jota.Reds supporters also held up flags and banners remembering their number 20 - a number that has been retired by the club this summer.Both sets of players, coaches and fans applauded as the game was stopped in the 20th minute.Jota scored 65 goals in 182 appearances for the Reds, helping them win the Premier League, FA Cup and League Cup, following his arrival from Wolves in 2020.\"I know that you will want to pay your tributes before, during and after the games, and I know that we will hear his song ringing out throughout the evening,\" said Reds boss Arne Slot in his match programme notes.\"It has been a tough time for everyone connected with the club, but especially for Diogo's family, his wife, his children and friends.\"We cannot imagine the pain that they have been going through, and the club will continue to give them all the support they can going forward. We will always carry him with us in our hearts, in our thoughts, wherever we go.\"Diogo's passing has had a big impact on us all, but what has been so important has been the love and care shown from the football world, and in particular of course the Liverpool FC community.\"The Reds play Crystal Palace in the Community Shield at Wembley on Sunday, 10 August, and open the Premier League season at Anfield against Bournemouth on Friday, 15 August.Liverpool will pay tribute to Diogo Jota ahead of Athletic Bilbao double headerImage source,Getty ImagesImage source,Getty ImagesImage source,Getty ImagesRelated topicsLiverpoolPremier LeagueFootballMore on this storyLatest Liverpool news, analysis and fan viewsGet Liverpool news sent straight to your phonePublished26 July 2022"
  },
  {
    "title": "Farage calls on police to share immigration status of charged suspects",
    "description": "The plea comes after two men were charged in connection with the alleged rape of a 12-year-old girl in Warwickshire.",
    "link": "https://www.bbc.com/news/articles/c860py73pglo?at_medium=RSS&at_campaign=rss",
    "published": "Mon, 04 Aug 2025 17:32:17 GMT",
    "source": "http://feeds.bbci.co.uk/news/rss.xml",
    "content_type": "rss",
    "full_content": "Farage calls on police to share immigration status of charged suspects56 minutes agoShareSaveAlys DaviesBBC NewsShareSaveEPA/ShutterstockNigel Farage has called on the police to release the immigration status of suspects charged with crimes following the arrest of two men in connection with the alleged rape of a 12-year-old girl in Warwickshire.The Reform UK party leader said he \"absolutely\" thinks such details should be released when asked about the matter at a news conference on Monday.It has been reported that the two men charged in connection with the alleged rape in Nuneaton last month are Afghan nationals but the police have not confirmed this.Warwickshire Police said once someone is charged with an offence, the force follows national guidance that does not include sharing ethnicity or immigration status.The authorised professional practice followed by forces across the country, and cited by the College of Policing, says the same.Asked by a reporter at the news conference in Westminster whether police should release the names, addresses and immigration statuses of suspects after they have been charged with a crime, Farage said: \"What caused unrest on our streets after Southport last year was us not being told the status of the attacker.\"That led to crazy conspiracy theories spreading online.\"Last year'sdeadly attack in Southport, in which three young girls were murdered, led to the spreading of a false claim online that the attacker was a Muslim asylum seeker.Linking a perceived lack of information from police about Nuneaton to what happened in Southport last July, Farage continued: \"To have masses of speculation as to what might have happened makes things I think far worse than they otherwise would be\".Asked to clarify his thoughts further on whether he thought police forces should be obliged to publish such details, he said: \"Yes, I absolutely think that they should.\"Later in the news conference, Farage called the police's decision not to release details about the alleged Nuneaton attackers a \"cover-up that in many ways is reminiscent of what happened after the Southport killings last year.\"\"It is not... in any way at all a contempt of court for the British public to know the identity of those who allegedly have committed serious crimes,\" he added.\"I felt that in the wake of the Southport attacks, and I feel that ever more strongly today.\"I regret taking my son to a riot following Southport attack, says stepmotherHow Southport is trying to heal, one year onAhmad Mulakhil has been charged with two counts of rape, while Mohammad Kabir has been accused of kidnap, strangulation and aiding and abetting the rape of a girl aged under 13.Mr Mulakhil, 23, appeared before magistrates in Coventry on 28 July, while Mr Kabir, also 23, appeared in court on Saturday.Both were remanded in custody.Leader of Warwickshire County Council George Finch told the same news conference on Monday morning that he was \"begging\" for information to be released following the charges.Finch, who at 19 became the youngest council leader in the UK and represents Reform UK, said he had contacted the chief executive of the council, Monica Fogarty, saying he wished to speak to Warwickshire Police \"to urge\" them to release the immigration status of the first man charged.\"I was begging for this to be released, screaming, phoning, asking [for the information] to be released\", he said.Following the charging of the second suspect, Finch said he wrote a letter addressed to Home Secretary Yvette Cooper and Warwickshire Police's Chief Constable Alex Franklin-Smith calling for the immediate release of the two suspects' details.Finch published the letter on his social media accounts on Sunday, in which he said Ms Fogarty had told him that Mr Kabir was an asylum seeker living in a house of multiple occupancy (HMO).Speaking on Monday, Finch said he would be working to \"fight against\" houses of multiple occupancy that \"have been put up to house illegal immigrants\".He also claimed Reform UK needed to \"change things\" and are \"the last line of defence against the blob, the cover-ups of the councils\".When asked if police should release the ethnicity of people charged with offences, the prime minister's official spokesman said the police and courts were operationally independent but the principle was to be \"as transparent as possible\".\"We've always said and continue to say that transparency is important,\" he said.\"That is our position. For police up to central government, we should always be as transparent as possible when it comes to cases.\"He added: \"This is clearly a deeply upsetting and distressing case which the public are right to feel shocked and angry about.\"In relation to this case, the individuals have been charged and we are now in a live investigation.\"In a statement, Warwickshire Police and Crime Commissioner Philip Seccombe said: \"It is essential to state that policing decisions - such as whether to release details about a suspect - must fol"
  },
  {
    "title": "Dame Stella Rimington, former MI5 director general, dies at 90",
    "description": "Dame Stella was the first female director general of the service and the first to be publicly identified.",
    "link": "https://www.bbc.com/news/articles/cgkrm00y6rgo?at_medium=RSS&at_campaign=rss",
    "published": "Mon, 04 Aug 2025 17:31:19 GMT",
    "source": "http://feeds.bbci.co.uk/news/rss.xml",
    "content_type": "rss",
    "full_content": "Dame Stella Rimington, former MI5 director general, dies at 9057 minutes agoShareSaveShareSavePADame Stella Rimington, MI5's first female director general, has died, her family have said.Dame Stella, who headed the service from 1992 to 1996, was widely credited as being the model for Dame Judi Dench's M in the James Bond films.She joined MI5 full time in 1969, and served as deputy director general in 1991 before being promoted to director general a year later.She was the first to be publicly identified when appointed - and when a newspaper published a photo of her house, she and her family had to move to a covert location for their own protection.After leaving the service, Dame Stella began a career as a novelist.In a statement, her family said: \"She died surrounded by her beloved family and dogs and determinedly held on to the life she loved until her last breath.\"MI5Spying"
  },
  {
    "title": "Two teenagers detained for torture and killing of cats",
    "description": "Two 17-year-olds tortured and cut open the animals, which had been transported in a black bag.",
    "link": "https://www.bbc.com/news/articles/crkznr21ly8o?at_medium=RSS&at_campaign=rss",
    "published": "Mon, 04 Aug 2025 17:18:22 GMT",
    "source": "http://feeds.bbci.co.uk/news/rss.xml",
    "content_type": "rss",
    "full_content": "Teenagers detained for cats' torture and killing1 hour agoShareSaveAnna O'NeillBBC NewsShareSaveMet PoliceThis black animal carrier was used to transport the kittensA teenage boy and girl have been detained for the torture and killing of two kittens that were found cut open in a wooded area in west London.District Judge Hina Rai said that the killings near Ruislip Golf Course were \"without a doubt the most awful offences against animals I have seen in this court\".The boy, 17, had also dreamed of killing a human and \"getting away with murder\".He was given a 12-month detention and training order and the girl, 17, was given a nine-month detention order at Highbury Corner Youth Court.Warning: The following report contains graphic content and descriptions of animal cruelty.Both teenagers, who cannot be named because of their age, were also given a lifetime ban on keeping or owning animals.They pleaded guilty on 21 May to causing unnecessary suffering to the animals by mutilating and killing them.BBC finds electrocuted, drowned and starved cats in online torture groupsOn 3 May, a member of the public who found the kittens warned another passerby not to go down the footpath because \"there is something horrific down there\".The black kittens were found with ropes attached to them and had been cut open. Also discovered at the scene were blowtorches, three knives and a pair of scissors.One kitten was found hanging from a rope and was completely ripped open, with its eyes bulging, the court heard.Alongside the tools, a significant amount of blood and fur were found.The teenagers also admitted one count of unlawful possession of a knife.Met PoliceThe pair were seen running away from the scene at the time - the Met Police originally issued this image which has been edited to protect the teenagers' identitySentencing the boy, Judge Rai told him his actions had been \"extensively planned\" and were \"clearly premeditated\".She told him: \"You said sorry in your [police] interview but reports also show that you struggle to show empathy and realise that the kittens would suffer.\"She added: \"It seems you chose the kittens because they have emotion and you would have power over them.\"Notes on the boy's phone detailed his desire to kill another person.They read: \"I really wanted to murder someone.\"Every day I was researching how to get away with murder. I have come close. I have killed cats to reduce my urges. I have skinned, strangled and stabbed cats.\"The boy, who may have attention deficit hyperactivity disorder and autism which has yet to be diagnosed, had no previous convictions.AlamyThe kittens were found near Ruislip Golf CourseJudge Rai told the girl, who also had no previous convictions: \"It is not clear who took the lead but from what I have read you were both equally responsible.\"The court heard there were sinister items on the girl's mobile phone of mutilated pets and she had a fascination with dead human bodies.The judge told the girl she had \"the potential for a bright future which makes this case shocking and extremely concerning\".The girl had accepted she had been \"cold and cruel\" in her actions but this came after she had \"distanced\" herself from the offences.The judge added: \"It was clearly premediated and there was evidence you may have been the instigator and more willing to cause the kittens suffering for attention from the mental health agencies.\"The girl had placed messages on Gumtree to buy three kittens because \"she did not want them to be lonely\", the court heard.The court also ordered that the girl's pet rabbit be taken away from her.Det Con Rebecca Rickhuss, who led the investigation, said: \"This was a deeply distressing case and as we continued to gather evidence, we grew concerned that torturing and killing cats would be a catalyst onto further violent offending.\"I urge parents and carers to take an active interest in what their children are accessing online.\"On Defendant A's phone, we found graphic videos of animal cruelty, disturbing notes, and posts glorifying violence.\"Additional reporting by PA MediaListen to the best of BBC Radio London onSoundsand follow BBC London onFacebook,XandInstagram. Send your story ideas tohello.bbclondon@bbc.co.ukHunt on for teens after kittens found 'mutilated'Calls for catapult law to tackle wildlife crimeRuislipLondonHillingdonAnimal cruelty"
  },
  {
    "title": "Calvin Harris shares placenta photos after birth of son",
    "description": "The Scottish DJ announces the birth of his son alongside a series of placenta photos.",
    "link": "https://www.bbc.com/news/articles/c5y0295wg30o?at_medium=RSS&at_campaign=rss",
    "published": "Mon, 04 Aug 2025 17:29:06 GMT",
    "source": "http://feeds.bbci.co.uk/news/rss.xml",
    "content_type": "rss",
    "full_content": "Calvin Harris shares placenta photos after birth of son33 minutes agoShareSaveShaun DacostaBBC NewsbeatShareSaveCalvin Harris/InstagramCalvin Harris said son Micah was born on 20 JulyDJ Calvin Harris has divided fans with a post announcing the birth of his baby boy.The Scottish DJ, who is married to Radio 1 host Vick Hope, praised his \"superhero\" wife on Instagram in a series of photos, taken in Ibiza, showing the moments after son Micah's home birth.He also uploaded a shot of Vick's placenta, alongside images appearing to show the organ being de-hydrated and turned into pills.While many rushed to congratulate the couple, others said they were taken aback by the graphic photo - which has since been hit with an age restriction by the social media site.Calvin told his 11 million followers that his son was born on 20 July - adding he was \"so grateful\" for the new arrival.Singer Example and Scotland footballer Andy Robertson were among the celebrities to congratulate the couple, alongside Radio 1 presenter Arielle Free, who wrote: \"Welcome to the world wee Micah\".Singer Becky Hill was among those who praised the decision to share pictures of the placenta.\"Amazing we grow a whole new organ to provide life!\" she wrote.\"Good job not wasting it either, that's some goddess magic right there!\"Others also praised the post for \"normalising\" the aftermath of childbirth.But some questioned whether it was necessary to include the photo without warning, while others expressed surprise.\"I was NOT prepared for the placenta pic,\" wrote one, and another replied: \"Placenta and placenta pills were not on my bingo card for today but OK.\"The placenta is an organ made in the womb during pregnancy that gives oxygen and nutrients to a foetus.It also acts as a filter to protect it from toxins and pollutants.Some people claim that eating the placenta after a baby is born has a range of health benefits for new mothers.Various preparation methods are used, including consuming the organ raw or cooking it.Some parents will get the placenta dehydrated and turned into vitamin-style tablets through a process called encapsulation.A review of 10 scientific studies carried out in 2015 foundno data to support the claim that eating the placenta carried any health benefits.Organisations such as America's Centre for Disease Control (CDC) have warned of potential contamination risks if the organ is not properly stored and prepared.Listen to Newsbeatliveat 12:45 and 17:45 weekdays - or listen backhere.KPop Demon Hunters star says chart success doesn't feel real'I was a shopping addict - it needs to be taken more seriously'Euro 2025 Lionesses kits outsell previous tournamentsCalvin HarrisMusic"
  },
  {
    "title": "Engineer restores pay phones for free public use",
    "description": "In a rural Vermont county, spotty cell phone coverage is the norm. But a local tinkerer is using old technology to help his community stay connected free of charge.<br />",
    "link": "https://www.npr.org/2025/08/04/nx-s1-5484013/engineer-restores-pay-phones-for-free-public-use",
    "published": "Mon, 04 Aug 2025 12:14:16 -0400",
    "source": "https://feeds.npr.org/1001/rss.xml",
    "content_type": "rss",
    "full_content": "NationalEngineer restores pay phones for free public useAugust 4, 202512:14 PM ETByJulian RingEngineer restores pay phones for free public useListen·2:082:08Toggle more optionsDownloadEmbedEmbed<iframe src=\"https://www.npr.org/player/embed/nx-s1-5484013/nx-s1-9394558\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">Vermont Representative Philip Jay Hooper, who represents Orange County, makes a call using one of Patrick Schlott's payphones.Patrick Schlotthide captiontoggle captionPatrick SchlottPatrick Schlott often finds himself in a cellular dead zone during his drive to work.\"You go down the road, you turn the corner and you're behind a mountain and you'll lose cell coverage pretty fast,\" he says.The 31-year-old electrical engineer says poor reception is a common frustration for residents of Vermont's Orange County. To address this issue, he's providing his community with a new way to stay connected.Schlott has taken old pay phones, modified them to make free calls, and set them up in three different towns across the county. He buys the phones secondhand from sites like eBay and Craigslist and restores them in his home workshop.Sponsor MessageWith just an internet connection, these phones can make calls anywhere in the U.S. or Canada — no coins required. And Schlott covers all the operating costs himself.\"It's cheap enough where I'm happy just footing the bill,\" he says. \"You know, if I'm spending $20 a month on, say, Netflix, I could do that and provide phone service for the community. And to me, that's way more fun.\"One of Schlott's pay phones in his home workshop.Patrick Schlotthide captiontoggle captionPatrick SchlottSince Schlott installed the first phone in March last year outside a general store in the town of Tunbridge, Vt., hundreds of calls have been made.\"I knew there would be some fringe cases where it would be really helpful,\" he says. \"But I never expected it to get daily use and for people to be this excited about it.\"He says the phones have come in handy for drivers whose cars have broken down nearby. And at a public library in Thetford Center — the most used installation by far — kids have been able to call their parents for rides home or simply to check in.In June, Vermont voted to ban cell phones in schools beginning in the 2026–2027 academic year.Schlott says public telephones will soon be more essential for students in the area.Sponsor Message\"Regardless of whatever side you are on that issue, there's going to be a need for communications for students,\" he says. \"And I've already gotten a few people reaching out saying, 'We need a way for the students to call home or call whomever. Can we get one of your phones?'\"Schlott has received some donations to help sustain his project. But he says his one-man funding model may need to adapt if the initiative continues to grow.\"One of the cornerstones that I want to stick to is, no matter what happens on the backend, the calls will always be free,\" he says. \"And I will figure out a way to make that happen.\"FacebookFlipboardEmail Engineer restores pay phones for free public useListen·2:082:08Toggle more optionsDownloadEmbedEmbed<iframe src=\"https://www.npr.org/player/embed/nx-s1-5484013/nx-s1-9394558\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">"
  },
  {
    "title": "Videos of Israeli hostages in Gaza increase pressure on Netanyahu for a ceasefire",
    "description": "New images of emaciated Israeli hostages held in Gaza have horrified Israelis and added pressure on Prime Minister Benjamin Netanyahu to reach a ceasefire with Hamas.",
    "link": "https://www.npr.org/2025/08/04/nx-s1-5492152/gaza-hostage-videos-israel",
    "published": "Mon, 04 Aug 2025 09:57:55 -0400",
    "source": "https://feeds.npr.org/1001/rss.xml",
    "content_type": "rss",
    "full_content": "Videos of Israeli hostages in Gaza increase pressure on Netanyahu for a ceasefireUpdated August 4, 202510:31 AM ETOriginally publishedAugust 4, 20259:57 AM ETByThe Associated PressFamilies of hostages protest demanding the release of their loved ones from Hamas captivity in the Gaza Strip at the plaza known as the \"hostages square\" in Tel Aviv, Israel, Saturday.Ariel Schalit/APhide captiontoggle captionAriel Schalit/APJERUSALEM — New images of emaciated Israeli hostages held in Gaza have horrified Israelis and added pressure on Prime Minister Benjamin Netanyahu to reach a ceasefire with Hamas, even as his government considers another expansion of the nearly 22-month war.Middle East conflictIn Gaza, more Palestinians are killed while waiting for food aidThe videos released late last week by militant groups Hamas and Palestinian Islamic Jihad show two skeletal hostages pleading for their lives. In one, Evyatar David says he is digging his own grave and speaks of days without food. In the other, Rom Braslavski writhes in agony on a dirty mattress and says injuries in his foot prevent him from being able to stand.The Associated Press does not normally publish videos of hostages filmed under duress, but is publishing brief excerpts after receiving consent from their families.Sponsor MessageThe videos led tens of thousands of Israelis to take to the streets on Saturday night and demand a ceasefire deal, in one of the largest turnouts for the weekly protests in recent months.\"In this new video, his eyes are extinguished. He is helpless, and so am I,\" Braslavski's mother, Tami, said in a statement.Warnings of famine in GazaThe videos were released as warnings about famine among Palestinians are growing in Gaza. Images of starving Palestinians have drawn international condemnation of Israeli policies limiting aid deliveries into the territory.Families of the hostages fear that the lack of food threatens the remaining hostages, too. Fewer than half of the 50 hostages are believed to be alive.Prime Minister Benjamin Netanyahu said he was shocked by the images of the two hostages and met with the Red Cross to ask that it bring hostages food and medicine — access that the organization says it has never been granted by Hamas.\"When I see these, I understand exactly what Hamas wants,\" Netanyahu said on Sunday. \"They do not want a deal. They want to break us using these videos of horror.\"Middle East conflictFrance, U.K., others plan to recognize a Palestinian state. What does that change?Netanyahu said the videos renewed his determination to release the hostages and eliminate Hamas. He added that the militant group is starving the hostages \"like the Nazis starved the Jews.\"The International Committee of the Red Cross said it was \"appalled by the harrowing videos\" and called for access to the hostages.Ofir Braslavski, whose son Rom was abducted by Islamic Jihad on Oct. 7, 2023, poses for a portrait in Almon, an Israeli settlement in the West Bank, Monday.Ohad Zwigenberg/APhide captiontoggle captionOhad Zwigenberg/APHamas' military wing said it was ready to respond positively to Red Cross requests to deliver food to hostages, if humanitarian corridors for aid deliveries are opened in a \"regular and permanent manner\" in Gaza. It also asserted that the hostages \"eat the same food as our fighters and the general public\" and denied any intentional starvation of them.Sponsor MessageIsrael's mission to the U.N. said it requested an emergency meeting of the U.N. Security Council on the hostages, which will take place Tuesday. Israel's Foreign Minister Gideon Sa'ar said he will travel to New York for the meeting.The videos were being used by Hamas \"to force upon us their conditions on remaining in power in Gaza,\" Sa'ar asserted.Netanyahu on Monday said he will convene the Cabinet this week to instruct Israel's military on how to achieve the goals of defeating the enemy, releasing the hostages and assuring that Gaza will no longer pose a threat to Israel: \"all of them, without exception.\"More starvation deathsThe videos of the hostages emerged as experts warn that Gaza faces \"a worst-case scenario of famine\" because of Israel's blockade.Middle East conflictA 'worst-case scenario of famine' is unfolding in Gaza, a U.N.-backed report warnsNo aid entered Gaza between March 2 and May 19, and aid has been limited since then. The United Nations says at least 850 people have been killed attempting to access aid near chaotic and dangerous distribution sites set up by Israel and the United States in May.Gaza's Health Ministry said Monday that five more Palestinian adults died of malnutrition-related causes in the past 24 hours. A total of 87 adults have died of malnutrition-related issues since the ministry started counting such deaths in late June, it said.Interview highlightsMore than 1,000 rabbis and Jewish leaders denounce starvation in GazaNinety-three children have died of malnutrition-related causes since the war in Gaza began, the mini"
  },
  {
    "title": "From allies to enemies: How the 1979 revolution transformed U.S.-Iranian relations",
    "description": "In his new book, <em>King of Kings,</em> Scott Anderson chronicles the upheaval that deposed Iran's reigning monarch — and the blunders by American policymakers that played a key role in the outcome.",
    "link": "https://www.npr.org/2025/08/04/nx-s1-5489730/from-allies-to-enemies-how-the-1979-revolution-transformed-u-s-iranian-relations",
    "published": "Mon, 04 Aug 2025 09:47:44 -0400",
    "source": "https://feeds.npr.org/1001/rss.xml",
    "content_type": "rss",
    "full_content": "NPRMiddle EastLISTEN & FOLLOWNPR AppApple PodcastsSpotifyAmazon MusiciHeart RadioYouTube MusicRSS linkMiddle EastFrom allies to enemies: How the 1979 revolution transformed U.S.-Iranian relationsAugust 4, 20259:47 AM ETHeard onFresh AirByDave DaviesFrom allies to enemies: How the 1979 revolution transformed U.S.-Iranian relationsListen·36:0736:07Toggle more optionsDownloadEmbedEmbed<iframe src=\"https://www.npr.org/player/embed/nx-s1-5489730/g-s1-80929\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">In his new book,King of Kings,Scott Anderson chronicles the upheaval that deposed Iran's reigning monarch — and the blunders by American policymakers that played a key role in the outcome.Sponsor MessageFacebookFlipboardEmail From allies to enemies: How the 1979 revolution transformed U.S.-Iranian relationsListen·36:0736:07Toggle more optionsDownloadEmbedEmbed<iframe src=\"https://www.npr.org/player/embed/nx-s1-5489730/g-s1-80929\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">"
  },
  {
    "title": "What higher tariffs mean for the U.S. economy. And, Israel's plan for hostage release",
    "description": "Higher tariffs are set to take effect this week, but the data is not showing that they have been working so far. And, Middle East envoy Steve Witkoff speaks with hostages' families in Israel.",
    "link": "https://www.npr.org/2025/08/04/g-s1-80889/up-first-newsletter-trump-tariffs-mexico-israel-hostages-gaza",
    "published": "Mon, 04 Aug 2025 07:38:09 -0400",
    "source": "https://feeds.npr.org/1001/rss.xml",
    "content_type": "rss",
    "full_content": "NPRLISTEN & FOLLOWNPR AppApple PodcastsSpotifyAmazon MusiciHeart RadioYouTube MusicAmazon AlexaRSS linkWhat higher tariffs mean for the U.S. economy. And, Israel's plan for hostage releaseAugust 4, 20257:38 AM ETByBrittney MeltonUS Economic Outlook, Mexico Tariff Uncertainty, Gaza Hunger And Hostages15:21Good morning. You're reading the Up First newsletter.Subscribehere to get it delivered to your inbox, andlistento the Up First podcast for all the news you need to start your day.Today's top storiesA new set of higher tariffs, which the Trump administration believes will help usher in an economic boom, is expected to take effect this week.Recent economic data casts doubt on that outlook. Last week, the Labor Department reported that thejob market weakened sharply duringthe late spring and early summer as President Trump's tariffs began to take effect. Hours after the report, Trump made a social media post calling for the firing of the head of the Bureau of Labor Statistics, Erika McEntarfer, who releases the job reports.LOS ANGELES, CALIFORNIA - JUNE 02: A 'Now Hiring' sign is displayed outside a resale clothing shop on June 2, 2023 in Los Angeles, California. Today's U.S. labor report shows that employers added 339,000 jobs in May with sectors including construction, healthcare, business services and transportation adding jobs with wages showing 4.3 percent growth over the same period last year. (Photo by Mario Tama/Getty Images)Mario Tama/Getty Imageshide captiontoggle captionMario Tama/Getty Images🎧Job numbers are not the only statistic that is less than flattering, NPR's Scott Horsley tellsUp First. Inflation is speeding up, and the overall economy is growing more slowly than in each of the last two years. Economists across the political spectrum have denounced Trump's move to fire McEntarfer assomething out of an authoritarian handbook.Tariffs on imports from Mexico have been delayed for 90 days as trade negotiations continue.The president made the announcement after a\"very successful\" conversationThursday with Mexican President Claudia Sheinbaum.Sponsor Message🎧In El Paso, Texas, as well as along other border communities, the two economies are functionally onethat happens to be split by an international boundary line, says Angela Kocherga of network station KTEP. The big trade community includes manufacturing, supply chains, purchasing, logistics, trucking and warehousing. Mexican tariffs took effect for a day in April before being rolled back. Since then, companies along the borderbegan to stockpile what they couldon the U.S. side. With stockpiling comes warehousing costs, which can also impact companies.➡️Here are five thingsto know abouthow Trump's trade policies could impact the U.S.and the global economy.U.S. special envoy to the Middle East Steve Witkoff visited Israel over the weekend, meeting with families of the hostages being held in Gaza. Witkoff informed them that Trump is working to reach a deal to help bring the hostages home. This comes a week after ceasefire talks stalled and many across the globe expressed outrage over mounting hunger in Gaza.🎧Videos surfaced over the weekend showing two men who were kidnapped at the NOVA music festival.In the footage was an emaciated hostage who said he feared he was digging his own grave, according to NPR's Eleanor Beardsley. Last night, a person familiar with the details informed NPR that among Israeli officials, there is an understanding that Hamas is uninterested in a deal and Prime Minister Benjamin Netanyahu is pushing for hostage release through military defeat. Hostage families haveexpressed that military action to freethe hostages is a death sentence for them.Sponsor MessageToday's listenEnlarge this imageNPR Music has compiled a list of great headphones at different price points — covering everything from casual listening to professional mixing and mastering.Deborah Lee/NPRhide captiontoggle captionDeborah Lee/NPRNPR Music has compiled a list of great headphones at different price points — covering everything from casual listening to professional mixing and mastering.Deborah Lee/NPRMovie soundtracks used to consistently produce hit after hit on pop radio, but it now feels like such occurrences are rare. In the 1980s, if you turned on the radio, there was a good chance you would hear numerous songs tied to blockbuster films. During the 1990s and 2000s, movie studios and music labels formed stronger relationships and heavily invested in soundtracks. Today, you can find individual songs from movies online without needing to purchase an entire album. However, that doesn't mean today's soundtracks lack impact. NPR's Isabella Gomez Sarmiento takes you on a journey through this evolution,detailing what happened to memorable movie songsand sharing snippets that evoke nostalgia.Life adviceMalaka Gharib/NPRIt can sometimes feel awkward to receive a compliment, and it may be difficult to accept one. Your reaction to compliments reveals a lot about you"
  },
  {
    "title": "Yosemite employees worked for weeks with no pay before the government hired them",
    "description": "Seasonal employees counting on housing at Yosemite were asked to volunteer for the park while the government was unable to onboard them at the start of the summer.",
    "link": "https://www.npr.org/2025/08/04/nx-s1-5387722/yosemite-workers-housing-volunteer-no-pay",
    "published": "Mon, 04 Aug 2025 06:00:19 -0400",
    "source": "https://feeds.npr.org/1001/rss.xml",
    "content_type": "rss",
    "full_content": "ExclusiveInvestigationsYosemite employees worked for weeks with no pay before the government hired themAugust 4, 20256:00 AM ETChiara EisnerAt the Yosemite Village, park employees and locals protest the federal government's actions to reduce staffing.Chiara Eisner/NPRhide captiontoggle captionChiara Eisner/NPRSome seasonal employees at Yosemite National Park worked for as long as six weeks without pay this spring and summer as park supervisors scrambled to manage hiring amid federal budget cuts, workers told NPR. The employees said they are now receiving hourly wages but have not been paid for the work they were asked to do as volunteers while they waited to be put on the federal payroll.Some of the workers said they feel exploited.\"It's definitely taking advantage of people who love their jobs and don't want the park to suffer,\" said one of the employees, who said they volunteered for three weeks before being hired.Sponsor MessageNPR spoke with four seasonal and two full-time workers employed by the National Park Service who described the situation. NPR has agreed not to publish the names of the employees because they are not permitted to speak publicly and feared retribution.Yosemite depends on seasonal workers to perform a variety of jobs from May through October, when the park receives most of the more than 4 million visitors who typically enter the grounds. The national park, located near Mariposa, Calif., is one of the most visited in America.At Yosemite, seasonal workers do \"anything from campgrounds operations, to wilderness permitting for backpackers, to the seasonal interpretive rangers, seasonal maintenance staff,\" said Jesse Chakrin, the executive director of The Fund for People in Parks, a nonprofit that advocates for national parks. The National Park Service hires thousands of seasonal workers a year across America. More than 100 are typically hired annually at Yosemite early in the busy season, Chakrin said.But 2025 was no typical year. On Feb. 14, 10 full-time federal employees at Yosemite were fired when the federal government terminated about 1,000 newly hired employees throughout the National Park Service. In the weeks that followed, additional experienced workers left the park service voluntarily. Since January, the amount of permanent staff across the service has declined by 24%, according to dataanalyzedin July by the National Parks Conservation Association, a nonprofit that defends parks.Sponsor MessageThen, after staff members were fired in February, some were hired back. That meant the park service's already straining Human Resources division had to take on additional work to bring those people into the workforce again, federal workers told NPR. Around late spring, when more visitors started entering the park and seasonal workers began arriving at Yosemite to start their jobs, Human Resources wasn't able to onboard all the seasonal staff, Yosemite employees said.\"We had the firing of probationary employees in February and then the rehiring, and this was a huge, huge burden on Human Resources to try to get people in and out,\" said Emily Thompson, the executive director of the Coalition to Protect America's National Parks, a nonprofit that supports workers at parks. \"And seasonal hiring was delayed.\"But Yosemite still needed seasonal workers. An Aprilorder from the Department of the Interior, the agency that oversees the National Park Service, said all parks should stay open as usual in 2025, with changes to operating hours requiring special approval.Seasonal workers needed the jobs, too. Many count on their employment at the park to provide them with housing. Because some parts of Yosemite are located dozens of miles from the nearest city, accommodations at the park are typically offered to people who work there, for a fee.\"They're dependent upon their job to have a home,\" said Chakrin.On May 18, visitors took photos at a viewing point above Vernal Fall, a waterfall at Yosemite National Park.Chiara Eisner/NPRhide captiontoggle captionChiara Eisner/NPRIn other parks, seasonal employees weren't hired at all.  As of July, only about 4,500 of the people expected to fill 8,000 seasonal positions across the park service were working in seasonal roles, according to the data from the National Parks Conservation Association. But in late April, supervisors at Yosemite started offering some of the prospective seasonal workers a different option. If they volunteered for at least 32 hours a week at the park, they could stay in Yosemite housing for free until the federal government was able to onboard and start paying them, emails reviewed by NPR reveal.Sponsor Message\"My supervisors were emailing people week after week saying, 'Hey, the update is there's no updates and we understand you guys need housing and you're relying on this and we're relying on you. And we don't know what's going on, but one option is to volunteer,'\" said one Yosemite worker.NPR requested an interview with a representative"
  },
  {
    "title": "Teen suicide is on the decline, new federal data shows",
    "description": "The 2024 National Survey on Drug Use and Health report found that in recent years, depression and suicidal thoughts and behaviors in teens have declined.",
    "link": "https://www.npr.org/sections/shots-health-news/2025/08/04/nx-s1-5490050/nsduh-depression-suicide-federal-statistics-teens",
    "published": "Mon, 04 Aug 2025 06:00:00 -0400",
    "source": "https://feeds.npr.org/1001/rss.xml",
    "content_type": "rss",
    "full_content": "Shots - Health NewsTeen suicide is on the decline, new federal data showsAugust 4, 20256:00 AM ETByRhitu ChatterjeeNew federal data show a decline in teen suicideListen·3:353:35Toggle more optionsDownloadEmbedEmbed<iframe src=\"https://www.npr.org/player/embed/nx-s1-5490050/nx-s1-9390962\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">New federal statistics suggest a decline in rates of suicidal thoughts and behavior among teens.Mary Long/Getty Imageshide captiontoggle captionMary Long/Getty ImagesA new federal report finds that the percentage of adults with suicidal thoughts and attempts remained about the same between 2021 and 2024.But the analysis of theNational Survey on Drug Use and Healthdid offer some good news: Over that same time period, depression and suicidal thoughts and behaviors in teens declined.\"I think it's very promising, and we're very hopeful about it,\" saysJill Harkavy-Friedman, senior vice president of research at theAmerican Foundation for Suicide Prevention.This is the first annual report released by the U.S. Department of Health and Human Services since the entire team of scientists in charge of the survey was fired this year by the Trump administration. The federal government has been doing this annual survey for decades. It currently interviews over 70,000 people 12 years and older in households across the United States.Sponsor MessageShots - Health NewsThese habits can cut the risk of depression in half, a new study findsThe new report shows that the prevalence of serious suicidal thoughts in 12-to-17-year-olds fell from nearly 13% in 2021 to 10% in 2024. And the prevalence of suicide attempts by teens also fell slightly — from 3.6% to 2.7%.Suicide is complex and influenced by awhole host of risk factors, including untreated mental illness, prolonged stress, isolation and access to lethal means such as firearms and medications. The new report doesn't delve into the potential causes for the improvement in teens in recent years. But one reason might be that more teens are opening up to others about their suicidal thoughts, says Harkavy-Friedman. She pointed to a suicide prevention program run by her organization calledTalk Saves Lives, which educates people about the warning signs of suicide.\"Not keeping it inside and just sharing with someone that you're struggling can be helpful,\" she says.Shots - Health NewsTo Prevent Pregnancy-Related Depression, At-Risk Women Advised To Get CounselingBesides, she adds, more teens have been seeking help and finding it.\"More and more kids are getting connected with treatment. And those treatments are specific for suicide and suicide prevention.\"The report also found that the share of teens with an episode of major depression in the past year fell during this time — from 21% to 15%. But only about 60% of teens with a recent episode of depression got treatment.Life KitHow to talk — and listen — to a teen with mental health strugglesAnd 2.6 million teens still had thoughts of suicide in 2024, notes Hannah Wesolowski, chief of advocacy with the National Alliance on Mental Illness.\"That's 1 in 10 kids, which is still far too high in this country,\" she adds. \"So we're making progress, but we're not making progress fast enough.\"The report also found that 700,000 adolescents did attempt suicide in the past year.Mental HealthTreating Teen Depression Might Improve Mental Health Of Parents, TooWesolowski notes that access to mental health care remains challenging for Americans, partly due to high out-of-pocket costs, a shortage of mental health care providers and lack of culturally competent care for different racial and ethnic groups.According to the new report, while there was a slight increase in the number of adults getting mental health treatment, nearly half of adults with mental illness had trouble accessing treatment.Disappearing dataWesolowski notes something missing in the new report compared with previous years.Sponsor Message\"This report does not break out prevalence or treatment rates by race or ethnicity, which it has in the past,\" she says.\"The 2023 report, like in previous years, provided breakdowns by race and ethnicity,\" KFF researcherHeather Saunderswrote NPR in an email.\"Removing these data limits our ability to track behavioral health trends and any differences in access to care,\"she noted.Saunders and her colleagues have used that data in the past tounderstand differences in prevalence of mental illness and serious mental illnessin different racial and ethnic groups.The survey reports from past years, for example, have been key to identifying the recent increase in suicide rates among Black youth, explains Wesolowski.\"Are we making progress on that?\" she says. \"Without that prevalence data and really looking at the data by demographics, we're going to maybe not spend our resources in the right way.\"Andrew Nixon, aspokesperson at the Department of Health and Human Services, told NPR in an emai"
  },
  {
    "title": "Why a NASA satellite that scientists and farmers rely on may be destroyed on purpose",
    "description": "The Trump administration has asked NASA staffers to draw up plans to end at least two satellite missions that measure carbon dioxide in the atmosphere, according to current and former NASA employees.",
    "link": "https://www.npr.org/2025/08/04/nx-s1-5453731/nasa-carbon-dioxide-satellite-mission-threatened",
    "published": "Mon, 04 Aug 2025 05:30:00 -0400",
    "source": "https://feeds.npr.org/1001/rss.xml",
    "content_type": "rss",
    "full_content": "ExclusiveClimateWhy a NASA satellite that scientists and farmers rely on may be destroyed on purposeAugust 4, 20255:30 AM ETRebecca HersherA robotic arm attached to the International Space Station brings in the spacecraft carrying one of two Orbiting Carbon Observatory instruments, known as OCO-3, in 2019. NASA has put out a call for private groups to potentially take over the cost of maintaining the instrument, which measures carbon dioxide in Earth's atmosphere.NASA TV/NASAhide captiontoggle captionNASA TV/NASAThe Trump administration has asked NASA employees to draw up plans to end at least two major satellite missions, according to current and former NASA staffers. If the plans are carried out, one of the missions would be permanently terminated, because the satellite would burn up in the atmosphere.The data the two missions collect is widely used, including by scientists, oil and gas companies and farmers who need detailed information about carbon dioxide and crop health. They are the only two federal satellite missions that were designed and built specifically to monitor planet-warming greenhouse gases.Sponsor MessageIt is unclear why the Trump administration seeks to end the missions. The equipment in space is state of the art and is expected to function for many more years, according to scientists who worked on the missions. Anofficial reviewby NASA in 2023 found that \"the data are of exceptionally high quality\" and recommended continuing the mission for at least three years.Both missions, known as the Orbiting Carbon Observatories, measure carbon dioxide and plant growth around the globe. They use identical measurement devices, but one device is attached to a stand-alone satellite while the other is attached to the International Space Station. The standalone satellite would burn up in the atmosphere if NASA pursued plans to terminate the mission.NASA employees who work on the two missions are making what the agency calls Phase F plans for both carbon-monitoring missions, according to David Crisp, a longtime NASA engineer who designed the instruments and managed the missions until he retired in 2022. Phase F plans lay out options for terminating NASA missions.Crisp says NASA employees making those termination plans have reached out to him for his technical expertise. \"What I have heard is direct communications from people who were making those plans, who weren't allowed to tell me that that's what they were told to do. But they were allowed to ask me questions,\" Crisp says. \"They were asking me very sharp questions. The only thing that would have motivated those questions was [that] somebody told them to come up with a termination plan.\"Sponsor MessageThree other academic scientists who use data from the missions confirmed that they, too, have been contacted with questions related to mission termination. All three asked for anonymity because they are concerned that speaking about the mission termination plans publicly could endanger the jobs of the NASA employees who contacted them.Two current NASA employees also confirmed that NASA mission leaders were told to make termination plans for projects that would lose funding underPresident Trump's proposed budgetfor the next fiscal year, or FY 2026, which begins Oct. 1. The employees asked to remain anonymous, because they were told they would be fired if they revealed the request.A rocket launches carrying the Orbiting Carbon Observatory-2 (OCO-2) satellite on July 2, 2014, at Vandenberg Air Force Base in California. The satellite is providing crucial data about carbon dioxide in the atmosphere and plant growth on Earth's surface. NASA employees are making plans to potentially deorbit the satellite, burning it up in Earth's atmosphere and ending the mission, at the request of the Trump administration.Bill Ingalls/NASA/Getty Images North Americahide captiontoggle captionBill Ingalls/NASA/Getty Images North AmericaCongress funded the missions and may fund them againPresidential budget proposals are wish lists that often bear little resemblance to final congressional budgets. The Orbiting Carbon Observatory missions have already received funding from Congress through the end of the 2025 fiscal year, which ends Sept. 30.Draft budgetsthat Congress iscurrently consideringfor next year keep NASA funding basically flat. But it's not clear whether these specific missions will receive funding again, or if Congress will pass a budget before current funding expires on Sept. 30.Last week,NASA announced it will consider proposalsfrom private companies and universities that are willing to take on the cost of maintaining the device that is attached to the International Space Station, as well as another device that measures ozone in the atmosphere.NASA did not respond to questions from NPR about whether other missions will also be privatized, or about why the agency is making plans to potentially terminate projects that may receive funding in Congress' next budget.In Ju"
  },
  {
    "title": "Leaves piled up after her husband's injury. Then a friend showed up with a rake",
    "description": "In 2017, Eileen Freiberg-Dale's husband, Barney, had a serious bicycle accident that caused a brain injury. Those first few months were among the hardest of her life. A friend offered support.",
    "link": "https://www.npr.org/2025/08/04/nx-s1-5487544/leaves-piled-up-after-her-husbands-injury-then-a-friend-showed-up-with-a-rake",
    "published": "Mon, 04 Aug 2025 05:00:00 -0400",
    "source": "https://feeds.npr.org/1001/rss.xml",
    "content_type": "rss",
    "full_content": "Leaves piled up after her husband's injury. Then a friend showed up with a rakeAugust 4, 20255:00 AM ETByLaura KwerelEileen and Barney Freiberg-Dale in 2014.Freiberg-Dale family photohide captiontoggle captionFreiberg-Dale family photoThis story is part of the My Unsung Hero series, from the Hidden Brain team. It features stories of people whose kindness left a lasting impression on someone else.When Eileen Freiberg-Dale thinks of her husband of 37 years, Barney, she remembers a man with boundless energy and interests.\"He was an incredibly smart, very passionate man,\" she recalled. \"He loved to hike, he loved to backpack, he loved to bike.\"My Unsung HeroHow a woman in the registrar's office made a music teacher feel less aloneTogether, they raised two kids and ran a business in Newton, Mass.But in August of 2017, Barney had a serious accident while riding his bike, which caused a traumatic brain injury. Freiberg-Dale says that when Barney finally came home in mid-October, after spending months in rehab facilities and an intensive care unit, he wasn't the same.\"His mood was agitated and angry, and he could barely walk,\" Freiberg-Dale recalled. \"He couldn't screen his responses to things, so they just came pouring out.\"Barney and Eileen Freiberg-Dale in 2004.Freiberg-Dale family photohide captiontoggle captionFreiberg-Dale family photoFreiberg-Dale says that those first few months were among the hardest of her life. She was grieving the life partner she no longer had and worried about how she would run their business on her own. She was also overwhelmed by the number of things she now had to do for Barney — providing all of his daily physical care, taking him to doctor's appointments, managing the medical bills.Sponsor MessageThen, there were chores around their home, like the leaves that were piling up in their yard. They had to be cleared by the end of October, when the city stopped collecting them.\"Barney had always been the one to take care of that and he could no longer do that,\" she said.One day, Freiberg-Dale realized that she was running out of time to deal with the yard. So, she went outside and started raking the leaves.\"As I did that, madly trying to get them into bins and in bags, I was crying. I was stressed. I didn't know how I was going to do it all,\" she remembered.\"All of a sudden there was a tap on my shoulder, and I turned around and there was Jonathan Lilienfeld,\" Freiberg-Dale said.Jonathan LilienfeldLilienfeld family photohide captiontoggle captionLilienfeld family photoLilienfeld had been the couple's friend of nearly 15 years. Though they hadn't discussed the leaves, he had figured she could use the help and arrived right at that moment with a rake and leaf bags.\"Jonathan just looked at me, put his arm around me and said, 'Go inside, I'll take care of this,'\" she recalled. \"He just said, 'Go inside and rest.'\"Over the next few hours, Lilienfeld raked the entire yard. He packed up all the leaves in leaf bags and put them out in front of the house. When he was done, he came inside for a quick goodbye and then went on his way.My Unsung HeroHow a stranger saved premature baby in need of a blood transfusionToday, eight years later, Freiberg-Dale still gets emotional when she recalls Lilienfeld's gesture of kindness.\"It felt so momentous. I truly felt like he was my hero, that he rescued me,\" she said. \"I was just so touched. And anytime I think about it, I feel the same way.\"My Unsung Hero is also a podcast— new episodes are released every Tuesday. To share the story of your unsung hero with the Hidden Brain team, record a voice memo on your phone and send it to myunsunghero@hiddenbrain.org.traumatic brain injuryFacebookFlipboardEmail"
  },
  {
    "title": "As Trump's tariffs take shape, is America really winning?",
    "description": "The president says his tariffs will spur America into a \"golden age,\" but that remains far from certain. Here are 5 things to know about how his trade policies could impact the U.S. and the global economy.",
    "link": "https://www.npr.org/2025/08/04/nx-s1-5487592/global-economy-tariffs-inflation-prices",
    "published": "Mon, 04 Aug 2025 05:00:00 -0400",
    "source": "https://feeds.npr.org/1001/rss.xml",
    "content_type": "rss",
    "full_content": "EconomyAs Trump's tariffs take shape, is America really winning?August 4, 20255:00 AM ETByRafael NamPresident Trump announces an initial sweeping round of tariffs in the Rose Garden of the White House in Washington, D.C., on April 2.Andrew Harnik/Getty Imageshide captiontoggle captionAndrew Harnik/Getty ImagesWhen it comes to tariffs, President Trump is clear: America is winning.PoliticsThe White House sets a swath of new tariff rates — and a new date — for dozens of countriesAs his administration imposes sweeping tariffs across the world, President Trump argues that the import taxes will make America\"great\" and \"rich,\"making the country once again the \"most respected country anywhere in the world,\" while ushering in a \"golden age.\"But the reality so far is proving to be different.Tariffs are sparking intense uncertainty in the U.S. and around the world — and it's yet unclear how it will all end.Here are five points that explain the effects of tariffs, from Main Street USA to China.Sponsor MessageThe U.S. is starting to feel the effectsFor months, the full impact of Trump's tariffs was not quite clear.A big reason was because Trump did set some tariffs — including a 10% tax on nearly everything the U.S. imports — but he also delayed many others. Many companies also rushed to import things before tariffs kicked in and then held off from passing on the full costs of the implemented tariffs to consumers.But that's starting to change.EconomyAre prices going up because of tariffs? Here's what we knowInflation is picking up, with bothconsumer inflationanda separate inflation gaugefavored by the Fed showing prices increasing more than the previous month.The labor market is also starting to show signs of cooling. A report by the Labor Department last week showed only 73,000 jobs were added in July, fewer than the 100,000 jobs economists had anticipated.It got worse: The report said the U.S. had added a whopping 258,000 fewer jobs in the previous two months than first estimated. In response, Trump firedthe top officialwho had been in charge of gathering the data, accusing her — without evidence — of having manipulated the numbers.In addition to a cooling labor market, the economy is growing more slowly. Data last week showed the U.S. gross domestic productgrew much slowerin the first half of this year than in the previous two years.Sponsor MessageBut the full impact on the U.S. is not yet hereThe effects of tariffs are likely to get bigger.Trump has long claimed that tariffs will be paid for by countries that want to export to the country. In fact, most economists say that the tariff costs will likely be split: Some of the costs will be paid by exporters overseas, some by importers in the U.S., and some by American consumers.BusinessAutomakers are eating the cost of tariffs — for nowThe Yale Budget Lab estimated last week that the average cost of Trump's tariffs to the American householdwould be $2,400this year, with clothes and textiles likely to see the biggest effects.And contrary to Trump's repeated claims that tariffs will boost the economy, experts believe the economy will get weaker, with higher inflation and slower job growth. And the weak labor market report last week will also likely spur more discussions about whether the economy could evenenter a recession.There is one consolation: For the most part, Trump's tariffs are not as high as the ones he first unveiled in April.The Yale Budget Lab now estimates the average effective tariff rate willbe around 18.3%, compared to its initial estimate of an average ofmore than 20%after Trump's \"Liberation Day\" announcement in April — but that's still about a sixfold increase from what Americans were used to paying before Trump returned to the White House.Here's the other thing to keep in mind: Tariffs, according to the Yale Budget Lab, will still be at their highest levels since 1935.Nike is among the companies warning they will face additional costs because of tariffs.Jim Watson/AFP via Getty Imageshide captiontoggle captionJim Watson/AFP via Getty ImagesThe U.S. will raise money from tariffs — but it's still heavily in debtTrump has often touted the revenues the U.S. could raise from tariffs as another justification for imposing them.And indeed, money is coming in. According to data kept by the Treasury Department, the U.S. has so far raisedabout $150 billionsince tariffs took effect.Sponsor MessageThe Yale Budget Lab estimates tariffs could bring in more than $2 trillion over the period from 2026 to 2035.That's a substantial amount of money. The problem is that the U.S. is still heavily in debt — and Trump's other policies, especially his massive tax cut and spending bill, which he calls the \"Big Beautiful Bill,\" willincrease that debt.The Congressional Budget Office estimates the GOP bill would increase the federal debt by $2.4 trillion.In other words, tariffs will indeed bring in money, but potentially not as much as Trump's policies that will increase the nati"
  },
  {
    "title": "How a public library's summer game took over a Michigan city",
    "description": "Summer in Ann Arbor, Mich., means thousands of people hunting for hidden codes around the city and reading books to earn points. It's part of a popular game organized by the public library.",
    "link": "https://www.npr.org/2025/08/04/nx-s1-5477533/public-library-summer-game-ann-arbor-michigan",
    "published": "Mon, 04 Aug 2025 05:00:00 -0400",
    "source": "https://feeds.npr.org/1001/rss.xml",
    "content_type": "rss",
    "full_content": "NPRBooksLISTEN & FOLLOWNPR AppApple PodcastsSpotifyAmazon MusiciHeart RadioYouTube MusicRSS linkBooksHow a public library's summer game took over a Michigan cityAugust 4, 20255:00 AM ETNeda UlabyThe Hautamaki family (Shannon, left, Ian, Graham and Bret) poses outside the Pittsfield branch of the Ann Arbor District Library, where they collected points for The Summer Game.Neda Ulaby/NPRhide captiontoggle captionNeda Ulaby/NPRSummer for thousands of people in Ann Arbor, Mich., means scavenging for hidden codes around the city and voraciously reading books to collect points. It's part of anenormously popular gamethat's beena triumph for the public library that runs it.\"This summer, we have 16,000 active players and more than half of them are adults,\" says library director Eli Neiburger. Not bad for a library that serves about 150,000 people. It's such a local sensation thatone couple even got marriedwhile playing what's known in town as \"The Summer Game.\"The Summer Game started as a reading challenge, but that didn't work very well, Neiburger says. Kids who didn't like reading would slog through the requisite number of books to get points, then be done for the summer. Kids who read long books resented getting the same number of points as those who read short ones.Sponsor MessageSo around 2011, the library decided to pivot. \"Instead of a reading game, we started a library-using game,\" Neiburger explained. \"It includes reading, going to events, using our website, discovering all the things that the library has to offer. And it has been successful beyond our wildest dreams.\"The Summer Game's design, he said, was inspired by corporate loyalty programs such as Coke Rewards. Users earn points by solving puzzles, learning about local history and exploring neighborhoods. Points can be redeemed in the library shop for T-shirts, umbrellas and other merchandise, such as a very popular stuffed plushie animal that's updated every year. (The 2025 animal is a small, bespectacled flamingo.)A Summer Game kiosk outside the Traverwood branch of the Ann Arbor District LibraryNeda Ulaby/NPRhide captiontoggle captionNeda Ulaby/NPR\"I was certainly not expecting how intensely popular it would be with adults,\" Neiburger added. Women in their 50s and 60s are overrepresented among Summer Game players, he noted, which reflects library user demographics. He wanted to use The Summer Game to raise awareness that the library can be used to borrow tools, art and music as well as books, and that it offers help with homework, finding jobs and provides a third space for lectures and crafting.\"Parks and Rec is not just baseball, baseball, baseball,\" he said. \"Why should a library just be read, read, read?\" The Summer Game reflects an ethos of meeting patrons where they are. And its code is open-access, so any library can download it.BooksThese were the most-borrowed books from public libraries in 2024Book News & FeaturesBrooklyn Public Library reveals its most borrowed book ever to celebrate 125 yearsAccording to Raymond Garcia, spokesperson for the American Library Association, the popularity of the Ann Arbor District Library's Summer Game stands out, but is not singular. In an email, he said that the Anne Arundel County Public Library, in Maryland, had a participation rate of 10% of the population from the last census for its\"Summer @ Your Library\"program, including gameplay and event attendance, according to a library manager. Librarians in Dover, Ohio, created a Pokémon-style card-collecting program. Called \"Reading Dragons and Friends,\" it is available for other libraries to use.Sponsor Message\"Libraries are magical,\" Neiburger said. \"It's something that wouldn't be allowed to be created today if it didn't already exist. And for most communities, the library is one of the most beloved government institutions. And for [local governments] to be able to turn outward and embrace their communities and find completely new audiences they didn't know they were reaching, and for those audiences to discover public services that were available to them that they didn't know about, that's magic too.\"Life Kit7 surprising ways the public library can help you save moneyMovie ReviewsA new documentary checks out the many ways libraries are a 'Free For All'public libraryreadinggamessummer readingsummer vacationFacebookFlipboardEmail"
  },
  {
    "title": "Germany updates: Finance minister in US amid tariff tension",
    "description": "German Finance Minister Lars Klingbeil is set to meet with US Treasury Secretary Scott Bessent for talks on trade and trans-Atlantic ties. He said he would seek a tariff exemption for German steel. DW has more.",
    "link": "https://www.dw.com/en/germany-updates-finance-minister-in-us-amid-tariff-tension/live-73516761?maca=en-rss-en-all-1573-rdf",
    "published": "",
    "source": "https://rss.dw.com/rdf/rss-en-all",
    "content_type": "rss",
    "full_content": "PoliticsGermanyGermany updates: Finance minister in US amid tariff tensionRichard Connor|John Silkwith AP, AFP, Reuters, dpaPublished 08/04/2025Published August 4, 2025last updated 08/04/2025last updated August 4, 2025German Finance Minister Lars Klingbeil is set to meet with US Treasury Secretary Scott Bessent for talks on trade and trans-Atlantic ties. He said he would seek a tariff exemption for German steel. DW has more.https://p.dw.com/p/4yT4DThe German finance minister is in Washington on the heels of a EU-US tariff dealImage: Drew Angerer/AFPAdvertisementSkip next section What you need to knowWhat you need to knowGerman Finance Minister Lars Klingbeil is in Washington on his first official visit to the US since taking office.Klingbeil is set meet US Treasury Secretary Scott Bessent to discuss trade, global cooperation, and trans-Atlantic ties. The talks follow a key deal easing tariffs between the EU and the US, cutting duties on European imports to 15%.The finance minister earlier told German media that \"weaknesses\" had been \"exposed\" during the wrangling over US tariffs.He said he would seek an exemption for German steel in talks with Bessent.Meanwhile, just 16% of Germans say they would be willing to take up arms in the event of an attack, a new study has revealed, while more than a quarter of those surveyed said they considered a military attack on the country within the next five years to be very or somewhat likely.And Bavarian State PremierMarkus Söderhas called for a reduction in benefit rates for Ukrainian refugees in Germany.Below you can read a roundup of events, backgrounders and analysis of stories from and connected withGermanyon Monday, August 4:Skip next section Klingbeil pushes for steel quota as tariff deadline nears08/04/2025August 4, 2025Klingbeil pushes for steel quota as tariff deadline nearsSteel production is a mainstay of Germany's industryImage: Martin Meissner/AP Photo/picture-allianceWith just days to go before new US tariffs on EU imports take effect,German Finance Minister Lars Klingbeilhas said he is seeking exemptions for Germany's steel sector.During a visit to Washington, Klingbeil said he would raise the idea of a quota system that could allow certain volumes of steel to be traded across the Atlantic at lower tariff rates — or possibly tariff-free.\"That would be very important for theGerman steel industryand for many jobs in Germany,\" he told reporters in Washington.At the same time, Klingbeil, who is also Germany's vice chancellor, expressed disappointment with the EU's overall negotiations with the United States.\"I think we were too weak. We can't be satisfied with the result that was achieved,\" he said.\"We need to consider what actually came out of the past few weeks of talks.\"Klingbeil had previously warned that Germany would need to draw \"consequences\" from the outcome of the tariff talks. Speaking on public radio Deutschlandfunk, the center-left Social Democrat politician called the current state of global trade \"a setback.\"TheEU and US recently reached a dealto end their long-running tariff dispute. The agreement, brokered by President Donald Trump and European Commission President Ursula von der Leyen, sets a 15% tariff on most EU goods entering the US. The new rules are scheduled to take effect on August 7.Green transition poses risks to European steelmakersTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 videohttps://p.dw.com/p/4yVxRSkip next section Germany to raise 'mother's pension' — despite cash-strapped public coffers08/04/2025August 4, 2025Germany to raise 'mother's pension' — despite cash-strapped public coffersBen KnightThe five-billion-euro raise in mothers' pensions will give former stay-at-home moms 20 euros extra per monthImage: Channel Partners/Zoonar/picture allianceGermany is to give older parents a higher pension than before, thanks to the Bavarian CSU.But businesses and economists say the 'mother's pension' is an extra burden on younger generations.Read thefull story on why the German government is planning to give retired stay-at-home moms more money.https://p.dw.com/p/4yVVHSkip next section Klingbeil calls for stronger coordination on tariffs ahead of US talks08/04/2025August 4, 2025Klingbeil calls for stronger coordination on tariffs ahead of US talksThe German Finance Minister is on a one-day visit to WashingtonImage: Drew Angerer/AFPGerman Finance Minister Lars Klingbeil has urged closer international cooperation as he prepares to meet US Treasury Secretary Scott Bessent in Washington on Monday, following theEuropean Union's recent tariff dealwith President Donald Trump.\"I think that our weaknesses have already been exposed in the dispute with the Americans over customs duties,\" Klingbeil said in an interview with Deutschlandfunk radio ahead of the visit.He called for deeper coordination with other key partners such as Canada and the United Kingdom, adding, \"We must become stronge"
  },
  {
    "title": "Texas governor issues threat as Democrats leave in protest",
    "description": "Democratic state legislators in Texas have said a Trump-backed redistricting plan is an attempt to \"rig the 2026 election.\" Trump said the plan could add five Republicans to the House of Representatives.",
    "link": "https://www.dw.com/en/texas-governor-issues-threat-as-democrats-leave-in-protest/a-73527714?maca=en-rss-en-all-1573-rdf",
    "published": "",
    "source": "https://rss.dw.com/rdf/rss-en-all",
    "content_type": "rss",
    "full_content": "PoliticsUnited States of AmericaTexas governor issues threat as Democrats leave in protestJenipher Camino GonzalezAP, Reuters08/04/2025August 4, 2025Democratic state legislators in Texas have said a Trump-backed redistricting plan is an attempt to \"rig the 2026 election.\" Trump said the plan could add five Republicans to the House of Representatives.https://p.dw.com/p/4yVusSome of the state Democratic legislators landed in Chicago, where they were welcomed by the Deomcratic Governor of Illinois JB PritzkerImage: Mark Black/AP Photo/picture allianceAdvertisementMore than 50 Democratic lawmakers inTexasleft the state on Sunday in an attempt to deny the Republican-led legislature the quorum required to pass acontroversial redistricting of the state.On Monday, Texas Governor Greg Abbott threatened to remove the lawmakers if they did not return to the state within 24 hours.\"If you're seeing this video, my Democratic colleagues and I have just left our beloved state to break quorum and stop Trump's redistricting power grab,\" Democratic Representative James Talarico said in a video posted on X on Sunday.Talarico said the Republican redistricting plan was an attempt at \"rigging\" the 2026 elections.What is the Texas redistricting plan?Currently, theUSHouse of Representatives is held by Republicans with a narrow 220-212 majority, with three Democratic-held seats vacant after members' deaths.To determine the number of representatives that each state is allocated, states are required to redistrict every 10 years based on the US Census.Texas' Republican-dominated legislature passed its latest redistricting just four years ago, but now it is pursuing a mid-cycle redistricting ahead of the 2026 congressional election.US President Donald Trump has openly encouraged the Texas redistricting plan, telling reporters that he expects the effort to yield as many as five additional Republicans to the House of Representatives.US House passes Trump's bill cutting taxes and safety netTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 videoGovernor Abbot threatens mass expulsionsA vote in the Texas legislature on the proposed maps had been set for Monday, but it cannot proceed if the majority of Democratic members deny a quorum by not being present.Some of the state Democratic legislatures landed in New York and some in Chicago, where they were welcomed by the Democratic Governor of Illinois JB Pritzker. They all declined to say how long they would stay out of Texas.\"We will do whatever it takes. What that looks like, we don't know,\" said state Rep. Gene Wu, the Texas House Democratic Caucus leader.Although the move was bold, legislative walkouts often only delay passage of a bill, but do not manage to stop it.Governor Abbott said in a statement that any Democrat House member who did not return within 24 hours would be removed from the Texas House.\"Democrats hatched a deliberate plan not to show up for work, for the specific purpose of abdicating the duties of their office and thwarting the chamber's business,\" Abbot said.Edited by: Wesley RahnSend us your feedbackYour feedbackAdvertisement"
  },
  {
    "title": "Germany: Baboons fed to lions and tigers after zoo culling",
    "description": "Nuremberg Zoo killed 12 baboons due to overcrowding and dismembered six of them before feeding them to predators — removing heads, hands, and feet. The move has triggered widespread upset and legal complaints.",
    "link": "https://www.dw.com/en/germany-baboons-fed-to-lions-and-tigers-after-zoo-culling/a-73525233?maca=en-rss-en-all-1573-rdf",
    "published": "",
    "source": "https://rss.dw.com/rdf/rss-en-all",
    "content_type": "rss",
    "full_content": "SocietyGermanyGermany: Baboons fed to lions and tigers after zoo cullingRichard Connorwith dpa08/04/2025August 4, 2025Nuremberg Zoo killed 12 baboons due to overcrowding and dismembered six of them before feeding them to predators — removing heads, hands, and feet. The move has triggered widespread upset and legal complaints.https://p.dw.com/p/4yVGrThe zoo said it had exhausted all other options, having sought to relocate the animalsImage: Daniel Karmann/dpa/picture allianceAdvertisementNurembergZoo has confirmed that baboons killed to keep down numbers were fed to predators, amid public criticism after it was revealed the animals had been dismembered after death.News of the culling sparked complaintsfrom animal groups over zoo ethics, animal welfare, and culling practices, with the animals decapitated and some having their hands and feet removed.What did the zoo say about the baboon killings?Deputy zoo director Jörg Beckmann told the DPA news agency that the skulls and brains from the bodies were separated for scientific purposes.Six of the 12 Guinea baboons, which were culled due to overcrowding, were then fed to lions, tigers, maned wolves and marbled polecats. Hands and feet were removed \"out of respect for visitors\" who would see the carnivores feeding, Beckmann said.Skeletons of four baboons are being prepared for museum display, the zoo said. Two baboons died during sedation and were sent for pathology rather than being used as feed.Beckmann said the zoo had openlycommunicated in advance that the baboons would be used as food.\"We continue to be transparent and stand by that decision,\" he said. He explained that whole-animal feeding provides crucial dental health benefits for carnivores, as bones and fur help prevent tartar buildup, unlike processed food. \"Unlike many pets, our animals don't need tartar removal under general anesthesia.\"He also emphasized the behavioral benefits of such feeding practices, which mimic natural hunting conditions.\"Evolution equipped them with claws and teeth for this. There's no nature documentary about big predators where they don't spectacularly hunt or feed on a carcass.\"The zoo had said the baboons were killed because the enclosure was chronically overcrowded and no longer met welfare standards. Attempts to rehome the animals failed, and contraceptive measures for the females had not worked as hoped.Tons of ice keep polar bears cool in Prague ZooTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 videoIn a statement last week, the zoo said it acknowledged the emotional impact of the move, saying it understood that many people are \"confused, affected, or angry.\"The zoo explained that the group had grown to more than 40 animals—far exceeding the enclosure's intended capacity of 25 adult baboons.What has been the reaction?Animal welfare groups reacted strongly. The Nuremberg-Fürth public prosecutor's office confirmed it had received hundreds of criminal complaints over the allegedly unlawful killings and is now reviewing the case.The activist group Animal Rebellion began setting up a protest camp near the zoo on Monday. The camp is expected to remain until the following Monday, with organizers demanding an immediate halt to further killings and an end to breeding programs.In a statement, the zoo said: \"Every protest that remains peaceful is acceptable to us.\"Why did the zoo says the baboon cull was necessary?Nuremberg Zoo said the culling was a last resort after years of trying to control the baboon population through non-lethal means, with contraception having only a limited effect and disrupting natural group dynamics.Despite outreach to many institutions, no suitable home was found for the surplus animals.Expanding the facility again wasn’t feasible due to space and funding priorities. The zoo said it could not stop breeding entirely without undermining its long-term conservation role, which requires maintaining healthy, reproducing populations.Edited by: Wesley RahnRichard ConnorReporting on stories from around the world, with a particular focus on Europe — especially Germany.Send us your feedbackYour feedbackAdvertisement"
  },
  {
    "title": "Over 10,000 hotels join complaint against Booking.com",
    "description": "European hotel owners are angry over the \"best price\" clause at the online booking giant they say had kept them from offering rooms for less on their own websites.",
    "link": "https://www.dw.com/en/over-10-000-hotels-join-complaint-against-booking-com/a-73526132?maca=en-rss-en-all-1573-rdf",
    "published": "",
    "source": "https://rss.dw.com/rdf/rss-en-all",
    "content_type": "rss",
    "full_content": "TravelEuropeOver 10,000 hotels join complaint against Booking.comJon Sheltonwith dpa08/04/2025August 4, 2025European hotel owners are angry over the \"best price\" clause at the online booking giant they say had kept them from offering rooms for less on their own websites.https://p.dw.com/p/4yVVMAmsterdam-based Booking.com denies it pricing strategy cost hotels moneyImage: Robin Utrecht/picture allianceAdvertisementEuropean hotel owners are joining together in a class actionsuit against the online platform Booking.com, with more than 10,000 hotels have now signed on to the damages suit.According to the Association of Hotels, Restaurants and Cafes in Europe HOTREC, which represents the industry within the EU, hotel owners will seek compensation for losses incurred between 2004 and 2024 as a result of so-called \"best-price\" clauses that keep hotels from offering rooms for less on their own sites.The initiative is also backed by 30 national hotel associations, including the German Hotel Association (IHA).Netherlands-based Booking.com used the clauses as a way to prevent what it called \"free-rider\" bookings, which it defined as a customer discovering a hotel on Booking.com but then booking directly with the hotel and not the online giant.These clauses had required hotels not to offer rooms at lower prices on other platforms, including their own websites.What is the basis of the claims?A suit to be brought before an Amsterdam court by the Hotel Claims Alliance — and supported by HOTREC and 30 more hotel associations — cites a September 19, 2024European Court of Justice (ECJ)verdict finding best-price clauses illegal.The ECJ ruled that online platforms could operate without putting such restrictions on partner hotels.Booking.com did away with the clause in 2024 as a result of the European Union Digital Markets Act.\"European hoteliers have long suffered from unfair conditions and excessive costs,\" according to HOTREC President Alexandros Vassilikos.\"This joint initiative sends a clear message: abusive practices in the digital market will not be tolerated by the hospitality industry in Europe.\"HOTREC on Monday announced an extension of the time limit to join the suit against Booking.com until August 29.\"The class action is receiving overwhelming support,\" IHA Managing Director Markus Luthe told Germany's DPA news agency.What has Booking.com said?Booking.com said has not received an official lawsuit, according to reporting by DPA.\"This is a statement from HOTREC, not a filed class action,\" the company said in response to an inquiry.It also rejected the claims by the hotel associations, and the legal arguments based on the ECJ ruling.\"Each of our accommodation partners is free to set their own distribution and pricing strategies and can offer their rooms wherever they choose,\" the statement said.Edited by: Wesley RahnJon SheltonWriter, translator and editor with DW's online news team.Send us your feedbackYour feedbackAdvertisement"
  },
  {
    "title": "Russia warns against 'nuclear rhetoric' amid Trump row",
    "description": "The Kremlin has played down the significance of Trump repositioning US submarines in response to an inflammatory post by Dmitry Medvedev.",
    "link": "https://www.dw.com/en/russia-warns-against-nuclear-rhetoric-amid-trump-row/a-73523632?maca=en-rss-en-all-1573-rdf",
    "published": "",
    "source": "https://rss.dw.com/rdf/rss-en-all",
    "content_type": "rss",
    "full_content": "ConflictsRussian FederationRussia warns against 'nuclear rhetoric' amid Trump rowJon Sheltonwith AFP, Reuters08/04/2025August 4, 2025The Kremlin has played down the significance of Trump repositioning US submarines in response to an inflammatory post by Dmitry Medvedev.https://p.dw.com/p/4yUr2US President Donald Trump said two US nuclear submarines had been relocated in response to a Russian social media statementImage: Juan Antoine King/ABACA/picture allianceAdvertisementThe Kremlin on Monday urged a tamping down of nuclear rhetoric after US PresidentDonald Trumpreacted to threats leveled by formerRussianPresidentDmitry Medvedevon social media.Medvedev took to social media last week, warning Trump of Russia's nuclear capabilities after the US president shortened a imposed deadline for Moscow to enter ceasefire negotiations with Ukraine or face serious consequences.Trump responded on Friday by announcing that two US \"nuclear submarines\" had been repositioned \"in the appropriate regions\" in response to his \"highly inflammatory statements.\"On Monday, Kremlin spokesman Dmitry Peskov told reporters, \"Russia is very attentive to the topic of nuclear non-proliferation. And we believe that everyone should be very, very cautious with nuclear rhetoric.\"Peskov added that Moscow has no interest in escalating the situation, noting it is clear that US nuclear submarines \"are always on alert in any case,\" suggesting Trump's statement would not influence Kremlin behavior.Medvedev, who served as Russian President from 2008-2012 and is now deputy chair of the Security Council of the Russian Federation, is widely seen as a provocateur for Russian PresidentVladimir Putin, who has become known for releasing hardline statements since Moscow launched the war in Ukraine.Trump has previously told Medvedev to \"watch his words.\"Russian President Vladimir Putin has leveled nuclear threats atUkraine— which gave up its Soviet era nuclear arsenal in return for US, UK and Russian security assurances in 1994 — in an attempt to disrupt alliances between Kyiv, the West and NATO.Trump orders nuclear subs near Russia amid spat with KremlinTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 videoTrump envoy Witkoff heads to MoscowTrump, who said he would end Russia's war of aggression in Ukraine on his first day in office, is currently threatening unspecified sanctions on Russia if Moscow does not take steps to end the war by Friday — something Russian President Putin has been unwilling to do.Trump has recentlyvented displeasure with Putinand has begun threatening India and China with \"secondary tariffs\" for their energy and economic ties with Russia.On Sunday, Trump announced that he would be dispatching special envoy Steve Witkoff to Moscow on \"Wednesday or Thursday\" as the US administration continues in its efforts to secure a ceasefire between Russia and Ukraine.Numerous previous meetings between Witkoff and Putin have so far not contributed towards Russia ending itsongoing invasion.Asked about what he wanted Witkoff to achieve in Moscow, Trump said, \"get a deal where people stop getting killed.\"Expert: Trump's nuclear sub move toward Russia is symbolicTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 videoEdited by: Wesley RahnJon SheltonWriter, translator and editor with DW's online news team.Send us your feedbackYour feedbackAdvertisement"
  },
  {
    "title": "Germany to raise 'mother's pension' — despite cash-strapped public coffers",
    "description": "Germany is to give older parents a higher pension than before, thanks to the Bavarian CSU. But businesses and economists say the 'mother's pension' is an extra burden on younger generations.",
    "link": "https://www.dw.com/en/germany-to-raise-mother-s-pension-despite-cash-strapped-public-coffers/a-73522496?maca=en-rss-en-all-1573-rdf",
    "published": "",
    "source": "https://rss.dw.com/rdf/rss-en-all",
    "content_type": "rss",
    "full_content": "SocietyGermanyGermany to raise 'mother's pension'Ben Knight08/04/2025August 4, 2025Germany is to give older parents a higher pension than before, thanks to the Bavarian CSU. But businesses and economists say the 'mother's pension' is an extra burden on younger generations.https://p.dw.com/p/4yUYiThe five-billion-euro raise in mothers' pensions will give former stay-at-home moms 20 euros extra per monthImage: Channel Partners/Zoonar/picture allianceAdvertisementTheChristian Social Union(CSU), the Bavarian sister-party to ChancellorFriedrich Merz's conservativeChristian Democratic Union(CDU), appears to have persuaded its big sibling to implement one of its own pet projects: Raising the pension subsidy for older parents — colloquially known as theMütterrente,or \"mother's pension\" — one year earlier than planned.Thepensionrise for parents who had children before 1992 comes with a price tag of around €5 billion annually and is now set to be implemented on January 1, 2027, despite major cuts elsewhere in Germany's federal budget.According to German media reports,the government still has a gap of some €172 billion ($198 billion)for its financial planning for the years 2027 to 2029.The planned rise in 2027 is the third of three steps and adds an extra half a percentage point to the pension — that works out at around €20 per child per month for children born before 1992. Previously, parents whose children were born after 1992 received a slightly higher percentage.CSU General Secretary Martin Huber called the move the \"completion\" of the mother's pension plan, and said that 10 million women would profit. \"For many female pensioners, this rise makes a big difference,\" he told theRNDnews network.For this elderly German shopkeeper, retirement not an optionTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 videoWho does the mother's pension benefit?Though the change will iron out a disparity between the pensions received by older and younger generations, experts say the measure does nothing to close the gender pay gap between men and women, or indeed overall inequality in the country. Despite the name, all parents are eligible for the \"mother's pension,\" as are foster parents and grandparents, if the child lived with them for a significant amount of time.Peter Haan, specialist in state finance policy at the German Institute for Economic Research (DIW), and co-author of a study on the pension, thinks it's not an effective way to close the \"gender pension gap.\"The key question, as far as Haan is concerned, is who actually benefits. It does, he admitted, make superficial sense for older mothers to get the same benefits as those who had their children after 1992. \"But the pensions for that generation were significantly higher than for the younger generation,\" Haan told DW. \"And secondly, it's a 'watering can' measure that is equal for all mothers, and so doesn't specifically do anything to combat poverty among older people.\"The €20 per child per month might certainly be useful for many older people with lower incomes, but the very poorest women won't profit from it anyway — because the \"mother's pension\" is actually deducted from any welfare benefits they receive.Helping families — especially Bavarian onesThe mother's pension dates back to 2013, when the CSU pushed through the plan underAngela Merkel's government as a way to compensate parents — in practice mainly mothers —  who took time off to raise children and therefore paid less into the pension system.Since then, the CSU has made the plan one of its key policies, not least because it is popular among its own Bavarian electorate —many of whom are older people. In the intervening years, keeping the mother's pension has been the CSU's line in the sand in negotiations with its coalition partners the CDU and the center-leftSocial Democratic Party(SPD).\"Backing down on this issue would be unthinkable for a CSU leader,\" political scientist Ursula Münch, director of the Tutzing Academy for Political Education in Bavaria, told DW. \"If the other parties do not meet it, it will refuse to support their proposals while playing on public opinion in an ageing society.\"Germany's labor shortage: Lufthansa turns to retireesTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 videoHelping the old at the expense of the youngBut the idea is also unpopular among Germany's business community, who have been hoping that Merz's conservative government would, instead of increasing pensions, do more to keep more people on the job market. \"All this is going completely in the wrong direction,\" said Judith Röder of the Federal Association of Wholesale, Foreign Trade and Services (BGA). \"Everything that leads to increased welfare spending is a problem, and anything that signals less employment in an ageing society is also bad. And the mother's pension is both of those things.\"\"[Raising the mother'"
  },
  {
    "title": "Sri Lanka: Farmers fight solar plans on ancestral lands",
    "description": "Tamil farmers say the Sri Lankan and Indian governments' plans for a solar power plant in eastern Sri Lanka will use land that was seized during the country's civil war. What is being done to compensate them?",
    "link": "https://www.dw.com/en/sri-lanka-farmers-fight-solar-plans-on-ancestral-lands/a-73522742?maca=en-rss-en-all-1573-rdf",
    "published": "",
    "source": "https://rss.dw.com/rdf/rss-en-all",
    "content_type": "rss",
    "full_content": "PoliticsSri LankaSri Lanka: Farmers fight solar plans on ancestral landsJeevan Ravindranin Sampur, Sri Lanka08/04/2025August 4, 2025Tamil farmers say the Sri Lankan and Indian governments' plans for a solar power plant in eastern Sri Lanka will use land that was seized during the country's civil war. What is being done to compensate them?https://p.dw.com/p/4yUcgTamil farmers say they have been blocked from farming on their ancestral landImage: Jeevan RavindranAdvertisementStanding next to a tall, wired fence, Sinnathurai Chitravelayutham looks out at his farming land. It's been nearly 20 years since he was allowed to use it.\"Don't ask me how I feel, I'll get upset,\" the 68-year-old told DW.Chitravelayutham is a rice farmer from Sampur in easternSri Lanka'sTrincomalee District. He fled his homeland in April 2006, after the area came under heavy shelling during Sri Lanka's civil war.The conflict, which spanned from the mid 1980s to 2009, was primarily a struggle between the Sinhalese majority and the Tamil minority, with the separatist Liberation Tigers of Tamil Eelam (LTTE) — also known as theTamil Tigers— fighting government forces for an independent state.When he returned after the conflict had ended, he and 107 others found their farming land was under government control. They said attempts to farm on their land were met with threats of arrest, and a fence was later erected to stop them from gaining access.To date, they say they have not received any compensation.Now, their land has been allocated as the site for a newsolar powerplant to be built as a collaborative project between Sri Lanka's Ceylon Electricity Board (CEB) andIndia'sstate-owned National Thermal Power Corporation (NTPC).Indian Prime MinisterNarendra Modiand Sri Lankan President Anura Kumara Dissanayake jointly inaugurated the projectduring Modi's visit to Sri Lanka in April.A battle for compensationThe land belonging to Chitravelayutham and the other villagers was designated as a high-security zone in 2008, at the height of the civil war.Kandumani Lavakusarasa, the coordinator of the AHAM Humanitarian Resource Center in Trincomalee, said over 500 acres had now been allocated for the solar power plant.Of that total, he said 147 acres used to be farming land belonging to villagers including Chitravelayutham, and a further 58 acres was residential land.Modi (left) signed a raft of defense and energy deals to boost relations with Sri LankaImage: Ishara S. Kodikara/AFP/Getty ImagesThe Governor of the Eastern Province's Media Division told DW that \"legal action\" was being taken to provide redress to claimants \"who have rights to the land,\" while those \"who are able to prove their legal status in writing and live here can apply for the compensation process.\"Although the villagers have temporary deeds, they said the Divisional Secretariat, which handles land allocation, had requested to see the original deeds and survey plans before examining any claims.The villagers told DW they wanted their original lands back because they were fertile and well irrigated, and that other land would likely not meet the same specifications.In a statement, the Muthur Divisional Secretariat (DS), which is responsible for oversight of the land in Sampur, told DW that only two people had applied for compensation, but did not say whether they had received it.It also said officials had received a report from 33 people requesting that the land be returned to them, but that they were \"currently residing in other government land and engaged in cultivation.\" The DS added that steps would be taken to provide alternative land \"if they are confirmed to be truly landless\".Dhammike Wimalaratne, spokesperson for the Ceylon Electricity Board (CEB), told DW that he had no knowledge that anyone had come forward to claim the land, which had been identified as being owned by the government.However, he added that \"the people are number one\" and said they should meet the Divisional Secretariat to prove their right of ownership.DW reached out to India's NTPC and government officials for comment but did not receive a response by the time of publication.India-Sri Lanka relationsInitially, India and Sri Lanka wanted to collaborate on a coal power plant in Sampur, but the plan was scrapped in 2016 after a widespread outcry.Current president Dissanayake's Janatha Vimukthi Peramuna (JVP) party was a staunch opponent of the initial plan.\"People were happy because they thought they would get their land back, but it didn't happen,\" AHAM coordinator Lavakusarasa told DW.Tamils fight back against land grabs in Sri LankaTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 videoVillager Chitravelayutham said he had voted for leftist Dissanayake, whose government took power in November, in the hopes that things might change.\"We thought that when this government came to power, they would give us our land back, but it doesn't look like we're going to get"
  },
  {
    "title": "Afghan refugees in Iran: Deported to uncertainty",
    "description": "More than 1.3 million Afghan refugees have been forced to leave Iran in 2025, according to the UN. For many, returning to Afghanistan means facing extreme hardship under the Taliban regime.",
    "link": "https://www.dw.com/en/afghan-refugees-in-iran-deported-to-uncertainty/a-73522282?maca=en-rss-en-all-1573-rdf",
    "published": "",
    "source": "https://rss.dw.com/rdf/rss-en-all",
    "content_type": "rss",
    "full_content": "Human RightsAsiaAfghan refugees in Iran: Deported to uncertaintyShabnam von Hein08/04/2025August 4, 2025More than 1.3 million Afghan refugees have been forced to leave Iran in 2025, according to the UN. For many, returning to Afghanistan means facing extreme hardship under the Taliban regime.https://p.dw.com/p/4yUVGMany children of refugee families were born in Iran and hardly know AfghanistanImage: Ali Kaifee/DWAdvertisementZahra's family fledAfghanistanforIranalmost 30 years ago. Today, the 23-year-old — who is married with a young daughter — lives in constant fear of deportation. Her husband, who also fled Afghanistan, works as an agricultural laborer.\"He can be arrested at any time on his way to work or home and deported to Afghanistan, like so many others,\" said Zahra.According to aUN reportpublished in July, 1.35 million Afghan refugees have been forced to leave Iran in recent months. Many were arrested and deported, while others returned voluntarily for fear of arbitrary arrest.Zahra, who was born and raised in Iran, only has a temporary residence permit. \"I'm listed in my parents' family passport, which is valid until September,\" she explained. The travel document is checked regularly and renewed every six months.Even those Afghan refugees who have lived in Iran for generations — some now in their second or third — they are not granted Iranian citizenship.Iran has deported hundreds of thousands of refugees to Afghanistan in just a few weeksImage: MUSTAFA NOORI/Middle East Images/AFP via Getty ImagesFor over 40 years, people have been fleeing Afghanistan to escape war, poverty, and nowthe Taliban's rule. Many initiallyseek refuge in neighboring countriessuch as Iran orPakistan, however, they are often among the first people to be blamed for pushing up unemployment and crime.Arbitrarily arrested and deportedAfter the recent12-day war between Israel and Iran, Iranian authorities launched a large-scale deportation campaign against Afghans who they say are living in their country illegally.In response to the deportation campaign, more than 1,300 Iranian and Afghan activists, journalists, artists, and citizens have written an open letter to the Iranian government.They are calling for an immediate end to the repression of Afghan refugees, who are being arbitrarily arrested and deported. They also call on the Iranian people to oppose these attacks so that their silence is not perceived as complicity.Refugees have long complained about systematic and increasingly intense racist attitudes in society, which they say are being fueled by the authorities.Over a million Afghans forced back from Iran to Taliban ruleTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 videoNegative coverage in Iranian media shifts blame for social and economic problems onto refugees, fueling resentment among disadvantaged groups and turning them against the migrants.Zahra recalls that, as a documented refugee, she wasn't even given a place in school, on the grounds that there weren't enough places for locals.\"The deportations in recent months have often been carried out without regard for international standards,\" argued Afghan human rights activist Abdullah Ahmadi. \"Many of those deported were taken to the border overnight — without shelter, medical care, or adequate food. Some even had to pay for the journey themselves.\"Among the returnees are numerous families who returned to Afghanistan on their own initiative for fear of arbitrary arrest. Many of them say they have not received their outstanding wages or the deposits they paid for their apartments.Cooperation with the TalibanIn response to growing criticism, the Iranian authorities emphasize that they had asked all \"illegal\" refugees toleave the country six months ago.Nader Yarahmadi, head of the Center for Foreigners and Refugees at the Ministry of the Interior, told the state news agency IRNA in early July: \"We announced in March that all illegal migrants must leave the country by July 15 at the latest.\"The increased number of irregular immigrants from Afghanistan following theTaliban's takeoverhas placed an enormous strain on the country's limited resources. In January, Foreign Minister Abbas Araghchi traveled to the Afghan capital, Kabul, to negotiatecooperation with the Taliban, including the deportation of refugees.Afghanistan: Women become 'invisible' under TalibanTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 videoIranian President Masoud Pezeshkian said in July that he was \"ready to travel to Afghanistan to open a new chapter in relations between the two countries.\"His announcement was widely interpreted as possibly signalingrecognition of the Taliban. However, Iran's Foreign Ministry later clarified that the statement was merely an expression of personal interest and there were no official travel plans.The mass deportations have led to growing criticism of Iran "
  },
  {
    "title": "Scientists search for climate clues in ancient ice",
    "description": "Scientists drilled thousands of meters into the Antarctic ice sheet to retrieve the world's oldest ice sample. They hope it could provide insight into today's climate crisis.",
    "link": "https://www.dw.com/en/scientists-search-for-climate-clues-in-ancient-ice/a-73499132?maca=en-rss-en-all-1573-rdf",
    "published": "",
    "source": "https://rss.dw.com/rdf/rss-en-all",
    "content_type": "rss",
    "full_content": "ClimateGermanyScientists search for climate clues in ancient iceLouise Osborne08/04/2025August 4, 2025Scientists drilled thousands of meters into the Antarctic ice sheet to retrieve the world's oldest ice sample. They hope it could provide insight into today's climate crisis.https://p.dw.com/p/4yOTsScientists at the Little Dome C camp in Antarctic, where they retrieved the ancient iceImage: PNRA_IPEVAdvertisementScientists in Germany are studying a 1.2-million-year-oldice core retrieved from Antarcticaafter years of planning and months of drilling in temperatures of -35 degrees Celsius (-31 Fahrenheit).International teams reached depths of 2,800 meters (1.74 miles) into the Antarctic ice sheet to claim the oldest continuous ice core to have ever been drilled. The scientists are now hoping it will unlock vital information about theEarth's climate.\"Ice cores are climate archives, so they tell us something about the climate history of the Earth,\" said Maria Hörhold, glaciologist at theAlfred Wegener Institute (AWI),where one of the samples is being studied.The core contains air bubbles allowing scientists to measure the quantities ofgreenhouse gases, like CO2,held in the atmosphere over the last 1.2 million years.Researchers hope the ice samples will unlock more secrets about Earth's carbon cycleImage: PNRA_IPEVThey hope the ice core could help scientists better understand climate change by shedding more light on the connection between the carbon cycle and the temperatures on the planet.Improving predictions on climateIn past ice core samples, researchers were able to see alternating hot periods with cold, or glacial periods, that took place approximately every 100,000 years. But looking further back, the cold temperatures occurred more frequently — around every 40,000 years.\"This is mainly driven, for example, by planetary features, like how the Earth is positioned towards the Sun,\" Hörhold told DW. \"But people do not really know why we shifted from a 40,000-year cycle at say 1.5 million years ago to what we have today.\"By extending the 800,000-year-old ice core record and figuring out why the cycle changed, researchers hope to \"improve predictions of how Earth's climate may respond to future greenhouse gas increases,\" said Liz Thomas of theBritish Antarctic Survey.\"There is no other place on Earth that retains such a long record of the past atmosphere as Antarctica,\" added Thomas in a statement. \"It's our best hope to understand the fundamental drivers of Earth's climate shifts.\"Scientists spent months drilling to reach the ancient ice so they could extend the ice recordImage: PNRA_IPEVCO2 concentrations higher than everScientists already know that concentrations of greenhouse gases, like CO2, were lower during colder periods on Earth. Whileduring warmer times,a build-up of greenhouse gases in the atmosphere prevented heat from escaping.\"The idea is that you understand how the climate internally interacts, so how do atmospheric patterns interact, how does ice sheet elevation interact with sea level, and so on,\" she told DW, adding that studying the ice core would hopefully improve their understanding of those interactions.However, she added that even during previous warm periods in Earth's history, CO2 concentrations were much lower than they are today. The current high levels are primarily the result of human-driven global warming, caused by the burning of fossil fuels like oil and gas.A project across EuropeThe pan-European ice core study is part of theBeyond EPICA – Oldest Iceproject.The ice sample has been cut into one-meter length pieces. These have now been delivered for processing into smaller sub-samples at organizations including AWI polar and marine institute in Bremerhaven, Germany, and the British Antarctic Survey in Cambridge, UK.Scientists seek climate clues in Antarctica's ancient iceTo view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 videoBut Hörhold said it will take at least a year for the first findings to be published, while other discoveries would likely take longer.Still, for scientists like Hörhold, who have been part of the Oldest Ice project for years, the retrieval of the ice core is an exciting new chance to discover more about the Earth.\"For every one of us, this was very special; to have that ice in our hands and to know that this is really old and an unprecedented ice core record,\" said Hörhold. \"It's a real honor for us to be responsible for processing here.\"Edited by: Jennifer CollinsLouise OsborneDW's Chief climate reporter provides expertise on the defining crisis of our time.Send us your feedbackYour feedbackAdvertisement"
  },
  {
    "title": "South China Sea: India, Philippines hold first joint patrol",
    "description": "The military cooperation between India and the Philippines in the disputed South China Sea is likely to irk Beijing. The joint drills come as Filipino President Ferdinand Marcos sets off on a visit to India.",
    "link": "https://www.dw.com/en/south-china-sea-india-philippines-hold-first-joint-patrol/a-73518047?maca=en-rss-en-all-1573-rdf",
    "published": "",
    "source": "https://rss.dw.com/rdf/rss-en-all",
    "content_type": "rss",
    "full_content": "PoliticsAsiaSouth China Sea: India, Philippines hold first joint patrolMidhat FatimahAP, AFP08/04/2025August 4, 2025The military cooperation between India and the Philippines in the disputed South China Sea is likely to irk Beijing. The joint drills come as Filipino President Ferdinand Marcos sets off on a visit to India.https://p.dw.com/p/4yTOxIndia sent its guided missile destroyer INS Delhi for the joint naval drillsImage: Ted Aljibe/AFP/Getty ImagesAdvertisementIndiaand the Philippines conducted their first joint naval exercises in the disputedSouth China Sea, the Filipino military said Monday.The naval exercises come as the Philippines' President Ferdinand Marcos departed for a state visit to New Delhi on Monday, where he is expected to hold talks with Indian Prime MinisterNarendra Modi.What we know about the joint Indian-Filipino patrols in the South China SeaBefore departing for his five-day trip to India, Marcos praised the two countries' \"steadfastness in upholding international maritime law, including the UNCLOS\", the UN treaty granting an exclusive economic zone within 200 nautical miles (370 kilometres) of a country's shores.The two-day exercises started on Sunday and include three Indian vessels.India's naval vessels, including the guided missile destroyer INS Delhi, arrived in Manila for a port visit late last week.The Philippines deployed two frigates.The patrol \"started yesterday afternoon, then it's ongoing up to this moment... the activity at the moment is replenishment at sea,\" Lieutenant Colonel John Paul Salgado told news agency Agence France Press.The joint naval drills between India and the Philippines started on SundayImage: Ted Aljibe/AFP/Getty ImagesHow did China respond to the joint naval patrols?The cooperation between India and Philippines is likely to upsetChina, which claims the South China Sea in its entirety.Answering a question aboutChina's retaliatory move to the naval exercises, Armed Forces of the Philippines chief of staff Romeo Brawner said without elaborating that \"we did not experience any untoward incident but we were still shadowed. We expected that already.\"Brawner said the naval patrols had been successful so far and expressedhopes that Filipino forces could engage India's militaryin more joint maneuvers in the future.The Philippines has actively increased its military cooperation with several allies in the last after a series of clashes in the disputed areas with China.China has made claims over large parts of the South China Sea, including maritime zones claimed by the Philippines, Vietnam, Indonesia, Malaysia and Brunei. Some $3 trillion-worth (€2.6 trillion) of goods are shipped through the strategically important region annually.Who's challenging Beijing in the South China Sea?To view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 videoChina also has a longstanding border dispute with India in the Himalayas.Last week, China called Manila a \"troublemaker\"that has aligned itself with foreign forcesto stir up trouble in what China deems its own territorial waters.\"China never wavers in its resolve and will to safeguard national territorial sovereignty and maritime rights and interests and will take resolute countermeasures against any provocations by the Philippine side,\" Defense Ministry spokesperson Zhang Xiaogang said in a news conference.Edited by: Alex BerryMidhat FatimahWriter and reporter based in New Delhi@MidhatFatimahSend us your feedbackYour feedbackAdvertisement"
  },
  {
    "title": "Rivian has filed a lawsuit in Ohio to be able to sell its electric vehicles directly to consumers in",
    "description": "Rivian has filed a lawsuit in Ohio to be able to sell its electric vehicles directly to consumers in the state — the latest swing in a perpetual fight between up-and-coming American automakers and the entrenched and powerful dealership lobby.The companysued the registrar of Ohio’s Bureau of Motor Ve...",
    "link": "https://techcrunch.com/2025/08/04/rivian-sues-to-sell-its-evs-directly-in-ohio/",
    "published": "2025-08-04T13:28:59.920354",
    "source": "https://techcrunch.com",
    "content_type": "web",
    "full_content": "Rivian has filed a lawsuit in Ohio to be able to sell its electric vehicles directly to consumers in the state — the latest swing in a perpetual fight between up-and-coming American automakers and the entrenched and powerful dealership lobby.The companysued the registrar of Ohio’s Bureau of Motor Vehicles(BMV) on Monday in federal court, claiming the state is harming consumers by blocking direct sales. Rivian is currently able to sell EVs directly to consumers in 25 states and in Washington, D.C.Ohio’s BMV did not immediately respond to a request for comment.“Ohio’s prohibition of Rivian’s direct-sales-only business model is irrational in the extreme: it reduces competition, decreases consumer choice, and drives up consumer costs and inconvenience — all of which harm consumers — with literally no countervailing benefit,” lawyers for the company wrote in the complaint.Rivian is asking the court to allow the company to apply for a dealership license so it can sell vehicles directly. Ohio customers have to buy from Rivian vehicles from locations in other states where direct sales are allowed. The cars are then shipped to Rivian service centers within Ohio.Allowing Rivian to sell directly would not be treading new legal ground, the company argues in its complaint. Tesla has had a license to sell in Ohio since 2013 and can sell directly to consumers.What’s stopping Rivian is a 2014 law passed by the state’s legislature. That law, which Rivian says came after an intense lobbying effort by the Ohio Automobile Dealers Association (OADA), effectively gave Tesla a carve-out and blocked any future manufacturers from acquiring the necessary dealership licenses. (The OADA did not immediately return a request for comment.)Techcrunch eventTech and VC heavyweights join the Disrupt 2025 agendaNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.Tech and VC heavyweights join the Disrupt 2025 agendaNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.San Francisco|October 27-29, 2025REGISTER NOW“Consumer choice is a bedrock principle of America’s economy. Ohio’s archaic prohibition against the direct-sales of vehicles is unconstitutional, irrational, and harms Ohioans by reducing competition and choice and driving up costs and inconvenience,” Mike Callahan, Rivian’s chief administrative officer, said in a statement.Rivian has won legal fights over direct sales before. In 2021, Rivian and Lucid Motors were granted dealership licenses to sell EVs in Illinois. That state’s dealer association sued to try to block Rivian and Lucid from selling directly butultimately failed.Lucid Motors, meanwhile,filed a lawsuit of its own in Texas in 2022in a challenge to that state’s direct-sales ban. The court ruled against Lucid earlier this year, but the company has appealed, federal court records show."
  },
  {
    "title": "Electric air taxi developer Joby Aviation has agreed to buy Blade Air Mobility’s helicopter rideshar",
    "description": "Electric air taxi developer Joby Aviation has agreed to buy Blade Air Mobility’s helicopter rideshare business for as much as $125 million.Joby is buying the Blade brand and the company’s passenger business, which includes operations in the United States and Europe. Blade founder and CEO Rob Wiesent...",
    "link": "https://techcrunch.com/2025/08/04/joby-aviation-to-buy-blade-air-mobilitys-ride-share-business/",
    "published": "2025-08-04T13:29:00.800914",
    "source": "https://techcrunch.com",
    "content_type": "web",
    "full_content": "Electric air taxi developer Joby Aviation has agreed to buy Blade Air Mobility’s helicopter rideshare business for as much as $125 million.Joby is buying the Blade brand and the company’s passenger business, which includes operations in the United States and Europe. Blade founder and CEO Rob Wiesenthal will continue to lead the business, which will operate as a wholly-owned subsidiary of Joby.Blade’s medical division, which transports organs, isn’t included in the transaction and will remain a separate company.The deal gives Joby instant access to a network of 12 terminals in key markets like New York City — notably, a dedicated lounge as well as terminal bases at John F. Kennedy International Airport, Newark Liberty Airport, the West Side of Manhattan, the East Side of Manhattan, and Wall Street.Blade, founded in 2014, doesn’t own a fleet of aircraft. Instead, the company has developed a digital network that allows passengers to book private rides on helicopters across several short-hop routes. The service has grown in popularity as well-heeled customers seek ways to avoid traffic on their commutes from the suburbs into Manhattan, or to The Hamptons for weekends and holidays. The company, which also offers access to routes from Nice, France, to Monaco and Saint-Tropez, flew more than 50,000 passengers in 2024.Joby Aviation founder and CEO JoeBen Bevirt described the deal as a “strategically important” acquisition that will support its launch of its commercial operations in Dubai and subsequent global rollout. The company said it will integrate its software, which is designed to manage air taxi operations, into Blade’s passenger service.Joby, founded in 2009 by Bevirt, has been working for more than a decade to develop, certify, and produce an electric vertical take off and landing (eVTOL) aircraft for commercial taxi service in cities. (The company is also pursuing a separatedefense-related business.) Eventually, the branded Blade service will use electric air taxis, not helicopters, in its service, according to the companies.Techcrunch eventTech and VC heavyweights join the Disrupt 2025 agendaNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.Tech and VC heavyweights join the Disrupt 2025 agendaNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.San Francisco|October 27-29, 2025REGISTER NOWToyota-backed Jobywent publicin 2021 through a merger with Reinvent Technology Partners, a special purpose acquisition company backed by LinkedIn co-founder Reid Hoffman and Zynga founder Mark Pincus.Under terms of the agreement, Joby is holding back $35 million of the purchase price, which will be released if Blade hits certain performance milestones and retains certain key employees."
  }
]